<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>Fengrui Liu&#39;s Blog</title>
  
  
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://www.liufr.com/"/>
  <updated>2020-12-02T11:57:21.279Z</updated>
  <id>http://www.liufr.com/</id>
  
  <author>
    <name>Fengrui Liu</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>实时异常检测(xStream，KDD&#39;18)</title>
    <link href="http://www.liufr.com/2020/12/02/%E6%B5%81%E5%A4%84%E7%90%86/2019-08-13-%E5%AE%9E%E6%97%B6%E5%BC%82%E5%B8%B8%E6%A3%80%E6%B5%8B/"/>
    <id>http://www.liufr.com/2020/12/02/流处理/2019-08-13-实时异常检测/</id>
    <published>2020-12-01T16:00:00.000Z</published>
    <updated>2020-12-02T11:57:21.279Z</updated>
    
    <content type="html"><![CDATA[<h2 id="xstream-&#x4F18;&#x52BF;&#x4E0E;&#x8D21;&#x732E;">xStream &#x4F18;&#x52BF;&#x4E0E;&#x8D21;&#x732E;</h2><p><a href="https://cmuxstream.github.io/" target="_blank" rel="noopener">xStream: Outlier Dete&#x2018;x&#x2019;ion in Feature-Evolving Data Streams</a></p><ul><li>&#x9996;&#x6B21;&#x5BF9;&#x7279;&#x5F81;&#x4E0D;&#x65AD;&#x53D8;&#x6362;&#x7684;&#x6570;&#x636E;&#x6D41;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x3002;<ul><li>&#x6570;&#x636E;&#x6D41;&#x4E0D;&#x4EC5;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x51FA;&#x73B0;&#x7684;&#x65B0;&#x7684;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x5DF2;&#x6709;&#x6570;&#x636E;&#x70B9;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x53D8;&#x5316;&#xFF0C;&#x51FA;&#x73B0;&#x65B0;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6570;&#x636E;&#x77E9;&#x9635;&#x7684;&#x884C;&#x5217;&#x89C4;&#x6A21;&#x90FD;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x3002;</li></ul></li><li>&#x7B97;&#x6CD5;xStream&#x7684;&#x7279;&#x6027;<ul><li>&#x7B97;&#x6CD5;&#x8FD0;&#x884C;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x56FA;&#x5B9A;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x6D41;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x56FA;&#x5B9A;&#xFF1B;</li><li>&#x4F7F;&#x7528;&#x5B50;&#x7A7A;&#x95F4;&#x6295;&#x5F71;&#xFF0C;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#xFF1B;</li><li>&#x591A;&#x79CD;&#x5C3A;&#x5EA6;&#x6765;&#x8861;&#x91CF;&#x5F02;&#x5E38;&#x70B9;&#xFF0C;&#x533A;&#x5206;&#x79BB;&#x6563;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x548C;&#x805A;&#x96C6;&#x7684;&#x5F02;&#x5E38;&#x7FA4;&#xFF1B;</li><li>&#x57FA;&#x4E8E;&#x7A97;&#x53E3;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5904;&#x7406;&#x975E;&#x5E73;&#x7A33;&#x6570;&#x636E;&#xFF1B;</li></ul></li></ul><hr><h2 id="&#x95EE;&#x9898;&#x5B9A;&#x4E49;">&#x95EE;&#x9898;&#x5B9A;&#x4E49;</h2><p>&#x6570;&#x636E;&#x6D41;<span class="math inline">\(D=\{e_t\}_{t=1,2,...}\)</span>&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x7D20;<span class="math inline">\(e_t\)</span>&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x5143;&#x7EC4;&#x7684;&#x5F62;&#x5F0F;<span class="math inline">\((id,f,\delta)_t\)</span>&#x3002;&#x8FD9;&#x91CC;&#x7684;<span class="math inline">\(id\)</span>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x70B9;&#x6765;&#x8BF4;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;<span class="math inline">\(f\)</span>&#x662F;&#x7279;&#x5F81;&#x540D;&#xFF0C;&#x7531;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4EE3;&#x66FF;&#xFF0C;<span class="math inline">\(\delta\)</span>&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x6216;&#x8005;&#x79BB;&#x6563;&#x7684;&#x6807;&#x91CF;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x4E09;&#x5143;&#x7EC4;&#x90FD;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x89C1;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x91CC;&#x70B9;&#x7684;&#x66F4;&#x65B0;&#x3002;</p><p><strong>&#x95EE;&#x9898;: &#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6D41;<span class="math inline">\(D=\{e_t\}_{t=1,2,...}\)</span>&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x6570;&#x636E;&#x4E09;&#x5143;&#x7EC4;<span class="math inline">\((id,f,\delta)_t\)</span>&#x8BA1;&#x7B97;&#x5E76;&#x6301;&#x7EED;&#x5BF9;&#x6BCF;&#x4E2A;&#x70B9;&#x6253;&#x5206;&#xFF0C;&#x8981;&#x6C42;&#x6240;&#x6709;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x5206;&#x6570;&#x90FD;&#x9AD8;&#x4E8E;&#x975E;&#x5F02;&#x5E38;&#x70B9;&#x3002;</strong></p><hr><h2 id="xstream&#x7B97;&#x6CD5;&#x63CF;&#x8FF0;">xStream&#x7B97;&#x6CD5;&#x63CF;&#x8FF0;</h2><p>&#x5728;&#x4E0D;&#x63D0;&#x524D;&#x77E5;&#x9053;&#x6F5C;&#x5728;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x6574;&#x5408;<strong>Half-Space Chains</strong>&#x6765;&#x6709;&#x6548;&#x4F30;&#x8BA1;&#x5BC6;&#x5EA6;&#x3002;&#x6BCF;&#x4E2A;&#x94FE;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x5C3A;&#x5EA6;&#x5730;&#x8BA1;&#x7B97;&#x8FD1;&#x90BB;&#x70B9;&#x6765;&#x5B9E;&#x73B0;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x3002;&#x7B97;&#x6CD5;&#x4E3B;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x5982;&#x4E0B;&#xFF1A;</p><ol type="1"><li>StreamHash&#xFF1A;&#x901A;&#x8FC7;&#x7A00;&#x758F;&#x968F;&#x673A;&#x6295;&#x5F71;&#x6765;&#x9009;&#x62E9;&#x5B50;&#x7A7A;&#x95F4;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x964D;&#x7EF4;&#x3002;</li><li>Half-Space Chains&#xFF1A;&#x591A;&#x5C3A;&#x5EA6;&#x7684;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x65B9;&#x6CD5;&#x3002;</li><li>&#x5BF9;&#x975E;&#x9759;&#x6001;&#x3001;&#x975E;&#x5E73;&#x7A33;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x7684;&#x6269;&#x5C55;&#x5904;&#x7406;&#x3002;</li></ol><h3 id="streamhash">StreamHash</h3><p>&#x968F;&#x673A;&#x6295;&#x5F71;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x5728;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x70B9;&#x8DDD;&#x79BB;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x7684;&#x964D;&#x7EF4;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x968F;&#x673A;&#x6295;&#x5F71;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x62BD;&#x53D6;&#x4E00;&#x7EC4;&#x9AD8;&#x65AF;&#x968F;&#x673A;&#x5411;&#x91CF;<span class="math inline">\(\{r_1,...,r_K\}\subset \mathbb{R}^d\)</span>&#xFF0C;&#x5E76;&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x70B9;<span class="math inline">\(x\in \mathbb{R}^d\)</span>&#x6295;&#x5F71;&#x5230;&#x4E00;&#x4E2A;&#x4F4E;&#x7EF4;&#x5D4C;&#x5165;&#x7A7A;&#x95F4;(embedding)<span class="math inline">\(y\in \mathbb{R}^K\)</span>,<span class="math inline">\(y = (x^Tr_1,...,x^Tr_K)\)</span>&#xFF0C;&#x5176;&#x4E2D;K&#x662F;&#x968F;&#x673A;&#x6295;&#x5F71;&#x7684;&#x4E2A;&#x6570;&#x3002;&#x8FD9;&#x79CD;&#x4F4E;&#x7EF4;&#x5D4C;&#x5165;(embedding)&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x9AD8;&#x7CBE;&#x5EA6;&#x4FDD;&#x7559;&#x539F;&#x7A7A;&#x95F4;&#x70B9;&#x5BF9;&#x7684;&#x8DDD;&#x79BB;&#x5173;&#x7CFB;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#xFF0C;&#x5F02;&#x5E38;&#x70B9;&#x7ECF;&#x5E38;&#x662F;&#x5B58;&#x5728;&#x4E8E;&#x4F4E;&#x7EF4;&#x7684;&#x5B50;&#x7A7A;&#x95F4;&#x4E2D;(&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#x662F;&#x8BF4;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x5728;&#x4E00;&#x90E8;&#x5206;&#x7EF4;&#x5EA6;&#x5F02;&#x5E38;&#xFF0C;&#x800C;&#x975E;&#x5168;&#x7EF4;&#x5EA6;&#x7684;&#x5F02;&#x5E38;)&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x76F8;&#x5E72;&#x7279;&#x5F81;&#x7684;&#x5B58;&#x5728;&#x5BFC;&#x81F4;&#x5F88;&#x96BE;&#x68C0;&#x6D4B;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x6211;&#x4EEC;&#x5728;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x627E;&#x5F02;&#x5E38;&#x5C31;&#x4F1A;&#x7B80;&#x5355;&#x5F88;&#x591A;&#x3002;&#x4F5C;&#x8005;&#x91C7;&#x7528;&#x6570;&#x636E;&#x53CB;&#x597D;&#x578B;(database-friendly)&#x7684;&#x968F;&#x673A;&#x6295;&#x5F71;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5C06;&#x539F;&#x5148;&#x79BB;&#x6563;&#x7684;&#x968F;&#x673A;&#x5411;&#x91CF;&#x7528;&#x9AD8;&#x65AF;&#x968F;&#x673A;&#x5411;&#x91CF;&#x8FDB;&#x884C;&#x66FF;&#x6362;&#xFF0C;&#x4F7F;&#x5F97;&#x53EA;&#x6709;<span class="math inline">\(1/3\)</span>&#x7684;&#x5411;&#x91CF;&#x662F;&#x975E;&#x96F6;&#x5411;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x6211;&#x4EEC;&#x5728;&#x4FDD;&#x7559;&#x539F;&#x6765;&#x70B9;&#x5BF9;&#x8DDD;&#x79BB;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x7F29;&#x51CF;&#x4E86;<span class="math inline">\(2/3\)</span>&#x7684;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x3002;&#x5177;&#x4F53;&#x7684;&#x6295;&#x5F71;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x5206;&#x5E03;&#xFF1A; <span class="math display">\[r_i[j] = \sqrt{\frac{3}{K}}\left\{\begin{matrix}-1 &amp; prob = \frac{1}{6}\\0 &amp; prob = \frac{2}{3}\\+1 &amp; prob = \frac{1}{6}\end{matrix}\right.\]</span></p><p>&#x7136;&#x800C;&#xFF0C;&#x672C;&#x6587;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x8BBE;&#x7F6E;&#x4E2D;&#x5F3A;&#x8C03;&#x4E86;&#x7279;&#x5F81;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x968F;&#x7740;&#x6D41;&#x6570;&#x636E;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x771F;&#x6B63;&#x7684;&#x7EF4;&#x5EA6;d&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x53EF;&#x80FD;&#x786E;&#x5B9A;&#x5730;&#x62BD;&#x53D6;&#x4E00;&#x7EC4;&#x968F;&#x673A;&#x5411;&#x91CF;<span class="math inline">\(r_1,...,r_K\)</span>&#x4F5C;&#x4E3A;&#x5148;&#x9A8C;&#x7EF4;&#x5EA6;&#x3002;&#x4F5C;&#x8005;&#x4F7F;&#x7528;StreamHash&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;(&#x4E0D;&#x786E;&#x5B9A;&#x7684;)&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x57FA;&#x4E8E;&#x54C8;&#x5E0C;&#x7684;&#x7A00;&#x758F;&#x968F;&#x673A;&#x6295;&#x5F71;&#x3002;&#x5B83;&#x7531;K&#x4E2A;&#x54C8;&#x5E0C;&#x51FD;&#x6570;<span class="math inline">\(h_1(\cdot),...h_K(\cdot)\)</span>&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x6BCF;&#x4E2A;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x90FD;&#x80FD;&#x5C06;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x540D;&#x79F0;(&#x901A;&#x5E38;&#x7531;&#x5B57;&#x7B26;&#x4E32;&#x8868;&#x793A;)<span class="math inline">\(f\)</span>&#x6620;&#x5C04;&#x6210;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;<span class="math inline">\(h_i:f\rightarrow \mathbb{R}\)</span>&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7279;&#x5F81;&#x7A7A;&#x95F4;<span class="math inline">\(\mathcal{F}\)</span>&#x7684;&#x70B9;<span class="math inline">\(x\)</span>&#xFF0C;StreamHash&#x968F;&#x673A;&#x6295;&#x5F71;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[y[i]=\sum_{f_j\in\mathcal{F}}h_i(f_j)x[j], i=1,...,K\tag{1}\]</span> &#x4E0A;&#x5F0F;&#x662F;&#x5BF9;&#x5DF2;&#x77E5;&#x6240;&#x6709;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#xFF08;&#x4E0D;&#x786E;&#x5B9A;&#xFF09;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x6D41;<span class="math inline">\(\mathcal{D}\)</span>&#x4E2D;&#x65B0;&#x5230;&#x8FBE;&#x6570;&#x636E;<span class="math inline">\((id,f,\delta)\)</span>&#x65F6;&#xFF0C;&#x589E;&#x91CF;&#x5F0F;&#x66F4;&#x65B0;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;+=&#x64CD;&#x4F5C;&#xFF09;&#xFF1A; <span class="math display">\[y_{id}[i] = y_{id}[i]+h_i(f)\delta, i=1,...,K\]</span></p><p>&#x5982;&#x679C;&#x66F4;&#x65B0;&#x9879;<span class="math inline">\(y_{id}\)</span>&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x5C31;&#x5C06;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x6B21;&#x7684;&#x66F4;&#x65B0;&#x503C;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x6295;&#x5F71;&#x89C4;&#x5219;&#x4E0B;&#xFF0C;&#x5C3D;&#x7BA1;&#x6570;&#x636E;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x5E76;&#x4FDD;&#x6301;&#x4F4E;&#x7EF4;&#x7684;&#x6295;&#x5F71;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x8981;&#x6C42;&#x54C8;&#x5E0C;&#x7ED3;&#x679C;&#x8981;&#x4E0E;&#x539F;&#x6570;&#x636E;&#x7684;&#x5206;&#x5E03;&#x76F8;&#x540C;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x65CF;<span class="math inline">\(g_1(\cdot),...,g_K(\cdot)\)</span>&#x5C06;&#x7279;&#x5F81;&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x54C8;&#x5E0C;&#x6210;32bit&#x6574;&#x6570;&#xFF08;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x673A;&#x5668;&#x5B57;&#x8282;&#x6570;&#x8C03;&#x6574;&#xFF09;&#x3002;&#x4EE4;<span class="math inline">\(a_i(f)=g_i(f)/(2^{32}-1)\)</span>&#x662F;0~1&#x4EFB;&#x610F;&#x4E00;&#x7684;&#x6570;&#x5B57;&#xFF0C;<span class="math inline">\(h_i(f)\)</span>&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;<span class="math inline">\(K\)</span>&#x968F;&#x673A;&#x6295;&#x5F71;(&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x7528;&#x54C8;&#x5E0C;&#x7684;&#x65B9;&#x5F0F;&#x968F;&#x673A;&#x62BD;&#x53D6;&#x4E00;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x5E03;)&#xFF0C;&#x9075;&#x5FAA;&#x516C;&#x5F0F;&#xFF08;1&#xFF09;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x5229;&#x7528;&#x54C8;&#x5E0C;&#x65CF;&#x9009;&#x62E9;&#x7684;&#x7279;&#x5F81;&#x5982;&#x4E0B;&#xFF1A;</p><p><span class="math display">\[h_i[f]=\sqrt{\frac{3}{K}} \left\{\begin{matrix}-1 &amp; if\ a_i(f)\in[0,1/6)\\0 &amp; if\ a_i(f)\in[1/6,5/6)\\+1 &amp; if\ a_i(f)\in[5/6,1]\end{matrix}\right.\]</span></p><hr><h3 id="half-space-chains">Half-Space Chains</h3><p>&#x901A;&#x5E38;&#x57FA;&#x4E8E;&#x5BC6;&#x5EA6;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x4F30;&#x8BA1;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x534A;&#x5F84;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6765;&#x8C03;&#x6574;&#xFF08;&#x7F29;&#x653E;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x4E0E;&#x4E34;&#x8FD1;&#x70B9;&#x8BA1;&#x7B97;&#x5BC6;&#x5EA6;&#x4F1A;&#x7531;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x5BB9;&#x5FFD;&#x89C6;&#x7684;&#x95EE;&#x9898;&#xFF08;1&#xFF09;&#x53C2;&#x6570;&#x654F;&#x611F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x534A;&#x5F84;&#x7684;&#x9009;&#x62E9;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#xFF08;&#x5C24;&#x5176;&#x5728;&#x6CA1;&#x6709;&#x5148;&#x9A8C;&#x77E5;&#x8BC6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#xFF08;2&#xFF09;&#x9AD8;&#x7EF4;&#x95EE;&#x9898;&#xFF0C;&#x968F;&#x7740;&#x7EF4;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x6837;&#x672C;&#x5728;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x8FC7;&#x4E8E;&#x7A00;&#x758F;&#x5BFC;&#x81F4;&#x627E;&#x4E0D;&#x5230;&#x90BB;&#x5C45;&#x70B9;&#x3002;&#x4E3A;&#x4E86;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F5C;&#x8005;&#x5728;StreamHash&#x57FA;&#x7840;&#x4E0A;&#x8FD8;&#x7ED3;&#x5408;Half-Space Chains &#x6280;&#x672F;&#x5171;&#x540C;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p><p>&#x4F5C;&#x8005;&#x5728;StreamHash&#x4E2D;&#x9009;&#x62E9;&#x7684;<span class="math inline">\(K\)</span>&#x7EF4;&#x7A7A;&#x95F4;<span class="math inline">\(\mathcal{P}=\{1,...,K\}\)</span>&#x4E0A;&#x8FDB;&#x884C;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x3002;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x57FA;&#x7840;&#x7684;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x7528;&#x7B49;&#x5BBD;&#x7EC4;&#x8DDD;&#xFF08;bin&#xFF09;&#x6784;&#x9020;&#x51FA;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x8BA1;&#x6570;&#xFF08;bin-counts&#xFF09;&#x7684;&#x76F4;&#x65B9;&#x56FE;&#xFF0C;&#x4F46;&#x662F;&#x968F;&#x7740;&#x7EF4;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x5212;&#x5206;&#x51FA;&#x7684;&#x7EC4;&#xFF08;bin&#xFF09;&#x6570;&#x91CF;&#x4F1A;&#x6307;&#x6570;&#x589E;&#x957F;&#xFF0C;&#x8FC7;&#x4E8E;&#x7A00;&#x758F;&#x7684;&#x7EC4;&#xFF08;bin&#xFF09;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x5229;&#x4E8E;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7EF4;&#x5EA6;&#x707E;&#x96BE;&#x3002;&#x6240;&#x4EE5;&#x4F5C;&#x8005;&#x63D0;&#x51FA;&#x4E86;&#x6DF1;&#x5EA6;&#x4E3A;<span class="math inline">\(D\)</span>&#x7684;Half-space chains&#x6280;&#x672F;&#x3002;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5C06;&#x6BCF;&#x4E2A;chain&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x7EA7;<span class="math inline">\(l=1,...D\)</span> &#x90FD;&#x4ECE;&#x964D;&#x7EF4;&#x540E;&#x7684;&#x7A7A;&#x95F4;<span class="math inline">\(\mathcal{P}\)</span>&#x4E2D;&#x968F;&#x673A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;<span class="math inline">\(p\in\mathcal{P}\)</span>&#x8FDB;&#x884C;&#x5212;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x6CBF;&#x7740;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x9012;&#x5F52;&#x5730;&#x5C06;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x5212;&#x5206;&#x4E3A;&#x79BB;&#x6563;&#x7684;&#x7EC4;&#xFF08;bin&#xFF09;&#x3002;&#x56E0;&#x4E3A;<span class="math inline">\(p\)</span>&#x662F;&#x968F;&#x673A;&#x91C7;&#x6837;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5728;chain&#x7684;&#x540E;&#x7EED;&#x91CD;&#x590D;&#x91C7;&#x6837;&#x5230;&#x8BE5;&#x7279;&#x5F81;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x7528;&#x8F83;&#x5C0F;&#x7684;&#x7EC4;&#x8DDD;(bin width)&#x6765;&#x5B9E;&#x73B0;&#x591A;&#x5C3A;&#x5EA6;&#x7684;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x66F4;&#x7EC6;&#x7C92;&#x5EA6;&#xFF09;&#x3002;</p><p>&#x5F62;&#x5F0F;&#x5316;&#x5730;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p><p>&#x4EE4;<span class="math inline">\(p[l]\in\mathcal{P}\)</span>&#x4EE3;&#x8868;&#x4E0D;&#x540C;&#x5C42;&#x7EA7;&#xFF08;level&#xFF09;&#x7684;&#x5212;&#x5206;&#x7279;&#x5F81;&#xFF0C;<span class="math inline">\(\Delta[p]\)</span>&#x4EE3;&#x8868;&#x521D;&#x59CB;&#x5316;&#x7684;&#x7EC4;&#x8DDD;&#x5BBD;&#x5EA6;&#xFF08;&#x6CE8;&#x610F;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#x5728;&#x4E0D;&#x540C;&#x5C42;&#x7EA7;&#x88AB;&#x91CD;&#x590D;&#x91C7;&#x6837;&#xFF0C;&#x4F1A;&#x5C06;&#x7EC4;&#x8DDD;&#x5BBD;&#x5EA6;&#x51CF;&#x534A;&#xFF09;&#x3002;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x901A;&#x8FC7;&#x7EC4;&#x5185;&#x8BA1;&#x6570;&#xFF08;bin-counts&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x4F30;&#x8BA1;&#x67D0;&#x4E00;&#x4E2A;&#x6295;&#x5F71;&#x70B9;<span class="math inline">\(\textbf{y}\)</span>&#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l\)</span>&#x7684;&#x5BC6;&#x5EA6;&#x3002;&#x4EE4;&#x7EC4;&#x5411;&#x91CF;&#xFF08;bin-vector&#xFF09;<span class="math inline">\(\bar{z}\in\mathbb{Z}^K\)</span>&#x521D;&#x59CB;&#x5316;&#x4E3A;<span class="math inline">\(\textbf{0}\)</span>&#xFF0C;<span class="math inline">\(p=p[1]\in\mathcal{P}\)</span>&#x662F;&#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l=1\)</span>&#x65F6;&#x91C7;&#x6837;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x90A3;&#x4E48;&#x7EC4;&#x5411;&#x91CF;&#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l=1\)</span>&#x65F6;&#x53EF;&#x4EE5;&#x7528;&#x521D;&#x59CB;&#x7EC4;&#x8DDD;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF1A;<span class="math inline">\(\bar{z}[p]=\left \lfloor y[p]/\Delta[p] \right \rfloor\)</span>,&#xFF08;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7D2F;&#x52A0;&#x548C;&#x548C;&#x5BBD;&#x5EA6;&#x7684;&#x6BD4;&#x503C;&#xFF0C;&#x7B49;&#x4E8E;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#xFF09;&#x3002;&#x6BCF;&#x6B21;&#x5728;chain&#x4E2D;&#x5BF9;&#x7279;&#x5F81;<span class="math inline">\(p\)</span>&#x8FDB;&#x884C;&#x91C7;&#x6837;&#x66F4;&#x65B0;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x5C06;&#x7EC4;&#x8DDD;&#x5BBD;&#x5EA6;&#x51CF;&#x534A;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x57FA;&#x4E8E;&#x7EC4;&#x5212;&#x5206;&#x7684;&#x5BC6;&#x5EA6;&#x4F30;&#x8BA1;&#xFF08;binning-based&#xFF09;&#xFF0C;&#x5212;&#x5206;&#x4F4D;&#x7F6E;&#xFF08;bin&#x7684;&#x8FB9;&#x754C;&#x4F4D;&#x7F6E;&#xFF09;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x4E3B;&#x8981;&#x4F1A;&#x5BF9;&#x63A5;&#x8FD1;&#x8FB9;&#x754C;&#x7684;&#x70B9;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;&#x4F5C;&#x8005;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7EF4;&#x5EA6;&#x90FD;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x504F;&#x79FB;&#x91CF;<span class="math inline">\(s[p]&#xFF0C;s[p]\in Uniform(0,\Delta[p])\)</span>&#xFF0C;&#x8FD9;&#x4E2A;&#x504F;&#x79FB;&#x91CF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x6570;&#x636E;&#x5212;&#x5206;&#x5230;&#x4E00;&#x7EC4;&#x6765;&#x51CF;&#x5C11;&#x56E0;&#x4E3A;&#x7EC4;&#x8FB9;&#x754C;&#x8BBE;&#x7F6E;&#x5BFC;&#x81F4;&#x7684;&#x5BC6;&#x5EA6;&#x9519;&#x8BEF;&#x4F30;&#x8BA1;&#x3002;&#x4EE4;<span class="math inline">\(o(p,l)\)</span>&#x8868;&#x793A;&#x7279;&#x5F81;<span class="math inline">\(p\)</span>&#x5728;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x5230;&#x5C42;&#x7EA7;<span class="math inline">\(l\)</span>&#xFF08;&#x5305;&#x542B;&#x5C42;&#x7EA7;<span class="math inline">\(l\)</span>&#xFF09;&#x65F6;&#x88AB;&#x9009;&#x62E9;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x4F8B;&#x5982;<span class="math inline">\(o(p,l)=1\)</span>&#x8868;&#x793A;&#x5728;&#x7279;&#x5F81;<span class="math inline">\(p\)</span>&#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l\)</span>&#x88AB;&#x9996;&#x6B21;&#x9009;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6295;&#x5F71;&#x70B9;<span class="math inline">\(\textbf{y}\)</span>&#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l\)</span>&#x7684;&#x7EC4;&#x5411;&#x91CF;&#xFF08;bin-vector&#xFF09;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x4E3A;&#xFF1A; <span class="math display">\[\tag{2}z[p] = \frac{y[p]+s[p]/2^{o(p,l)-1}}{\Delta[p]/2^{o(p,l)-1}}&#xFF0C;\forall p \in \mathcal{P}\]</span> <span class="math display">\[\bar{z} = \left \lfloor z \right \rfloor\]</span></p><p>&#x5176;&#x4E2D;<span class="math inline">\(z[p]\)</span>&#x662F;&#x975E;&#x79BB;&#x6563;&#x5316;&#x8868;&#x793A;&#xFF0C;<span class="math inline">\(\bar{z}\)</span>&#x662F;&#x79BB;&#x6563;&#x5316;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8BBA;&#x6587;&#x4E2D;&#x4E3E;&#x4F8B;&#x5982;&#x4E0B;</p><figure><img src="/2020/12/02/&#x6D41;&#x5904;&#x7406;/2019-08-13-&#x5B9E;&#x65F6;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;/xstream.png" alt="example"><figcaption>example</figcaption></figure><p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x4E8C;&#x7EF4;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x8FED;&#x4EE3;&#x5212;&#x5206;&#x7684;&#x4F8B;&#x5B50;,&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x968F;&#x673A;&#x504F;&#x79FB;<span class="math inline">\(s[p]\)</span>&#xFF0C;&#x8BE5;&#x503C;&#x5728;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x5747;&#x4E3A;0&#xFF1A; 1. &#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l=1\)</span>&#x65F6;&#xFF0C;&#x7EB5;&#x5411;&#x7279;&#x5F81;&#x7B2C;&#x4E00;&#x6B21;&#x88AB;&#x9009;&#x4E2D;&#x5212;&#x5206;&#xFF0C;&#x6839;&#x636E;&#x516C;&#x5F0F;&#xFF08;2&#xFF09;&#xFF0C;<span class="math inline">\(z[0] = \frac{2.2 + 0/2^{1-1}}{2/2^{1-1}} = 1.1\)</span> 2. &#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l=2\)</span>&#x65F6;&#xFF0C;&#x6A2A;&#x5411;&#x7279;&#x5F81;&#x7B2C;&#x4E00;&#x6B21;&#x88AB;&#x9009;&#x4E2D;&#x5212;&#x5206;&#xFF0C;&#x6839;&#x636E;&#x516C;&#x5F0F;&#xFF08;2&#xFF09;&#xFF0C;<span class="math inline">\(z[1] = \frac{3 + 0/2^{1-1}}{2/2^{1-1}} = 1.5\)</span> 3. &#x5728;&#x5C42;&#x7EA7;<span class="math inline">\(l=3\)</span>&#x65F6;&#xFF0C;&#x7EB5;&#x5411;&#x7279;&#x5F81;&#x7B2C;&#x4E8C;&#x6B21;&#x88AB;&#x9009;&#x4E2D;&#x5212;&#x5206;&#xFF0C;&#x6839;&#x636E;&#x516C;&#x5F0F;&#xFF08;2&#xFF09;&#xFF0C;<span class="math inline">\(z[0] = \frac{2.2 + 0/2^{1-1}}{2/2^{2-1}} = 2.2\)</span>&#xFF0C;&#x76F8;&#x8F83;&#x4E8E;&#x7B2C;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x6B64;&#x5212;&#x5206;&#x7C92;&#x5EA6;&#x66F4;&#x7EC6;&#x3002;</p><p>&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x7ED9;&#x5B9A;&#x4EFB;&#x610F;&#x5C42;&#x7EA7;&#x4E0B;&#x7684;<span class="math inline">\(\bar{z}\)</span>&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x7D22;&#x5F15;&#x5230;&#x8BE5;&#x70B9;&#x5728;&#x8BE5;&#x5C42;&#x7EA7;&#x4E0B;&#x7684;&#x7EC4;&#x8BA1;&#x6570;&#xFF08;bin-count&#xFF09;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x7C97;&#x7C92;&#x5EA6;&#x3001;&#x9AD8;&#x5C42;&#x7EA7;&#x4E0B;&#xFF0C;&#x7EC4;&#x5411;&#x91CF;&#x53EF;&#x80FD;&#x4F1A;&#x6BD4;&#x8F83;&#x5927;&#xFF08;&#x8FD9;&#x91CC;&#x5E94;&#x8BE5;&#x6307;&#x957F;&#x5EA6;&#xFF09;&#xFF0C;&#x5728;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x4E2D;&#x53EF;&#x80FD;&#x65F6;&#x65E0;&#x754C;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x4F5C;&#x8005;&#x5728;&#x6BCF;&#x4E2A;&#x5C42;&#x7EA7;&#x4F7F;&#x7528;&#x4E86;count-min sketch&#xFF08;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7EDF;&#x8BA1;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x9891;&#x7387;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;bloom&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x53D8;&#x578B;&#xFF09;<span class="math inline">\(H_l \in \mathcal{H}\)</span> &#x6765;&#x4F30;&#x8BA1;&#x6B21;&#x6570;&#x7EDF;&#x8BA1;&#xFF08;&#x597D;&#x5904;&#x662F;&#x7B97;&#x6CD5;&#x7A7A;&#x95F4;&#x4E00;&#x5B9A;&#xFF09;&#x3002;&#x603B;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E2A;&#x94FE;&#xFF08;chain&#xFF09;&#x90FD;&#x5B9A;&#x4E49;&#x6210;<span class="math inline">\(C=\{\mathbf{p,\Delta,s,\mathcal{H}}\}\)</span>&#xFF0C;<span class="math inline">\(M\)</span>&#x4E2A;&#x4E0A;&#x8FF0;&#x94FE;<span class="math inline">\(\mathcal{C} = \{C_1,...,C_M\}\)</span>&#x7EC4;&#x6210;&#x4E86;xStream&#x7684;Half-Space Chains&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x7EC4;&#x5411;&#x91CF;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x6D41;&#x6570;&#x636E;&#x7684;&#x589E;&#x91CF;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF0C;&#x5206;&#x522B;&#x8868;&#x793A;&#x7279;&#x5F81;&#x88AB;&#x9996;&#x6B21;&#x9009;&#x53D6;&#x540E;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x548C;&#x91CD;&#x590D;&#x9009;&#x53D6;&#x7684;&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#xFF1A; <span class="math display">\[z[p] = (y[p]+s[p])/\Delta[p]\ \ \ \  if\ o(p,l)=1\\z[p] = 2z[p]-s[p]/\Delta[p]\ \ \ \  if\ o(p,l)&gt;1\]</span></p><p><strong>&#x591A;&#x5C3A;&#x5EA6;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x8BC4;&#x5206;</strong>&#x3002;&#x5728;&#x9AD8;&#x5C42;&#x7EA7;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x7A00;&#x758F;&#x5F88;&#x660E;&#x663E;&#x6BCF;&#x4E2A;&#x7EC4;&#x7684;&#x5BC6;&#x5EA6;&#x8F83;&#x4F4E;&#xFF0C;&#x7EC4;&#x8BA1;&#x6570;&#xFF08;bin-counts&#xFF09;&#x4E5F;&#x8F83;&#x5C11;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x540C;&#x5C42;&#x7EA7;&#x6BD4;&#x8F83;&#x5F02;&#x5E38;&#x70B9;&#x7684;&#x5206;&#x503C;&#xFF0C;&#x4F5C;&#x8005;&#x7528;<span class="math inline">\(2^lH_l\lfloor \bar{z}\rfloor\)</span>&#x6765;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#x5C42;&#x7EA7;&#x7684;&#x5F02;&#x5E38;&#x503C;&#x3002;&#x5BF9;&#x4E8E;&#x67D0;&#x4E00;&#x4E2A;&#x70B9;<span class="math inline">\(\mathbf{y}\)</span>&#x7684;&#x5F02;&#x5E38;&#x5F97;&#x5206;&#x662F;&#x5176;&#x5728;&#x6240;&#x6709;&#x94FE;<span class="math inline">\(\mathcal{C}\)</span>&#x4E0A;&#x5F97;&#x5206;&#x7684;&#x5747;&#x503C;&#xFF1A; <span class="math display">\[S(y)=\frac{1}{M}\sum_{C\in \mathcal{C}}S_{C}(y)=\frac{1}{M}\sum_{C\in \mathcal{C}}min_l 2^lH_l[\bar{z}]\]</span></p><hr><h3 id="&#x5904;&#x7406;&#x975E;&#x5E73;&#x7A33;&#x6570;&#x636E;&#x548C;&#x7279;&#x5F81;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x70B9;">&#x5904;&#x7406;&#x975E;&#x5E73;&#x7A33;&#x6570;&#x636E;&#x548C;&#x7279;&#x5F81;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x70B9;</h3><p>&#x7531;&#x4E8E;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x6570;&#x636E;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x5386;&#x53F2;&#x70B9;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#xFF0C;&#x6240;&#x4EE5;&#x9488;&#x5BF9;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6539;&#x8FDB;&#x5C31;&#x5F88;&#x5FC5;&#x8981;&#x4E86;&#x3002;</p><p><strong>&#x975E;&#x5E73;&#x7A33;&#x6570;&#x636E;</strong>&#xFF0C;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x662F;&#x8BBE;&#x7F6E;(1)&#x5F53;&#x524D;&#x7A97;&#x53E3;(2)&#x53C2;&#x8003;&#x7A97;&#x53E3;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x7A97;&#x53E3;&#x90FD;&#x5305;&#x542B;&#x76F8;&#x540C;&#x6570;&#x91CF;&#x7684;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x7A97;&#x53E3;&#x8981;&#x5206;&#x522B;&#x7EF4;&#x62A4; count-min-sketch&#x7B97;&#x6CD5;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x8BA1;&#x6570;&#x5668;<span class="math inline">\(H_{l.c},H_{l.r}\)</span>(current and reference)&#x3002;&#x5F53;&#x6570;&#x636E;&#x5411;&#x4E0B;&#x4E00;&#x5C42;&#x7EA7;&#x4F20;&#x64AD;&#x65F6;&#xFF0C;<span class="math inline">\(H_{l.c}\)</span>&#x5C42;&#x7EA7;&#x52A0;1&#xFF0C;<span class="math inline">\(H_{l.r}\)</span>&#x8BA1;&#x7B97;&#x5F02;&#x5E38;&#x5206;&#x503C;&#xFF0C;&#x5BF9;&#x4E8E;&#x65B0;&#x6570;&#x636E;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;<span class="math inline">\(H_{l.r}\)</span> &#x8D4B;&#x503C; <span class="math inline">\(H_{l.c}\)</span>&#x7684;&#x7ED3;&#x679C;&#xFF0C;<span class="math inline">\(H_{l.c}\)</span>&#x521D;&#x59CB;&#x5316;&#x4E3A;0&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x8BA1;&#x7B97;&#x4E0B;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x4EA4;&#x66FF;&#x8FED;&#x4EE3;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x66F4;&#x65B0;&#x3002;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x5206;&#x5E03;&#x53D8;&#x5316;&#x7684;&#x5FEB;&#x6162;&#xFF0C;&#x663E;&#x7136;&#x5982;&#x679C;&#x6570;&#x636E;&#x5206;&#x5E03;&#x53D8;&#x5316;&#x5FEB;&#x5219;&#x9700;&#x8981;&#x5C0F;&#x7A97;&#x53E3;&#x3002;</p><p><strong>&#x7279;&#x5F81;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x70B9;</strong> &#x7531;&#x4E8E;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x7684;&#x589E;&#x91CF;&#x7279;&#x5F81;&#xFF0C;&#x6709;&#x9650;&#x5185;&#x5B58;&#x9700;&#x8981;&#x91C7;&#x7528;&#x6700;&#x8FD1;&#x6700;&#x5C11;&#x4F7F;&#x7528;&#x7B97;&#x6CD5;&#xFF08;LRU&#xFF09;&#x6765;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x66F4;&#x65B0;&#xFF1A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x70B9;&#x8FDB;&#x5165;&#x7F13;&#x5B58;&#x540E;&#xFF0C;&#x6700;&#x8FD1;&#x6700;&#x5C11;&#x4F7F;&#x7528;&#x7684;&#x70B9;&#x5219;&#x88AB;&#x9057;&#x5FD8;&#x3002;&#x8FD9;&#x4E00;&#x4F18;&#x5316;&#x662F;&#x9488;&#x5BF9;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6539;&#x53D8;&#x6709;&#x76F8;&#x5E94;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x7684;&#x70B9;&#xFF08;id&#x76F8;&#x540C;&#xFF09;&#x3002;</p><p>&#x7B97;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A; <img src="/2020/12/02/&#x6D41;&#x5904;&#x7406;/2019-08-13-&#x5B9E;&#x65F6;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;/xstream_algor.png"></p><p>4-10&#x884C;&#x662F;&#x7A97;&#x53E3;&#x66F4;&#x65B0;&#x76F8;&#x5173;&#x64CD;&#x4F5C;&#xFF0C;11-15&#x662F;LRU&#x7684;&#x7F13;&#x5B58;&#x673A;&#x5236;&#xFF0C;16-17&#x884C;&#x662F;&#x5BF9;&#x6BCF;&#x6761;&#x94FE;&#xFF08;chain&#xFF09;&#x7684;&#x66F4;&#x65B0;&#x53CA;&#x8BC4;&#x5206;&#x64CD;&#x4F5C;&#x3002;</p><hr><h2 id="&#x53C2;&#x8003;&#x8D44;&#x6599;">&#x53C2;&#x8003;&#x8D44;&#x6599;</h2><p><a href="https://cmuxstream.github.io/" target="_blank" rel="noopener">xStream &#x4E3B;&#x9875;</a> <a href="https://github.com/cmuxstream/cmuxstream-core" target="_blank" rel="noopener">xStream &#x4EE3;&#x7801;</a></p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;xstream-&amp;#x4F18;&amp;#x52BF;&amp;#x4E0E;&amp;#x8D21;&amp;#x732E;&quot;&gt;xStream &amp;#x4F18;&amp;#x52BF;&amp;#x4E0E;&amp;#x8D21;&amp;#x732E;&lt;/h2&gt;
&lt;p&gt;&lt;a href=&quot;https://cmuxstre
      
    
    </summary>
    
      <category term="Stream processing" scheme="http://www.liufr.com/categories/Stream-processing/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
      <category term="KDD" scheme="http://www.liufr.com/tags/KDD/"/>
    
      <category term="Stream processing" scheme="http://www.liufr.com/tags/Stream-processing/"/>
    
  </entry>
  
  <entry>
    <title>增量计算——方差与协方差</title>
    <link href="http://www.liufr.com/2020/12/01/%E6%B5%81%E5%A4%84%E7%90%86/2020-12-1-%E5%A2%9E%E9%87%8F%E8%AE%A1%E7%AE%97--%E6%96%B9%E5%B7%AE%E4%B8%8E%E5%8D%8F%E6%96%B9%E5%B7%AE/"/>
    <id>http://www.liufr.com/2020/12/01/流处理/2020-12-1-增量计算--方差与协方差/</id>
    <published>2020-11-30T16:00:00.000Z</published>
    <updated>2020-12-01T12:04:08.377Z</updated>
    
    <content type="html"><![CDATA[<h2 id="&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#x65B9;&#x5DEE;variance">&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#x2014;&#x2014;&#x65B9;&#x5DEE;&#xFF08;Variance&#xFF09;</h2><p>&#x5728;&#x7ED9;&#x5B9A;<span class="math inline">\(N\)</span>&#x4E2A;&#x6837;&#x672C;<span class="math inline">\(\begin{bmatrix}x_1 &amp; x_2 &amp; \cdots &amp; x_N\end{bmatrix}^T\)</span>&#x7684;&#x65B9;&#x5DEE;&#x8BA1;&#x7B97;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[s_N^2=\frac{1}{N}\sum_{i=1}^{N}{\left(\,x_i-\bar{x}_N\right)^2}\]</span></p><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4EE4; <span class="math display">\[\mathbf{1}_N=[\underbrace{1, 1, \dotsc, 1}_{N\text{ times}}]^T\]</span> &#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5168;1&#x77E2;&#x91CF;&#xFF0C;&#x4E14; <span class="math display">\[\tilde{\mathbf{x}}_N=\mathbf{x}_N-\bar{x}_N\mathbf{1}_N\]</span> &#x8868;&#x793A;&#x539F;&#x6837;&#x672C;&#x51CF;&#x53BB;&#x5747;&#x503C;&#x540E;&#x7684;&#x6B8B;&#x5DEE;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x65B9;&#x5DEE;&#x5C31;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x8868;&#x793A;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[s_N^2=\tilde{\mathbf{x}}_N^T\tilde{\mathbf{x}}_N\left/{N}\right.\]</span> &#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF1A; <span class="math display">\[\tilde{\mathbf{x}}_5=\begin{bmatrix}48 \\ 29 \\ 46 \\ 57 \\ 34\end{bmatrix}- \left(\bar{x}_5=\frac{214}{5}\right)\times\begin{bmatrix}1 \\ 1 \\ 1 \\ 1 \\ 1\end{bmatrix}=\begin{bmatrix}26\,/\,5 \\ -69\,/\,5 \\ 16\,/\,5 \\ 71\,/\,5 \\ -44\,/\,5\end{bmatrix} \\s_5^2=\frac{\tilde{\mathbf{x}}_5^T\tilde{\mathbf{x}}_5}{5}=\frac{2534}{25}\]</span></p><p>&#x5982;&#x679C;&#x8981;&#x662F;&#x5C06;&#x7B80;&#x5316;&#x5F62;&#x5F0F;&#x5C55;&#x5F00;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x76CA;&#x4E8E;&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#xFF1A; <span class="math display">\[\begin{aligned}\tilde{\mathbf{x}}_N^T\tilde{\mathbf{x}}_N\left/{N}\right.&amp;=\left(\mathbf{x}_N-\bar{x}_N\mathbf{1}_N\right)^T\left(\mathbf{x}_N-\bar{x}_N\mathbf{1}_N\right)\left/N\right. \\&amp;=\left(\mathbf{x}_N^T\mathbf{x}_N - N\bar{x}_N^2\right)\left/N\right. \\s_N^2&amp;=\mathbf{x}_N^T\mathbf{x}_N\left/N\right. - \bar{x}_N^2\end{aligned}\]</span> &#x4F8B;&#x5982;&#x4E0B;&#x5F0F;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x7ED3;&#x679C;&#x6B63;&#x786E; <span class="math display">\[s_5^2=\frac{\mathbf{x}_5^T\mathbf{x}_5=9666}{5}-\left(\frac{214}{5}\right)^2=\frac{2534}{25}\]</span> &#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x65B0;&#x7684;&#x5143;&#x7D20;<span class="math inline">\(x_{N+1}\)</span>&#x5728;&#x6D41;&#x6570;&#x636E;&#x4E2D;&#x5230;&#x8FBE;&#x65F6;&#xFF0C;&#x65B9;&#x5DEE;&#x5C31;&#x53EF;&#x4EE5;&#x589E;&#x91CF;&#x66F4;&#x65B0;&#x4E86;&#xFF1A; <span class="math display">\[\begin{aligned}s_{N+1}^2&amp;=\frac{\tilde{\mathbf{x}}_{N+1}^T\tilde{\mathbf{x}}_{N+1}}{N+1}\\&amp;=\frac{\left(\mathbf{x}_{N+1}-\bar{x}_{N+1}\mathbf{1}_{N+1}\right)^T\left(\mathbf{x}_{N+1}-\bar{x}_{N+1}\mathbf{1}_{N+1}\right)}{N+1}\\&amp;=\frac{\mathbf{x}_{N+1}^T\mathbf{x}_{N+1}-\left(N+1\right)\:\bar{x}_{N+1}^2}{N+1}\\&amp;=\frac{\mathbf{x}_N^T\mathbf{x}_N+x_{N+1}^2-\left(N+1\right)\:\bar{x}_{N+1}^2}{N+1}\\&amp;=\frac{\mathbf{x}_N^T\mathbf{x}_N+x_{N+1}^2}{N+1}-\bar{x}_{N+1}^2\\\end{aligned}\]</span></p><p>&#x4F8B;&#x5982;&#xFF1A;</p><p><span class="math display">\[s_6^2=\frac{\mathbf{x}_N^T\mathbf{x}_N+x_{N+1}^2=9666+66^2}{6}-\left(\frac{140}{3}\right)^2=\frac{1433}{9}\]</span> &#x53C8;&#x56E0;&#x4E3A; <span class="math display">\[\mathbf{x}_N^T\mathbf{x}_N=\sum_{i=1}^{N}{x_i^2}\]</span> &#x6240;&#x4EE5;&#x5728;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#xFF08;1&#xFF09;&#x7D2F;&#x52A0;&#x5E73;&#x65B9;&#x548C;&#xFF08;2&#xFF09;&#x5747;&#x503C; &#x8FD9;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x5C31;&#x884C;&#x4E86;&#x3002;</p><hr><h2 id="&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#x534F;&#x65B9;&#x5DEE;">&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#x2014;&#x2014;&#x534F;&#x65B9;&#x5DEE;</h2><p>&#x8003;&#x8651;&#x4E00;&#x5BF9;&#x5411;&#x91CF; <span class="math display">\[\begin{aligned}\mathbf{x}&amp;=\left[x_1, x_2, \dotsc, x_N\right]^T\\\mathbf{y}&amp;=\left[y_1, y_2, \dotsc, y_N\right]^T\end{aligned}\]</span> &#x5747;&#x503C; <span class="math display">\[\bar{x}_N=\Sigma_N\mathbf{x}_N\left/N\right.,\;\; \bar{y}_N=\Sigma_N\mathbf{y}_N\left/N\right.\]</span></p><p>&#x6B8B;&#x5DEE; <span class="math display">\[\tilde{\mathbf{x}}_N=\mathbf{x}_N-\bar{x}_N\mathbf{1}_N,\;\; \tilde{\mathbf{y}}_N=\mathbf{y}_N-\bar{y}_N\mathbf{1}_N\]</span></p><p>&#x8003;&#x8651;&#x5916;&#x79EF; <span class="math display">\[\begin{bmatrix}\tilde{\mathbf{x}}_N^T \\ \tilde{\mathbf{y}}_N^T\end{bmatrix}\begin{bmatrix}\tilde{\mathbf{x}}_N    &amp; \tilde{\mathbf{y}}_N\end{bmatrix}=\begin{bmatrix}\tilde{\mathbf{x}}_N^T\tilde{\mathbf{x}}_N &amp; \tilde{\mathbf{x}}_N^T\tilde{\mathbf{y}}_N \\\tilde{\mathbf{y}}_N^T\tilde{\mathbf{x}}_N &amp; \tilde{\mathbf{y}}_N^T\tilde{\mathbf{y}}_N\end{bmatrix}\]</span></p><p>&#x90A3;&#x4E48;&#x6709; <span class="math display">\[S_N^2=\frac{1}{N}\begin{bmatrix}\tilde{\mathbf{x}}_N^T\tilde{\mathbf{x}}_N &amp; \tilde{\mathbf{x}}_N^T\tilde{\mathbf{y}}_N \\\tilde{\mathbf{y}}_N^T\tilde{\mathbf{x}}_N &amp; \tilde{\mathbf{y}}_N^T\tilde{\mathbf{y}}_N\end{bmatrix}\]</span></p><p>&#x4E0A;&#x5F0F;&#x4E2D;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x589E;&#x91CF;&#x65B9;&#x5DEE;&#x7684;&#x516C;&#x5F0F;&#x8FDB;&#x884C;&#x589E;&#x91CF;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x603B;&#x4F53;&#x6837;&#x672C;&#x7684;&#x534F;&#x65B9;&#x5DEE;&#x8F6C;&#x6362;&#x6210;&#x6837;&#x672C;&#x534F;&#x65B9;&#x5DEE;&#x7684;&#x65E0;&#x504F;&#x4F30;&#x8BA1;&#xFF0C;&#x5148;&#x4E58;<span class="math inline">\(N\)</span> &#x518D;&#x9664;&#x4EE5;<span class="math inline">\(N-1\)</span>&#xFF0C;&#x90A3;&#x4E48;&#x6709;&#xFF1A;</p><p><span class="math display">\[\Sigma_N^2=\frac{1}{N-1}\begin{bmatrix}\tilde{\mathbf{x}}_N^T\tilde{\mathbf{x}}_N &amp; \tilde{\mathbf{x}}_N^T\tilde{\mathbf{y}}_N \\\tilde{\mathbf{y}}_N^T\tilde{\mathbf{x}}_N &amp; \tilde{\mathbf{y}}_N^T\tilde{\mathbf{y}}_N\end{bmatrix}=\frac{N S_N^2}{N-1}\]</span></p><p>ref: <a href="http://rebcabin.github.io/blog/2013/01/22/covariance-matrices/" target="_blank" rel="noopener">Incremental Covariance</a></p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;&amp;#x589E;&amp;#x91CF;&amp;#x8BA1;&amp;#x7B97;&amp;#x65B9;&amp;#x5DEE;variance&quot;&gt;&amp;#x589E;&amp;#x91CF;&amp;#x8BA1;&amp;#x7B97;&amp;#x2014;&amp;#x2014;&amp;#x65B9;&amp;#x5DEE;&amp;#xFF08;Va
      
    
    </summary>
    
      <category term="Stream processing" scheme="http://www.liufr.com/categories/Stream-processing/"/>
    
    
      <category term="Stream processing" scheme="http://www.liufr.com/tags/Stream-processing/"/>
    
      <category term="Algorithm" scheme="http://www.liufr.com/tags/Algorithm/"/>
    
  </entry>
  
  <entry>
    <title>Kafaka和Flink的流式处理比较</title>
    <link href="http://www.liufr.com/2020/10/22/%E6%B5%81%E5%A4%84%E7%90%86/2020-10-22-Kafaka%E5%92%8CFlink%E7%9A%84%E6%B5%81%E5%BC%8F%E5%A4%84%E7%90%86%E6%AF%94%E8%BE%83/"/>
    <id>http://www.liufr.com/2020/10/22/流处理/2020-10-22-Kafaka和Flink的流式处理比较/</id>
    <published>2020-10-21T16:00:00.000Z</published>
    <updated>2020-10-23T03:16:35.489Z</updated>
    
    <content type="html"><![CDATA[<p>&#x8F6C;&#x8F7D;&#x7FFB;&#x8BD1;&#x81EA;&#xFF1A; <a href="https://www.confluent.io/blog/apache-flink-apache-kafka-streams-comparison-guideline-users/" target="_blank" rel="noopener">Flink and Kafka Streams: a Comparison and Guideline for Users</a></p><hr><p>Apache Kafka&#x9879;&#x76EE;&#x5728;&#x5927;&#x591A;&#x6570;&#x5F00;&#x6E90;&#x6D41;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x4E00;&#x76F4;&#x662F;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x7528;&#x4EE5;&#x4F4E;&#x5EF6;&#x8FDF;&#x5B58;&#x50A8;&#x548C;&#x6570;&#x636E;&#x79FB;&#x52A8;&#x3002;&#x6700;&#x8FD1;&#xFF0C;Kafka&#x793E;&#x533A;&#x5F15;&#x8FDB;&#x4E86;Kafka stream&#xFF0C;&#x4E00;&#x4E2A;&#x6D41;&#x5904;&#x7406;&#x5E93;&#xFF0C;&#x4F5C;&#x4E3A;Kafka&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x968F;&#x7740;Kafka stream&#x548C;Kafka Connect&#x7684;&#x52A0;&#x5165;&#xFF0C;Kafka&#x73B0;&#x5728;&#x589E;&#x52A0;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x6D41;&#x5904;&#x7406;&#x529F;&#x80FD;&#x3002;</p><h2 id="&#x4EC0;&#x4E48;&#x662F;apache-flink">&#x4EC0;&#x4E48;&#x662F;Apache Flink?</h2><p>Apache Flink &#x6839;&#x690D;&#x5728;&#x9AD8;&#x6027;&#x80FD;&#x96C6;&#x7FA4;&#x8BA1;&#x7B97;&#x548C;&#x6570;&#x636E;&#x5904;&#x7406;&#x6846;&#x67B6;&#x4E2D;&#x3002;Flink&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5185;&#x5EFA;&#x7684;&#x7684;&#x6D41;&#x5F0F;&#x5904;&#x7406;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x5728; YARN&#x3001;Mesos &#x6216; Kubernetes &#x7B49;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#x4E0A;&#x3002;Flink jobs&#x4F7F;&#x7528;&#x6D41;&#x6570;&#x636E;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x751F;&#x6210;&#x5230;&#x6D41;&#x3001;&#x6570;&#x636E;&#x5E93;&#x6216;&#x6D41;&#x5904;&#x7406;&#x5668;&#x672C;&#x8EAB;&#x3002;Flink &#x901A;&#x5E38;&#x4E0E; Kafka &#x4E00;&#x8D77;&#x7528;&#x4F5C;&#x5E95;&#x5C42;&#x7684;&#x5B58;&#x50A8;&#x5C42;&#xFF0C;&#x4F46;&#x4E8C;&#x8005;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#x3002;</p><p>&#x5728; Flink &#x4E4B;&#x524D;&#xFF0C;&#x6D41;&#x5904;&#x7406;&#x6846;&#x67B6;&#x5FC5;&#x987B;&#x6743;&#x8861;&#x5EF6;&#x8FDF;&#x3001;&#x541E;&#x5410;&#x91CF;&#x6216;&#x7ED3;&#x679C;&#x51C6;&#x786E;&#x6027;&#x3002;Flink &#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#xFF08;&#x73B0;&#x5728;&#x4ECD;&#x7136;&#x662F;&#x552F;&#x4E00;&#x7684;&#x4E00;&#x4E2A;&#xFF09;&#xFF0C;&#x5B83;&#x5DF2;&#x88AB;&#x8BC1;&#x660E;&#xFF08;1&#xFF09;&#x5728;&#x4E2D;&#x7B49;&#x7FA4;&#x96C6;&#x4E2D;&#x4EE5;&#x6BCF;&#x65F6;&#x6570;&#x5343;&#x4E07;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x987A;&#x5E8F;&#x63D0;&#x4F9B;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#xFF08;2&#xFF09;&#x4F4E;&#x81F3;&#x5C0F;&#x4E8E; 10 &#x6BEB;&#x79D2;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#xFF08;3&#xFF09;&#x4FDD;&#x8BC1;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x8BED;&#x4E49;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x6E90;&#x548C;&#x63A5;&#x6536;&#x5668;&#x7684;&#x652F;&#x6301;&#x4E0B;&#xFF0C;&#x7CBE;&#x786E;&#x7684;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x4EA4;&#x4ED8;&#x4E0E;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4ECE;Kafka&#x5230;Flink&#x5230;HDFS&#x6216;Cassandra&#x7684;&#x7BA1;&#x9053;&#xFF09;&#xFF0C;&#x548C; &#xFF08;4&#xFF09;&#x901A;&#x8FC7;&#x5BF9;&#x4E8B;&#x4EF6;&#x65F6;&#x95F4;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5728;&#x51FA;&#x73B0;&#x65E0;&#x5E8F;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x83B7;&#x5F97;&#x51C6;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;Flink&#x57FA;&#x4E8E;&#x5177;&#x6709;&#x4E3B;&#x8282;&#x70B9;&#x548C;&#x8F85;&#x52A9;&#x8282;&#x70B9;&#x7684;&#x96C6;&#x7FA4;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;Flink &#x7FA4;&#x96C6;&#x9AD8;&#x5EA6;&#x53EF;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0E;YARN&#x548C;Mesos&#x7B49;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#x4E00;&#x8D77;&#x90E8;&#x7F72;&#x3002;&#x6B64;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5141;&#x8BB8;Flink&#x4F7F;&#x7528;&#x8F7B;&#x91CF;&#x7EA7;checkpoint&#x673A;&#x5236;&#x6765;&#x4FDD;&#x8BC1;&#x5728;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#x53EA;&#x4EA7;&#x751F;&#x4E00;&#x6B21;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x901A;&#x8FC7;checkpoint&#x7B80;&#x5355;&#x6B63;&#x786E;&#x5730;&#x91CD;&#x65B0;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x727A;&#x7272;&#x5EF6;&#x8FDF;&#x6216;&#x541E;&#x5410;&#x91CF;&#x3002;&#x6700;&#x540E;&#xFF0C;Flink&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x7684;&#x6279;&#x5904;&#x7406;&#x6846;&#x67B6;&#xFF0C;&#x9664;&#x4E86;&#x5176;DataStream&#x548C;DataSet API&#xFF08;&#x5206;&#x522B;&#x7528;&#x4E8E;&#x6D41;&#x548C;&#x6279;&#x5904;&#x7406;&#xFF09;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x63D0;&#x4F9B;&#x5404;&#x79CD;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;API&#x548C;&#x5E93;&#xFF0C;&#x4F8B;&#x5982;CEP&#xFF08;&#x7528;&#x4E8E;&#x590D;&#x6742;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#xFF09;&#x3001;SQL&#x548C;Table&#xFF08;&#x7528;&#x4E8E;&#x7ED3;&#x6784;&#x5316;&#x6D41;&#x548C;&#x8868;&#xFF09;&#x3001;FMLlink&#xFF08;&#x7528;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF09;&#x548C; Gelly&#xFF08;&#x7528;&#x4E8E;&#x56FE;&#x5F62;&#x5904;&#x7406;&#xFF09;&#x3002;Flink &#x5DF2;&#x88AB;&#x591A;&#x5BB6;&#x516C;&#x53F8;&#x8BC1;&#x660E;&#x5728;&#x751F;&#x4EA7;&#x4E2D;&#x975E;&#x5E38;&#x7A33;&#x5065;&#xFF0C;&#x4E3A;&#x6700;&#x7EC8;&#x5BA2;&#x6237;&#x6BCF;&#x5929;&#x4F7F;&#x7528;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x52A8;&#x529B;&#x3002;</p><p>Streams API&#x7684;&#x76EE;&#x6807;&#x662F;&#x7B80;&#x5316;&#x6D41;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x4E3B;&#x6D41;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x3002;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;Streams API&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x7ECF;&#x8FC7;&#x6DF1;&#x601D;&#x719F;&#x8651;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#xFF08;1&#xFF09;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x96C6;&#x7FA4;&#x7684;&#x53EF;&#x5D4C;&#x5165;library&#xFF0C;&#x53EA;&#x6709;Kafka&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4F7F;&#x7528;Streams API&#xFF0C;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x6784;&#x5EFA;&#x9A71;&#x52A8;&#x4E1A;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6784;&#x5EFA;&#x96C6;&#x7FA4;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x5BF9;&#x4E8E;&#x5E0C;&#x671B;&#x8FDB;&#x884C;&#x6D41;&#x5F0F;&#x5904;&#x7406;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0E;&#x516C;&#x53F8;&#x73B0;&#x6709;&#x7684;&#x6253;&#x5305;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x76D1;&#x89C6;&#x548C;&#x64CD;&#x4F5C;&#x5DE5;&#x5177;&#x65E0;&#x7F1D;&#x96C6;&#x6210;&#x3002;&#xFF08;2&#xFF09;&#x5B83;&#x4E0E;Kafka&#x4E2D;&#x7684;&#x6838;&#x5FC3;&#x62BD;&#x8C61;&#x5B8C;&#x5168;&#x96C6;&#x6210;&#xFF0C;&#x56E0;&#x6B64;Kafka&#x7684;&#x6240;&#x6709;&#x4F18;&#x52BF;&#x5305;&#x62EC;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x3001;&#x5F39;&#x6027;&#x3001;&#x5BB9;&#x9519;&#xFF0C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x5B89;&#x5168;&#x6027;&#x53EF;&#x7528;&#x4E8E;Stream API&#xFF1B;Kafka&#x5728;&#x5168;&#x7403;&#x8303;&#x56F4;&#x5185;&#x7684;&#x6570;&#x5343;&#x5BB6;&#x516C;&#x53F8;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6D4B;&#x8BD5;&#x548C;&#x90E8;&#x7F72;&#x3002;3&#xFF09;&#x5B83;&#x5F15;&#x5165;&#x4E86;&#x65B0;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x529F;&#x80FD;&#x6765;&#x5141;&#x8BB8;&#x6D41;&#x5904;&#x7406;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x6D41;&#x548C;&#x8868;&#x7684;&#x62BD;&#x8C61;&#x7684;&#x5168;&#x805A;&#x5408;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E92;&#x6362;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x6765;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x8FDE;&#x63A5;&#x64CD;&#x4F5C;&#x548C;&#x8FDE;&#x7EED;&#x67E5;&#x8BE2;&#x3002;</p><h2 id="flink-vs-kafka-stream-api-&#x4E3B;&#x8981;&#x5DEE;&#x5F02;">Flink vs Kafka Stream API&#xFF1A; &#x4E3B;&#x8981;&#x5DEE;&#x5F02;</h2><table><colgroup><col style="width: 4%"><col style="width: 39%"><col style="width: 55%"></colgroup><thead><tr class="header"><th></th><th>Flink</th><th>Kafka Stream API</th></tr></thead><tbody><tr class="odd"><td>&#x90E8;&#x7F72;</td><td>Flink &#x662F;&#x4E00;&#x4E2A;&#x7FA4;&#x96C6;&#x6846;&#x67B6;&#xFF0C;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F7F;&#x7528; YARN&#x3001;Mesos &#x6216;&#x5BB9;&#x5668;Docker&#x3001;Kubernetes</td><td>Streams API &#x662F;&#x6807;&#x51C6; Java &#x5E93;&#xFF0C;&#x4E0D;&#x4F1A;&#x6307;&#x5B9A;&#x90E8;&#x7F72;&#x65B9;&#x6CD5;;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x90E8;&#x7F72;&#x6280;&#x672F;&#xFF0C;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#xFF1A;&#x5BB9;&#x5668;&#xFF08;Docker&#x3001;Kubernetes&#xFF09;&#x3001;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#xFF08;Mesos&#x3001;YARN&#xFF09;&#x3001;&#x90E8;&#x7F72;&#x81EA;&#x52A8;&#x5316;&#xFF08;Puppet&#x3001;Chef&#x3001;Ansible&#xFF09;&#x548C;&#x81EA;&#x5B9A;&#x4E49;&#x5185;&#x90E8;&#x5DE5;&#x5177;&#x3002;</td></tr><tr class="even"><td>&#x751F;&#x547D;&#x5468;&#x671F;</td><td>&#x7528;&#x6237;&#x7684;&#x6D41;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x5728; Flink &#x96C6;&#x7FA4;&#x4E2D;&#x90E8;&#x7F72;&#x5E76;&#x8FD0;&#x884C;&#x4F5C;&#x4E1A;</td><td>&#x7528;&#x6237;&#x7684;&#x6D41;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x8FD0;&#x884C;</td></tr><tr class="odd"><td>&#x6240;&#x5C5E;&#x56E2;&#x961F;</td><td>&#x6570;&#x636E;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x6216; BI &#x56E2;&#x961F;</td><td>&#x7BA1;&#x7406;&#x76F8;&#x5E94;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E1A;&#x52A1;&#x7EBF;&#x56E2;&#x961F;</td></tr><tr class="even"><td>&#x534F;&#x8C03;</td><td>Flink &#x4E3B;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x4F5C;&#x4E1A;&#x7BA1;&#x7406;&#x5668;&#xFF09;</td><td>&#x5229;&#x7528; Kafka &#x96C6;&#x7FA4;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#x3001;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x548C;&#x5BB9;&#x9519;&#x3002;</td></tr><tr class="odd"><td>&#x8FDE;&#x7EED;&#x6570;&#x636E;&#x6E90;</td><td>Kafka&#x3001;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x5176;&#x4ED6;&#x6D88;&#x606F;&#x961F;&#x5217;</td><td>&#x4E25;&#x683C;&#x4E0E;Kafka&#x7684;&#x8FDE;&#x63A5; API &#x670D;&#x52A1;&#xFF0C; &#x4EE5;&#x89E3;&#x51B3;&#x6570;&#x636E;&#x8FDB;&#x5165;&#xFF0C; &#x8D85;&#x51FA;Kafka&#x95EE;&#x9898;</td></tr><tr class="even"><td>&#x7ED3;&#x679C;&#x63A5;&#x6536;&#x5668;</td><td>Kafka&#x3001;&#x5176;&#x4ED6;MQ&#x3001;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x5206;&#x6790;&#x6570;&#x636E;&#x5E93;&#x3001;&#x5BC6;&#x94A5;/&#x503C;&#x5B58;&#x50A8;&#x3001;&#x6D41;&#x5904;&#x7406;&#x5668;&#x72B6;&#x6001;&#x548C;&#x5176;&#x4ED6;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;</td><td>Kafka&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#x6216;&#x4EFB;&#x4F55;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;</td></tr><tr class="odd"><td>&#x6709;&#x754C;&#x548C;&#x65E0;&#x754C;&#x6570;&#x636E;&#x6D41;</td><td>&#x6709;&#x754C;&#x548C;&#x65E0;&#x754C;</td><td>&#x65E0;&#x754C;</td></tr><tr class="even"><td>&#x8BED;&#x4E49;&#x4FDD;&#x8BC1;</td><td>&#x5BF9;&#x4E8E;&#x5185;&#x90E8; Flink &#x72B6;&#x6001;&#x5BF9;&#x5E94;&#x4E00;&#x6B21;&#x8BED;&#x4E49;&#x4FDD;&#x8BC1;;&#x7AEF;&#x5230;&#x7AEF;&#x9009;&#x5B9A;&#x7684;&#x6E90;&#x548C;&#x63A5;&#x6536;&#x5668;&#x5BF9;&#x5E94;&#x4E00;&#x6B21;&#x8BED;&#x4E49;&#x4FDD;&#x8BC1;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;Kafka &#x5230; Flink &#x5230; HDFS&#xFF09;;&#x5F53;Kafka&#x88AB;&#x7528;&#x4F5C;sinks&#x81F3;&#x5C11;&#x4E00;&#x6B21;</td><td>&#x53EA;&#x9700;&#x4E00;&#x6B21;&#x7AEF;&#x5230;&#x7AEF;&#x4FDD;&#x8BC1;</td></tr></tbody></table><h2 id="&#x90E8;&#x7F72;&#x548C;&#x7EC4;&#x7EC7;&#x7BA1;&#x7406;">&#x90E8;&#x7F72;&#x548C;&#x7EC4;&#x7EC7;&#x7BA1;&#x7406;</h2><p>Flink&#x6D41;&#x7A0B;&#x5E8F;&#x88AB;&#x5EFA;&#x6A21;&#x4E3A;&#x72EC;&#x7ACB;&#x7684;&#x6D41;&#x5904;&#x7406;&#x8BA1;&#x7B97;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;job&#x3002;Flink job&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;Flink&#x6846;&#x67B6;&#x8D1F;&#x8D23;&#xFF0C;&#x5305;&#x62EC;&#x90E8;&#x7F72;&#x3001;&#x5BB9;&#x9519;&#x6216;&#x5347;&#x7EA7;&#x3002;Flink job&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x6765;&#x81EA;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#xFF08;&#x5982;YARN&#x3001;Mesos&#x3001;&#x73B0;&#x6709;&#x7FA4;&#x96C6;&#x4E2D;&#x90E8;&#x7F72;&#x7684;Docker&#x5BB9;&#x5668;&#x6C60;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;YARN&#x4E2D;&#x7684;Hadoop&#x7FA4;&#x96C6;&#xFF09;&#x6216;&#x6765;&#x81EA;&#x72EC;&#x7ACB;&#x7684;Flink&#x5B89;&#x88C5;&#x3002;Flink job&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x548C;&#x505C;&#x6B62;&#x81EA;&#x8EAB;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x6709;&#x9650;&#x7684;&#x6D41;&#x5F0F;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x6216;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x4ECE;&#x6240;&#x6709;&#x6743;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;Flink job&#x901A;&#x5E38;&#x662F;&#x62E5;&#x6709;&#x6846;&#x67B6;&#x8FD0;&#x884C;&#x7684;&#x7FA4;&#x96C6;&#x7684;&#x56E2;&#x961F;&#x7684;&#x8D23;&#x4EFB;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x6570;&#x636E;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x3001;BI&#x6216;ETL&#x56E2;&#x961F;&#x3002;</p><p>Kafka&#x4E2D;&#x7684;StreamsAPI&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5D4C;&#x5165;&#x5230;&#x4EFB;&#x4F55;&#x6807;&#x51C6;Java&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5E93;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Kafka Stream API&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6216;&#x64CD;&#x4F5C;&#x5458;&#x8D1F;&#x8D23;&#x3002;StreamsAPI&#x5E76;&#x4E0D;&#x89C4;&#x5B9A;&#x5E94;&#x5982;&#x4F55;&#x914D;&#x7F6E;&#x3001;&#x76D1;&#x89C6;&#x6216;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x4E0E;&#x516C;&#x53F8;&#x73B0;&#x6709;&#x7684;&#x6253;&#x5305;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x76D1;&#x89C6;&#x548C;&#x64CD;&#x4F5C;&#x5DE5;&#x5177;&#x65E0;&#x7F1D;&#x96C6;&#x6210;&#x3002;&#x4ECE;&#x6240;&#x6709;&#x6743;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;Streams&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x7531;&#x5404;&#x4E2A;&#x4EA7;&#x54C1;&#x56E2;&#x961F;&#x8D1F;&#x8D23;&#x3002;</p><p>&#x9664;&#x4E86;&#x5F71;&#x54CD;&#x90E8;&#x7F72;&#x6A21;&#x578B;&#x4E4B;&#x5916;&#xFF0C;&#x8FD0;&#x884C;&#x5D4C;&#x5165;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6D41;&#x5904;&#x7406;&#x8BA1;&#x7B97;&#x4E0E;&#x4F5C;&#x4E3A;&#x7FA4;&#x96C6;&#x4E2D;&#x7684;&#x72EC;&#x7ACB;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x8FD8;&#x6D89;&#x53CA;&#x8D44;&#x6E90;&#x9694;&#x79BB;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x8FD0;&#x884C;&#x6D41;&#x5904;&#x7406;&#x8BA1;&#x7B97;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x7684;&#x6253;&#x5305;&#x548C;&#x90E8;&#x7F72;&#x6A21;&#x578B;&#x3002;&#x5728;&#x4E2D;&#x592E;&#x96C6;&#x7FA4;&#x4E0A;&#x8FD0;&#x884C;&#x6D41;&#x5904;&#x7406;&#x8BA1;&#x7B97;&#x610F;&#x5473;&#x7740;&#x60A8;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;&#x5B83;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x96C6;&#x7FA4;&#x5DF2;&#x7ECF;&#x63D0;&#x4F9B;&#x7684;&#x6253;&#x5305;&#x548C;&#x90E8;&#x7F72;&#x6A21;&#x578B;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5728;&#x4E2D;&#x592E;&#x7FA4;&#x96C6;&#x4E0A;&#x8FD0;&#x884C;&#x6D41;&#x5904;&#x7406;&#x8BA1;&#x7B97;&#x63D0;&#x4F9B;&#x8D44;&#x6E90;&#x9694;&#x79BB;&#xFF0C;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x6D41;&#x5904;&#x7406;&#x90E8;&#x5206;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x548C;&#x6D88;&#x606F;&#x4F20;&#x8F93;&#x5C42;&#x5206;&#x5F00;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E13;&#x7528;&#x4E8E;&#x6D41;&#x8FDB;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#x4E0E;&#x4E13;&#x7528;&#x4E8E;Kafka&#x7684;&#x8D44;&#x6E90;&#x9694;&#x79BB;&#xFF09;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x7EC4;&#x7EDF;&#x4E00;&#x7684;&#x64CD;&#x4F5C;&#x5DE5;&#x5177;&#x7BA1;&#x7406;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x53CA;&#x6D41;&#x5904;&#x7406;&#x90E8;&#x5206;&#xFF0C;&#x5219;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x8FD0;&#x884C;&#x6D41;&#x5904;&#x7406;&#x8BA1;&#x7B97;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x3002;</p><p>&#x8C03;&#x7528;&#xFF1A;&#x6D41;&#x5904;&#x7406;&#x7528;&#x4E8E;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;-&#x4ECE;&#x9762;&#x5411;&#x7528;&#x6237;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5230;&#x8FD0;&#x884C;&#x6D41;&#x6570;&#x636E;&#x5206;&#x6790;&#x3002;Kafka&#x548C;Flink&#x4E2D;&#x7684;&#x6D41;API&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x3002;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F4D;&#x4E8E;&#x5176;&#x6240;&#x5728;&#x4F4D;&#x7F6E;-&#x5982;&#x4E2D;&#x592E;&#x7FA4;&#x96C6;&#xFF08;Flink&#xFF09;&#x4E2D;&#x7684;&#x4F5C;&#x4E1A;&#x6216;&#x5FAE;&#x670D;&#x52A1;&#xFF08;StreamsAPI&#xFF09;&#x4E2D;&#x7684;job&#x3002;</p><h2 id="&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x548C;&#x5BB9;&#x9519;">&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x548C;&#x5BB9;&#x9519;</h2><p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x65B9;&#x9762;&#xFF0C;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x6700;&#x5927;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;Flink &#x5177;&#x6709;&#x4E13;&#x7528;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#xFF0C;&#x800C; Streams API &#x5219;&#x4F9D;&#x8D56;&#x4E8E; Kafka &#x4EE3;&#x7406;&#x901A;&#x8FC7; Kafka &#x7684;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x548C;&#x5BB9;&#x9519;&#x3002;</p><p>&#x5728; Apache Flink &#x4E2D;&#xFF0C;&#x6545;&#x969C;&#x5BB9;&#x9519;&#x3001;&#x7F29;&#x653E;&#x548C;&#x72B6;&#x6001;&#x7684;&#x5747;&#x5300;&#x5206;&#x5E03;&#x7531;&#x4E13;&#x7528;&#x4E3B;&#x8282;&#x70B9;&#x5168;&#x5C40;&#x534F;&#x8C03;&#x3002;Flink &#x7684;&#x4E3B;&#x8282;&#x70B9;&#x5B9E;&#x73B0;&#x4E86;&#x57FA;&#x4E8E; ZooKeeper &#x7684;&#x81EA;&#x8EAB;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3002;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6545;&#x969C;&#x4E5F;&#x7ECF;&#x5E38;&#x89E6;&#x53D1;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7684;&#x6062;&#x590D;&#x64CD;&#x4F5C;&#xFF08;&#x5982;&#x56DE;&#x6EDA;&#x66F4;&#x6539;&#xFF09;&#x3002;&#x6B64;&#x65B9;&#x6CD5;&#x53EF;&#x5E2E;&#x52A9; Flink &#x83B7;&#x5F97;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x5B83;&#x652F;&#x6301; Flink &#x7684;checkpoint&#x529F;&#x80FD;&#xFF08;&#x7528;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FEB;&#x7167;&#x3001;&#x7A0B;&#x5E8F;&#x53CA;&#x6846;&#x67B6;&#x5347;&#x7EA7;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x652F;&#x6301; Flink &#x7684;&#x63A5;&#x6536;&#x5668;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;HDFS &#x548C; Cassandra&#xFF0C;&#x4F46;&#x4E0D;&#x662F; Kafka&#xFF09;&#x3002;&#x5373;&#x4F7F;&#x5BF9;&#x4E8E;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x7A0B;&#x5E8F;&#xFF0C;Flink &#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x4FDD;&#x8BC1;&#x7ED3;&#x679C;&#x7B49;&#x540C;&#x4E8E;&#x6709;&#x6548;&#x7684;&#x65E0;&#x6545;&#x969C;&#x6267;&#x884C;&#x3002;&#x503C;&#x5F97;&#x6307;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5361;&#x592B;&#x5361;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4E00;&#x6B21;&#x5B8C;&#x5168;&#x7684;&#x751F;&#x4EA7;&#x8005;&#xFF0C;Flink&#x5F53;&#x4E0E;&#x5361;&#x592B;&#x5361;&#x4F5C;&#x4E3A;&#x6C34;&#x69FD;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x7ED3;&#x675F;&#x5230;&#x7ED3;&#x675F;&#x5B8C;&#x5168;&#x4E00;&#x6B21;&#x7684;&#x4FDD;&#x8BC1;&#x7684;&#x7ED3;&#x679C;&#x3002;</p><p>Kafka &#x4E2D;&#x7684; Streams API &#x901A;&#x8FC7;&#x5229;&#x7528; Kafka &#x4E2D;&#x7684;&#x6838;&#x5FC3;&#x5355;&#x5143;&#x63D0;&#x4F9B;&#x5BB9;&#x9519;&#x6027;&#xFF0C;&#x4FDD;&#x8BC1;&#x6301;&#x7EED;&#x5904;&#x7406;&#x548C;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3002;&#x7528;&#x6237;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x6216;&#x5B9E;&#x4F8B;&#x90FD;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x3002;&#x6240;&#x6709;&#x534F;&#x8C03;&#x5DE5;&#x4F5C;&#x7531;Kafka &#x4EE3;&#x7406;&#x8FDB;&#x884C;;&#x5404;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x53EA;&#x9700;&#x63A5;&#x6536;&#x56DE;&#x8C03;&#x5373;&#x53EF;&#x8C03;&#x6574;&#x5176;&#x4ED6;&#x5206;&#x533A;&#x5927;&#x5C0F;&#x3002;&#x6545;&#x969C;&#x5BB9;&#x9519;&#x5185;&#x7F6E;&#x4E8E;Kafka&#x534F;&#x8BAE;&#x4E2D;;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x5DF2;&#x7ED3;&#x675F;&#x6216;&#x542F;&#x52A8;&#x65B0;&#x5B9E;&#x4F8B;&#xFF0C;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x4ECE;&#x4EE3;&#x7406;&#x63A5;&#x6536;&#x4E00;&#x7EC4;&#x65B0;&#x7684;&#x5206;&#x533A;&#x6765;&#x5904;&#x7406;&#x3002;&#x5D4C;&#x5165; Streams API &#x7A0B;&#x5E8F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x5FC5;&#x96C6;&#x6210;&#x4EFB;&#x4F55;&#x7279;&#x6B8A;&#x7684;&#x5BB9;&#x9519; API&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x5FC5;&#x4E86;&#x89E3;&#x5BB9;&#x9519;&#x6A21;&#x578B;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x975E;&#x5E38;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x96C6;&#x6210;;&#x4EFB;&#x4F55;&#x6807;&#x51C6; Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Streams API&#x3002;</p><p>&#x603B;&#x4E4B;&#xFF0C;&#x867D;&#x7136;&#x5168;&#x5C40;&#x534F;&#x8C03;&#x6A21;&#x578B;&#x5BF9;&#x4E8E; Flink &#x4E2D;&#x7684;&#x6D41;&#x5F0F;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x5B83;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x6267;&#x884C;&#x6D41;&#x5904;&#x7406;&#x7684;&#x72EC;&#x7ACB;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x6548;&#x679C;&#x8F83;&#x4F4E;&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x53C2;&#x4E0E; Flink &#x7684;&#x68C0;&#x67E5;&#x70B9;&#xFF08;&#x5B9E;&#x73B0;&#x67D0;&#x4E9B; API&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x56DE;&#x6EDA;&#x67D0;&#x4E9B;&#x72B6;&#x6001;&#x66F4;&#x6539;&#x6765;&#x53C2;&#x4E0E;&#x5176;&#x4ED6;&#x5931;&#x8D25;&#x5206;&#x7247;&#x7684;&#x6062;&#x590D;&#xFF0C;&#x4EE5;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x8FD9;&#x663E;&#x7136;&#x4E0D;&#x50CF; Streams API &#x65B9;&#x6CD5;&#x90A3;&#x6837;&#x8F7B;&#x91CF;&#x7EA7;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x663E;&#x793A;&#x4E86;&#x5B83;&#x4EEC;&#x5728;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x4F18;&#x52BF;&#x3002;</p><h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2><p>&#x603B;&#x4E4B;&#xFF0C;&#x867D;&#x7136; Kafka &#x548C; Flink &#x4E2D;&#x7684; Streams API &#x4E4B;&#x95F4;&#x80AF;&#x5B9A;&#x6709;&#x91CD;&#x53E0;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x90E8;&#x7F72;&#x5728;&#x516C;&#x53F8;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x4E92;&#x8865;&#x7CFB;&#x7EDF;&#x3002;Streams API &#x4F7F;&#x6D41;&#x5904;&#x7406;&#x53EF;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#xFF0C;&#x800C;&#x4F5C;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x6784;&#x5EFA;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x53D7;&#x76CA;&#x4E8E; Kafka &#x7684;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#xFF08;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#x3001;&#x53EF;&#x9760;&#x6027;&#x548C;&#x5FEB;&#x901F;&#x3001;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x4E00;&#x6B21;&#x6027;&#x5904;&#x7406;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0E; Kafka &#x4E2D;&#x7684;&#x6838;&#x5FC3;&#x62BD;&#x8C61;&#x7D27;&#x5BC6;&#x96C6;&#x6210;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;Flink &#x975E;&#x5E38;&#x9002;&#x5408;&#x90E8;&#x7F72;&#x5728;&#x73B0;&#x6709;&#x7FA4;&#x96C6;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x53D7;&#x76CA;&#x4E8E;&#x541E;&#x5410;&#x91CF;&#x3001;&#x5EF6;&#x8FDF;&#x3001;&#x4E8B;&#x4EF6;&#x65F6;&#x95F4;&#x8BED;&#x4E49;&#x3001;&#x4FDD;&#x5B58;&#x70B9;&#x548C;&#x64CD;&#x4F5C;&#x529F;&#x80FD;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x7684;&#x4E00;&#x6B21;&#x4FDD;&#x8BC1;&#x3001;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5B8C;&#x5168;&#x4E00;&#x6B21;&#x4FDD;&#x8BC1;&#x548C;&#x6279;&#x5904;&#x7406;&#x3002;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&amp;#x8F6C;&amp;#x8F7D;&amp;#x7FFB;&amp;#x8BD1;&amp;#x81EA;&amp;#xFF1A; &lt;a href=&quot;https://www.confluent.io/blog/apache-flink-apache-kafka-streams-comparison-guid
      
    
    </summary>
    
      <category term="Stream processing" scheme="http://www.liufr.com/categories/Stream-processing/"/>
    
    
      <category term="Stream processing" scheme="http://www.liufr.com/tags/Stream-processing/"/>
    
  </entry>
  
  <entry>
    <title>Learning On-the-Job to Re-rank Anomalies from Top-1 Feedback(CMU,SDM&#39;19)</title>
    <link href="http://www.liufr.com/2019/11/28/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-11-28-Learning%20On-the-Job%20to%20Re-rank%20Anomalies%20from%20Top-1%20Feedback/"/>
    <id>http://www.liufr.com/2019/11/28/数据挖掘/2019-11-28-Learning On-the-Job to Re-rank Anomalies from Top-1 Feedback/</id>
    <published>2019-11-27T16:00:00.000Z</published>
    <updated>2019-11-29T08:12:22.725Z</updated>
    
    <content type="html"><![CDATA[<h2 id="&#x4E3B;&#x8981;&#x8D21;&#x732E;">&#x4E3B;&#x8981;&#x8D21;&#x732E;</h2><ol type="1"><li>&#x5C06;&#x95EE;&#x9898;&#x89C4;&#x7EA6;&#x6210;&#x5B66;&#x4E60;&#x91CD;&#x6392;&#x5F02;&#x5E38;&#x987A;&#x5E8F;</li><li>&#x901A;&#x8FC7;&#x4E13;&#x5BB6;&#x77E5;&#x8BC6;&#x627E;&#x5230;&#x4E0E;TP&#x76F8;&#x4F3C;&#x7684;&#x5F02;&#x5E38;&#x6837;&#x4F8B;</li></ol><h2 id="&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</h2><p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x5229;&#x7528;&#x4E13;&#x5BB6;&#x53CD;&#x9988;&#x6807;&#x7B7E;&#x66F4;&#x65B0;&#x6A21;&#x578B;&#x4ECE;&#x800C;&#x5BF9;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;&amp;#x4E3B;&amp;#x8981;&amp;#x8D21;&amp;#x732E;&quot;&gt;&amp;#x4E3B;&amp;#x8981;&amp;#x8D21;&amp;#x732E;&lt;/h2&gt;
&lt;ol type=&quot;1&quot;&gt;
&lt;li&gt;&amp;#x5C06;&amp;#x95EE;&amp;#x9898;&amp;#x89C4;&amp;#x7EA6;&amp;#
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>Lifelong Anomaly Detection Through Unlearning(UCB,CCS&#39;19)</title>
    <link href="http://www.liufr.com/2019/11/26/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-11-26-Lifelong%20Anomaly%20Detection%20Through%20Unlearning/"/>
    <id>http://www.liufr.com/2019/11/26/数据挖掘/2019-11-26-Lifelong Anomaly Detection Through Unlearning/</id>
    <published>2019-11-25T16:00:00.000Z</published>
    <updated>2019-11-28T08:03:31.527Z</updated>
    
    <content type="html"><![CDATA[<h2 id="&#x4E3B;&#x8981;&#x8D21;&#x732E;">&#x4E3B;&#x8981;&#x8D21;&#x732E;</h2><ol type="1"><li>&#x9996;&#x6B21;&#x63D0;&#x51FA;&#x7EC8;&#x8EAB;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6765;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x3002;&#x4E3A;&#x6B64;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;unlearning&#x6846;&#x67B6;&#x3002;</li><li>&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x7206;&#x70B8;&#x635F;&#x5931;&#xFF08;exploding loss&#xFF09;&#x548C;&#x707E;&#x96BE;&#x6027;&#x9057;&#x5FD8;&#xFF08;catastrophic forgetting&#xFF09;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x524D;&#x4E00;&#x4E2A;&#x662F;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x540E;&#x4E00;&#x4E2A;&#x662F;&#x89E3;&#x51B3;&#x7EC8;&#x8EAB;&#x5B66;&#x4E60;&#x7684;&#x95EE;&#x9898;&#x3002;</li><li>&#x62BD;&#x8C61;&#x4E86;&#x4E00;&#x4E2A;&#x7406;&#x8BBA;&#x7684;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7684;&#x6A21;&#x5757;&#xFF0C;unlearning&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x666E;&#x9002;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li><li>&#x4F7F;&#x7528;&#x4E09;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF1A;hdfs&#x65E5;&#x5FD7;&#xFF1B;Yahoo&#x7F51;&#x7EDC;&#x6D41;&#xFF1B;&#x4FE1;&#x7528;&#x5361;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x3002;</li></ol><h2 id="&#x7EC8;&#x8EAB;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;">&#x7EC8;&#x8EAB;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;</h2><h3 id="&#x5B9E;&#x4F8B;">&#x5B9E;&#x4F8B;</h3><p>&#x4EE5;CPU-high&#x4E3A;&#x4F8B;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x79CD;&#x5F02;&#x5E38;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5047;&#x8BBE;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6709;ssh-&gt;program-&gt;exit-&gt;CPU-high&#x548C;ssh-&gt;game-&gt;exit-&gt;CPU-high&#x4E24;&#x79CD;&#x3002;zero-positive&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;ssh-&gt;***-&gt;exit-&gt;CPU-high&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x4F46;&#x662F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x662F;&#xFF0C;&#x53EF;&#x80FD;&#x68C0;&#x6D4B;&#x51FA;ssh-&gt;notepad-&gt;exit-&gt;CPU-high&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x9020;&#x6210;&#x8FD9;&#x6837;&#x7ED3;&#x679C;&#x7684;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x4E3A;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E0D;&#x5B8C;&#x6574;&#x56E0;&#x6B64;&#x4E0D;&#x80FD;&#x6709;&#x6548;&#x8BC6;&#x522B;&#x51FA;&#x90A3;&#x4E9B;&#x5BFC;&#x81F4;CPU-high&#x7684;&#x6D3B;&#x52A8;&#x3002;</p><p>&#x771F;&#x5B9E;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x5F80;&#x5F80;&#x91C7;&#x7528;&#x7684;&#x662F;&#x8BA9;&#x7BA1;&#x7406;&#x53CD;&#x9988;FN&#x548C;FP&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x672C;&#x6587;&#x4F7F;&#x7528;&#x7684;&#x7EC8;&#x8EAB;&#x5B66;&#x4E60;&#x6765;&#x68C0;&#x6D4B;&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x589E;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x6A21;&#x578B;&#x6765;&#x62A5;&#x544A;FN&#x548C;FP&#x7684;&#x60C5;&#x51B5;&#x3002;</p><h3 id="&#x95EE;&#x9898;&#x5B9A;&#x4E49;">&#x95EE;&#x9898;&#x5B9A;&#x4E49;</h3><p>&#x5F62;&#x5F0F;&#x5316;&#x4E00;&#x4E2A;zero-positive&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#x5E76;&#x4E14;&#x9610;&#x8FF0;&#x5982;&#x4F55;&#x751F;&#x6210;&#x4E00;&#x4E2A;ML&#x7684;&#x6A21;&#x578B;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p><p><strong>&#x95EE;&#x9898;&#x5B9A;&#x4E49;(Anomaly detection)&#xFF1A;</strong> &#x8003;&#x8651;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;<span class="math inline">\(x_t(1\leq t\leq T)\)</span>,&#x91C7;&#x6837;&#x81EA;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5206;&#x5E03;<span class="math inline">\(\mathcal{D}\)</span>,&#x6982;&#x7387;&#x4E3A;<span class="math inline">\(1-\epsilon\)</span>&#x3002;&#x5BF9;&#x4E8E;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5B9E;&#x4F8B;<span class="math inline">\(x_t(t&gt;T)\)</span>&#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#x5176;&#x662F;&#x5426;&#x6765;&#x81EA;&#x540C;&#x6837;&#x7684;&#x5206;&#x5E03;&#x3002;</p><p>&#x4E0A;&#x8FF0;&#x5B9A;&#x4E49;&#x4E2D;<span class="math inline">\(x_1,...x_T\)</span>&#x662F;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x5E38;&#x91CF;<span class="math inline">\(\epsilon\)</span>&#x8868;&#x793A;&#x7684;&#x662F;&#x5F02;&#x5E38;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF0C;&#x5F53;&#x5176;&#x7B49;&#x4E8E;0&#x65F6;&#x5219;&#x8BF4;&#x660E;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x79CD;&#x4E0D;&#x5B58;&#x5728;&#x5F02;&#x5E38;&#x3002;</p><p>&#x4E4B;&#x524D;&#x7684;zero-positive&#x5DE5;&#x4F5C;&#x90FD;&#x5047;&#x8BBE;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5B8C;&#x5168;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5B58;&#x5728;&#x5076;&#x5C14;&#x4EBA;&#x5DE5;&#x6807;&#x6CE8;&#x9519;&#x8BEF;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x8003;&#x8651;&#x566A;&#x97F3;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6709;<span class="math inline">\(\epsilon&gt;0\)</span>&#x4F46;&#x662F;&#x8BE5;&#x503C;&#x975E;&#x5E38;&#x5C0F;&#x3002;</p><p><strong>&#x5206;&#x5E03;&#x5047;&#x8BBE;&#xFF1A;</strong> &#x4E0D;&#x540C;&#x5E94;&#x7528;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x540C;&#x7684;ML&#x6A21;&#x578B;&#x5E94;&#x8BE5;&#x88AB;&#x8BBE;&#x5B9A;&#x6210;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x5206;&#x5E03;&#x3002;&#x5927;&#x4F53;&#x6765;&#x8BF4;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x5206;&#x5E03;&#xFF1A;&#x65F6;&#x95F4;&#x654F;&#x611F;&#x5206;&#x5E03;&#x548C;&#x65F6;&#x95F4;&#x4E0D;&#x654F;&#x611F;&#x5206;&#x5E03;&#x3002;</p><ul><li><em>&#x65F6;&#x95F4;&#x4E0D;&#x654F;&#x611F;&#x5206;&#x5E03;</em>&#xFF1A; &#x5728;&#x4EFB;&#x610F;&#x65F6;&#x95F4;<span class="math inline">\(t\)</span>&#xFF0C;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x662F;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x6982;&#x7387;&#x8D28;&#x91CF;&#x51FD;&#x6570;&#x4E3A;<span class="math inline">\(Pr(x_t)\)</span></li><li><em>&#x65F6;&#x95F4;&#x654F;&#x611F;&#x5206;&#x5E03;</em>&#xFF1A;&#x65F6;&#x95F4;<span class="math inline">\(t\)</span>&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x4F9D;&#x8D56;&#x4E8E;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#xFF0C;&#x6982;&#x7387;&#x8D28;&#x91CF;&#x51FD;&#x6570;&#x4E3A;<span class="math inline">\(Pr(x_t|x_{t-1}...x_1)\)</span></li></ul><p><strong>&#x7EC8;&#x8EAB;&#x5B66;&#x4E60;&#xFF1A;</strong> &#x5728;&#x4E0A;&#x8FF0;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x662F;&#x65E0;&#x6807;&#x7B7E;&#x7684;&#x56E0;&#x6B64;&#x4F1A;&#x975E;&#x5E38;&#x4E0D;&#x51C6;&#x786E;&#x3002;&#x5728;&#x771F;&#x5B9E;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4EBA;&#x5DE5;&#x68C0;&#x6D4B;&#x4E00;&#x4E9B;&#x53EF;&#x7591;&#x7684;&#x6837;&#x4F8B;&#x7136;&#x540E;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x6807;&#x7B7E;&#x3002;&#x5728;&#x672C;&#x6B21;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x80FD;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x63D0;&#x9AD8;&#x51C6;&#x786E;&#x7387;&#x3002;</p><p><strong>&#x95EE;&#x9898;&#x5B9A;&#x4E49;(Lifelong Anomaly detection)&#xFF1A;</strong> &#x8003;&#x8651;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;<span class="math inline">\(x_t(1\leq t\leq T)\)</span>,&#x91C7;&#x6837;&#x81EA;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5206;&#x5E03;<span class="math inline">\(\mathcal{D}\)</span>,&#x6982;&#x7387;&#x4E3A;<span class="math inline">\(1-\epsilon\)</span>&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x6709;n&#x5BF9;<span class="math inline">\((t_i,l_i),1\leq t_i\leq T,l_i\in {-1,+1}\)</span>&#x3002;&#x5047;&#x5982;<span class="math inline">\(x_{t_i}\)</span>&#x662F;&#x4ECE;<span class="math inline">\(\mathcal{D}\)</span>&#x4E2D;&#x91C7;&#x6837;&#x7684;&#x90A3;&#x4E48;<span class="math inline">\(l_i\)</span>&#x4E3A;&#x8D1F;&#x3002;&#x5BF9;&#x4E8E;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5B9E;&#x4F8B;<span class="math inline">\(x_t(t&gt;T)\)</span>&#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#x5176;&#x662F;&#x5426;&#x6765;&#x81EA;&#x540C;&#x6837;&#x7684;&#x5206;&#x5E03;&#x3002;</p><p>&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x4EBA;&#x5DE5;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x91CF;&#x8F83;&#x5C11;&#x4E14;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#xFF0C;&#x6211;&#x4EEC;&#x628A;<span class="math inline">\((t_i,l_i)\)</span>&#x4E2D;<span class="math inline">\(l_i=+1\)</span>&#x7684;&#x89C6;&#x4F5C;FN&#xFF0C;<span class="math inline">\(l_i=-1\)</span>&#x89C6;&#x4F5C;FP&#x3002;</p><h3 id="&#x901A;&#x7528;&#x7684;ml&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7406;&#x8BBA;&#x6846;&#x67B6;">&#x901A;&#x7528;&#x7684;ML&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7406;&#x8BBA;&#x6846;&#x67B6;</h3><h4 id="&#x901A;&#x7528;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x6846;&#x67B6;">&#x901A;&#x7528;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x6846;&#x67B6;</h4><p>&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5B66;&#x4E60;&#x5230;&#x5176;&#x6982;&#x7387;&#x8D28;&#x91CF;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5176;&#x5206;&#x5E03;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x4F9D;&#x8D56;ML&#x901A;&#x7528;&#x6A21;&#x578B;&#x3002;&#x6A21;&#x578B;&#x8003;&#x8651;&#x4E24;&#x7C7B;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF1A;&#x89C2;&#x6D4B;&#x53D8;&#x91CF;<em>X</em>&#x548C;&#x9690;&#x85CF;&#x53D8;&#x91CF;<em>H</em>&#x3002;&#x5047;&#x8BBE;&#x8054;&#x5408;&#x6982;&#x7387;<span class="math inline">\(Pr(X,H)\)</span>&#x662F;&#x901A;&#x8FC7;&#x51FD;&#x6570;<span class="math inline">\(f_\theta(X,H)\)</span>&#x6A21;&#x578B;&#x5316;&#x7684;&#xFF0C;&#x5176;&#x4E2D;<span class="math inline">\(\theta\)</span>&#x662F;&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;<span class="math inline">\(X\)</span>&#x7684;&#x8FB9;&#x7F18;&#x6982;&#x7387;&#x662F; <span class="math display">\[\operatorname{Pr}(X)=\int_{h} f_{\theta}(X, H=h)\]</span></p><p>&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5BFB;&#x627E;&#x4E00;&#x7EC4;&#x53C2;&#x6570;<span class="math inline">\(\theta\)</span>&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x5316;&#x76F8;&#x4F3C;&#x6027;&#x6216;&#x8005;&#x4F18;&#x5316;&#x5176;&#x7B49;&#x4EF7;&#x8F6C;&#x6362;&#xFF1A;</p><p><span class="math display">\[\begin{aligned} \theta^{\star} &amp;=\underset{\theta}{\operatorname{argmax}} \prod_{x_{t}} \operatorname{Pr}\left(X=x_{t}\right) \\ &amp;=\underset{\theta}{\operatorname{argmax}} \prod_{x_{t}} f_{\theta}\left(X=x_{t}, H=h\right) \end{aligned}\]</span></p><p>&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x67D0;&#x4E2A;&#x5B9E;&#x4F8B;<span class="math inline">\(x\)</span>&#x662F;&#x5426;&#x8D85;&#x51FA;&#x9608;&#x503C;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x6A21;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x9AD8;&#x65AF;&#x6DF7;&#x5408;&#x6A21;&#x578B;&#x3001;PCA&#x3001;LSTM&#xFF0C;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x7B49;&#x3002;</p><p><strong>LSTM</strong></p><p>&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;LSTM&#x6A21;&#x578B;&#xFF0C;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[\begin{aligned} h_{t-1} &amp;=f_{\theta}\left(h_{t-2}, x_{t-1}\right) \\ \operatorname{Pr}\left(x_{t} | x_{1} \ldots x_{t-1}\right) &amp;=g_{\rho}\left(h_{t-1}, x_{t}\right) \end{aligned}\]</span> &#x8FD9;&#x53EF;&#x4EE5;&#x8FED;&#x4EE3;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;<span class="math inline">\(t\)</span>&#x7684;&#x503C;&#x3002;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x6982;&#x7387;&#x4ECE;&#x800C;&#x786E;&#x5B9A;&#x5F02;&#x5E38;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x4E0E;&#x5176;&#x4E8B;&#x5148;&#x786E;&#x5B9A;&#x7684;&#x9608;&#x503C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p><p><img src="/2019/11/26/&#x6570;&#x636E;&#x6316;&#x6398;/2019-11-26-Lifelong Anomaly Detection Through Unlearning/fig1.jpg"></p><p>&#x5982;&#x679C;&#x4E8B;&#x4EF6;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5229;&#x7528;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#x51FD;&#x6570;&#x6765;&#x9884;&#x6D4B;&#x4E0B;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x4E0E;&#x5B9E;&#x9645;&#x503C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x662F;&#x5426;&#x504F;&#x79BB;&#x8FC7;&#x5927;&#x3002;</p><p><img src="/2019/11/26/&#x6570;&#x636E;&#x6316;&#x6398;/2019-11-26-Lifelong Anomaly Detection Through Unlearning/fig2.jpg"></p><p>LSTM&#x7684;&#x4F18;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5B66;&#x4E60;&#x53BB;&#x9057;&#x5FD8;&#x90A3;&#x4E9B;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x975E;&#x57FA;&#x672C;&#x4E8B;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x5904;&#x7406;&#x622A;&#x65AD;&#x7684;&#x6570;&#x636E;&#xFF08;&#x6A21;&#x578B;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x95F4;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#xFF09;&#x548C;&#x566A;&#x97F3;&#x6570;&#x636E;&#xFF08;&#x8BAD;&#x7EC3;&#x4E2D;&#x7684;&#x5F02;&#x5E38;&#x6570;&#x636E;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#x672C;&#x6587;&#x9009;&#x62E9;LSTM&#x4F5C;&#x4E3A;&#x65F6;&#x95F4;&#x654F;&#x611F;&#x5206;&#x5E03;&#x7684;&#x6A21;&#x578B;&#x57FA;&#x7840;&#x3002;</p><p><strong>&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;</strong></p><p>&#x5F53;&#x4E8B;&#x4EF6;&#x4E0E;&#x65F6;&#x95F4;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x65E0;&#x9700;&#x8003;&#x8651;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;autoencoder&#x662F;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x3002;&#x7F16;&#x7801;&#x5668;&#x4E3A;<span class="math inline">\(\phi\)</span>,&#x89E3;&#x7801;&#x5668;&#x4E3A;<span class="math inline">\(\varphi\)</span>,&#x8FD9;&#x4E24;&#x4E2A;&#x90FD;&#x662F;&#x5E26;&#x53C2;&#x7684;&#x51FD;&#x6570;&#x3002;encoder&#x53EF;&#x4EE5;&#x5C06;&#x8F93;&#x5165;<span class="math inline">\(x\)</span>&#x6620;&#x5C04;&#x5230;&#x9690;&#x85CF;&#x72B6;&#x6001;<span class="math inline">\(h=\phi(x)\)</span>, decoder&#x53EF;&#x4EE5;&#x5C06;<span class="math inline">\(h\)</span>&#x6620;&#x5C04;&#x5230;&#x8F93;&#x5165;&#x7A7A;&#x95F4;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E0A;<span class="math inline">\(x&apos;, x&apos;=\varphi(h)\)</span>,&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x8054;&#x5408;&#x6982;&#x7387;&#x4E3A; <span class="math display">\[Pr(x,h) \propto exp(-||x-\varphi(\phi(x))||^2/2)\]</span></p><p><img src="/2019/11/26/&#x6570;&#x636E;&#x6316;&#x6398;/2019-11-26-Lifelong Anomaly Detection Through Unlearning/fig3.jpg"></p><p>&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x770B;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x901A;&#x8FC7;encoder&#x548C;decoder&#x4E4B;&#x540E;&#xFF0C;&#x7ED3;&#x679C;&#x4E0E;&#x539F;&#x8F93;&#x5165;&#x7684;&#x5DEE;&#x522B;&#x5927;&#x5C0F;&#x3002;</p><h4 id="&#x8BAD;&#x7EC3;&#x6A21;&#x578B;">&#x8BAD;&#x7EC3;&#x6A21;&#x578B;</h4><p>&#x4E3A;&#x4E86;&#x4E25;&#x8C28;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E8B;&#x4EF6;&#x7F16;&#x7801;&#x6210;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x5411;&#x91CF;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FDE;&#x7EED;&#x503C;&#x7684;&#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5F53;&#x4F5C;&#x5411;&#x91CF;&#x4F7F;&#x7528;&#xFF1B;&#x79BB;&#x6563;&#x503C;&#x7684;&#x4E8B;&#x4EF6;&#x4F7F;&#x7528;one-hot&#x7F16;&#x7801;&#xFF1B;&#x6DF7;&#x5408;&#x7684;&#x65E2;&#x6709;&#x79BB;&#x6563;&#x503C;&#x4E5F;&#x6709;&#x8FDE;&#x7EED;&#x503C;&#x7684;&#x53EF;&#x4EE5;&#x5C06;&#x4ED6;&#x4EEC;&#x5206;&#x5F00;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x7136;&#x540E;&#x8FDE;&#x63A5;&#x5411;&#x91CF;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x7684;&#x5411;&#x91CF;&#x3002;</p><p>&#x4E3A;&#x4E86;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x7B49;&#x4EF7;&#x4E8E;&#x6700;&#x5C0F;&#x5316;<span class="math inline">\(-logPr(X)\)</span>&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x5B9A;&#x4E49;&#xFF0C;&#x5BF9;&#x4E8E;&#x65F6;&#x95F4;&#x654F;&#x611F;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;RNN&#x7684;&#x6A21;&#x578B;loss-function&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A; <span class="math display">\[\mathcal{L}_{\theta, \rho}(X)=\sum_{t=1}^{T}-\log \left(g_{\rho}\left(h_{t-1}, x_{t}\right)\right)\]</span></p><p>&#x5176;&#x4E2D;<span class="math inline">\(h_t\)</span>&#x662F;&#x53EF;&#x4EE5;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x4E14;&#x521D;&#x59CB;&#x5316;&#x4E3A;0&#x3002;&#x5BF9;&#x4E8E;autoencoder&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E3A; <span class="math display">\[\mathcal{L}\left(x_{t}\right)=\left\|x_{t}-\varphi\left(\phi\left(x_{t}\right)\right)\right\|^{2}\]</span></p><p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4F9D;&#x8D56;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x6765;&#x8BA1;&#x7B97;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x68AF;&#x5EA6;&#x6765;&#x66F4;&#x65B0;<span class="math inline">\(\theta\)</span>,&#x5229;&#x7528;SGD&#x4F5C;&#x4E3A;&#x4F8B;&#x5B50;&#xFF0C;&#x90A3;&#x4E48;<span class="math inline">\(\theta\)</span>&#x7684;&#x66F4;&#x65B0;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[\theta_{\text {new }} \leftarrow \theta_{\text {old }}-\eta \cdot \nabla_{\theta} \mathcal{L}_{\theta}\]</span> &#x5176;&#x4E2D;<span class="math inline">\(\eta\)</span> &#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F88;&#x5C0F;&#x7684;&#x9759;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x4EE3;&#x8868;&#x5B66;&#x4E60;&#x901F;&#x7387;&#x548C;&#x6B65;&#x957F;&#x3002;</p><h2 id="unlearning&#x7528;&#x5728;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x66F4;&#x65B0;">Unlearning&#x7528;&#x5728;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x6A21;&#x578B;&#x7684;&#x66F4;&#x65B0;</h2><p>&#x5F53;&#x90E8;&#x7F72;&#x4E00;&#x4E2A;ML&#x6A21;&#x578B;&#x540E;&#xFF0C;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x6839;&#x636E;&#x65B0;&#x62A5;&#x544A;&#x7684;FP&#x548C;FN&#x6837;&#x4F8B;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x6A21;&#x578B;&#x3002;&#x73B0;&#x6709;&#x7684;&#x751F;&#x6210;&#x6A21;&#x578B;&#x5E76;&#x4E0D;&#x4F1A;&#x652F;&#x6301;&#x8FD9;&#x6837;&#x7684;&#x66F4;&#x65B0;&#x8FC7;&#x7A0B;&#x3002;&#x4E3B;&#x8981;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;<span class="math inline">\(x_t\)</span>&#x662F;FN&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6700;&#x5C0F;&#x5316;&#x6982;&#x7387;<span class="math inline">\(Pr(x_t|x_1,...x_{t-1})\)</span>&#xFF0C;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x505A;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x548C;&#x707E;&#x96BE;&#x6027;&#x9057;&#x5FD8;&#x3002;Unlearning&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4E0D;&#x4F24;&#x5BB3;&#x5176;&#x4ED6;&#x65E0;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x5B9E;&#x73B0;&#x3002;</p><p>&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;FP&#xFF0C;&#x6B63;&#x5E38;&#x7684;&#x4E8B;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x5E38;&#x89C4;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p><h3 id="unlearning-&#x6982;&#x89C8;">Unlearning &#x6982;&#x89C8;</h3><p>&#x8003;&#x8651;&#x65F6;&#x95F4;&#x4E0D;&#x654F;&#x611F;&#x7684;&#x4F8B;&#x5B50;&#xFF08;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5230;&#x65F6;&#x95F4;&#x654F;&#x611F;&#x7684;&#x4F8B;&#x5B50;&#x4E0A;&#xFF09;&#x3002;&#x9996;&#x5148;&#x8003;&#x8651;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;positive&#x6837;&#x4F8B;<span class="math inline">\((t,+1)\)</span>&#x7684;&#x6709;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8FD9;&#x6837;<span class="math inline">\(x_t\)</span>&#x88AB;&#x9519;&#x8BEF;&#x4F30;&#x8BA1;&#x6210;&#x8D1F;&#x6837;&#x672C; <span class="math display">\[Pr(x_t) &gt; \tau\]</span> &#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9608;&#x503C;<span class="math inline">\(\tau\)</span>,&#x7B49;&#x4EF7;&#x4E8E; <span class="math display">\[\mathcal{L}(x_t) &lt; \tau&apos;\]</span> &#x5BF9;&#x4E8E;&#x5BF9;&#x5E94;&#x7684;&#x9608;&#x503C;<span class="math inline">\(\tau&apos;\)</span>, &#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4FEE;&#x6539;&#x6A21;&#x578B;&#x6765;&#x51CF;&#x5C11;<span class="math inline">\(Pr(x_t)\)</span>&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x7B49;&#x4EF7;&#x4E8E;&#x589E;&#x52A0;<span class="math inline">\(\mathcal{L}(x_t)\)</span> <span class="math display">\[\mathcal{L}_{unlearn}(x_t) = -\mathcal{L}(x_t)\]</span> &#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x540C;&#x6837;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;<span class="math inline">\(\mathcal{L}_{unlearn}\)</span>&#x7684;&#x6700;&#x5C0F;&#x5316;&#x8BAD;&#x7EC3;&#xFF0C;&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#xFF1A; <span class="math display">\[\nabla_{\theta} \mathcal{L}_{\text {unlearn }}\left(x_{t}\right)=\nabla_{\theta}\left(-\mathcal{L}\left(x_{t}\right)\right)=-\nabla_{\theta} \mathcal{L}\left(x_{t}\right)\]</span> &#x56E0;&#x6B64;&#x5E94;&#x7528;&#x66F4;&#x65B0;&#x89C4;&#x5219;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[\theta_{\mathrm{new}} \leftarrow \theta_{\mathrm{old}}-\eta \cdot \nabla_{\theta} \mathcal{L}_{\mathrm{unlearn}}\left(x_{t}\right)=\theta_{\mathrm{old}}+\eta \cdot \nabla_{\theta} \mathcal{L}\left(x_{t}\right)\]</span></p><p>&#x901A;&#x8FC7;&#x5B9A;&#x4E49;<span class="math inline">\(\mathcal{L}_{unlearn}(S)\)</span>&#x6765;&#x5904;&#x7406;&#x96C6;&#x5408;<span class="math inline">\(S=\{x_t,l_t\}\)</span> <span class="math display">\[\mathcal{L}_{\text {unlearn }}(S)=-\sum_{t} l_{t} \mathcal{L}\left(x_{t}\right)\]</span> &#x90A3;&#x4E48;SGD&#x53EF;&#x4EE5;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A; <span class="math display">\[\theta_{\mathrm{new}} \leftarrow \theta_{\mathrm{old}}+\eta \sum_{t} l_{t} \cdot \nabla_{\theta} \mathcal{L}\left(x_{t}\right)\]</span></p><h3 id="&#x89E3;&#x51B3;&#x7206;&#x70B8;&#x635F;&#x5931;">&#x89E3;&#x51B3;&#x7206;&#x70B8;&#x635F;&#x5931;</h3><p>&#x5F53;&#x5904;&#x7406;FN&#x65F6;&#xFF0C;unlearning&#x7B97;&#x6CD5;&#x6700;&#x5927;&#x5316;<span class="math inline">\(\mathcal{L}(x_t)\)</span>,&#x7B49;&#x4EF7;&#x4E8E;&#x6700;&#x5C0F;&#x5316;<span class="math inline">\(Pr(x_t)\)</span>,&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x6982;&#x7387;&#x6709;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;&#x4E8E;0&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;<span class="math inline">\(\mathcal{L}(x_t)\)</span>&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x5927;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<span class="math inline">\(x_1,....x_{t-1}\)</span>&#x6807;&#x8BB0;&#x4E3A;&#x8D1F;&#x6837;&#x672C;&#xFF0C;<span class="math inline">\(x_t\)</span>&#x6807;&#x8BB0;&#x4E3A;&#x6B63;&#x6837;&#x672C;&#xFF0C;unlearning&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF1A; <span class="math display">\[\sum_{i=1}^{t-1} \mathcal{L}\left(x_{i}\right)-\mathcal{L}\left(x_{t}\right)\]</span></p><p>&#x4E0D;&#x8003;&#x8651;&#x4E0A;&#x5F0F;&#x6700;&#x540E;&#x90A3;&#x4E2A;&#x8D1F;&#x9879;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x51CF;&#x5C0F;&#x6BCF;&#x4E2A;&#x72EC;&#x7ACB;<span class="math inline">\(\mathcal{L}(x_i)\)</span>&#x7684;&#x503C;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x9879;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x4E0B;&#x5C4A;&#xFF08;&#x4F8B;&#x5982;0&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x6574;&#x4E2A;&#x6C42;&#x548C;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x662F;<span class="math inline">\(\tau\)</span>,&#x90A3;&#x4E48;&#x6BCF;&#x4E2A;&#x5355;&#x9879;&#x7684;&#x4E0A;&#x754C;&#x4E5F;&#x4E00;&#x5B9A;&#x662F;<span class="math inline">\(\tau\)</span></p><p>&#x5F53;&#x8003;&#x8651;<span class="math inline">\(=\mathcal{L}(x_t)\)</span>&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x4E0A;&#x5F0F;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x6700;&#x5927;&#x5316;<span class="math inline">\(\mathcal{L}(x_t)\)</span>&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x4FDD;&#x8BC1;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x6982;&#x7387;<span class="math inline">\(Pr(x_t)\)</span>&#x8D8B;&#x8FD1;&#x4E8E;0&#xFF0C;&#x540C;&#x6837;&#x7684;<span class="math inline">\(Pr(x_i)\)</span>&#x4E5F;&#x8D8B;&#x8FD1;&#x4E8E;0&#x3002;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x4E0A;&#x5F0F;&#x7B80;&#x5355;&#x9884;&#x6D4B;&#x5F02;&#x5E38;&#x3002;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;&amp;#x4E3B;&amp;#x8981;&amp;#x8D21;&amp;#x732E;&quot;&gt;&amp;#x4E3B;&amp;#x8981;&amp;#x8D21;&amp;#x732E;&lt;/h2&gt;
&lt;ol type=&quot;1&quot;&gt;
&lt;li&gt;&amp;#x9996;&amp;#x6B21;&amp;#x63D0;&amp;#x51FA;&amp;#x7EC8;&amp;#
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>Semi-supervised Anomaly Detection with an Application to Water Analytics</title>
    <link href="http://www.liufr.com/2019/11/20/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-11-20-Semi-supervised%20Anomaly%20Detection%20with%20an%20Application%20to%20Water%20Analytics/"/>
    <id>http://www.liufr.com/2019/11/20/数据挖掘/2019-11-20-Semi-supervised Anomaly Detection with an Application to Water Analytics/</id>
    <published>2019-11-19T16:00:00.000Z</published>
    <updated>2019-11-20T02:44:00.145Z</updated>
    
    <content type="html"><![CDATA[<p>Semi-supervised Anomaly Detection with an Application to Water Analytics(ICDM&apos;18)</p><hr><h2 id="&#x6982;&#x8981;">&#x6982;&#x8981;</h2><p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x7EA6;&#x675F;&#x7684;&#x805A;&#x7C7B;&#x65B9;&#x6CD5;&#x6765;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x3002; * &#x534A;&#x76D1;&#x7763; * &#x7ED3;&#x5408;&#x6C34;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x5B9E;&#x4F8B;&#x8FDB;&#x884C;&#x5206;&#x6790; * &#x4ECB;&#x7ECD;&#x4E86;&#x76F8;&#x5173;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;</p><hr><h2 id="&#x65B9;&#x6CD5;">&#x65B9;&#x6CD5;</h2><p>&#x57FA;&#x4E8E;&#x4EE5;&#x4E0B;&#x5047;&#x8BBE;&#xFF1A; 1. &#x8DDD;&#x79BB;&#x7C7B;&#x4E2D;&#x5FC3;&#x70B9;&#x8D8A;&#x8FDC;&#x7684;&#x70B9;&#x8D8A;&#x5F02;&#x5E38; 2. &#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x4E2D;&#x5FC3;&#x70B9;&#x79BB;&#x5927;&#x591A;&#x6570;&#x4E2D;&#x5FC3;&#x70B9;&#x8D8A;&#x8FDC;&#xFF0C;&#x8D8A;&#x5F02;&#x5E38; 3. &#x7C7B;&#x7684;&#x89C4;&#x6A21;&#x8D8A;&#x5C0F;&#xFF0C;&#x8D8A;&#x5F02;&#x5E38;</p><p>&#x8BC4;&#x5206;&#x51FD;&#x6570;&#xFF1A; <span class="math display">\[\text {score}(f)=1-g\left(\frac{\text {point}_{-} d e v(f) \times \text {cluster}_{-} d e v(f)}{\text {cluster}_{-} \operatorname{size}(f)} ; \gamma\right)\]</span></p><p><strong>&#x70B9;&#x504F;&#x79FB;</strong>&#xFF1A;&#x8868;&#x793A;&#x70B9;&#x8DDD;&#x79BB;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x4E2D;&#x5FC3;&#x70B9;&#x7684;&#x504F;&#x79FB;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6700;&#x5927;&#x8DDD;&#x79BB;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#x8868;&#x793A; <span class="math display">\[\operatorname{point}_{-} \operatorname{dev}(f)=\left\{\begin{array}{ll}{\frac{d(f, c(f))}{\max _{f_{i} \in C(f)} d\left(f_{i}, c(f)\right)}} &amp; {\text { if }|C(f)|&gt;1} \\ {1} &amp; {\text { otherwise }}\end{array}\right.\]</span></p><p><strong>&#x7C7B;&#x504F;&#x79FB;</strong>&#xFF1A;&#x8868;&#x793A;&#x67D0;&#x4E2A;&#x7C7B;&#x4E2D;&#x5FC3;&#x8DDD;&#x79BB;&#x5176;&#x4ED6;&#x7C7B;&#x4E2D;&#x5FC3;&#x7684;&#x504F;&#x79FB;&#x91CF; <span class="math display">\[cluster\_dev (f)=\left\{\begin{array}{ll}{\frac{\min _{1 \leq i \leq n_{c} \wedge c(f) \neq c_{i}} d\left(c(f), c_{i}\right)}{\max _{1 \leq i, j \leq n_{c}} d\left(c_{i}, c_{j}\right)}} &amp; {\text { if } n_{c}&gt;1} \\ {1} &amp; {\text { otherwise }}\end{array}\right.\]</span></p><p><strong>&#x7C7B;&#x5927;&#x5C0F;</strong>&#xFF1A;&#x8868;&#x793A;&#x5F53;&#x524D;&#x7C7B;&#x4E0E;&#x5DF2;&#x77E5;&#x6700;&#x5927;&#x7C7B;&#x7684;&#x6BD4;&#x8F83;&#x7ED3;&#x679C; <span class="math display">\[\text { cluster }_{-} \operatorname{size}(f)=\frac{|C(f)|}{\max _{1 \leq i \leq n_{c}}\left|C_{i}\right|}\]</span></p><p><strong>&#x538B;&#x7F29;&#x51FD;&#x6570;</strong>&#xFF1A;g&#xFF0C; &#x7528;&#x6765;&#x5C06;&#x5F02;&#x5E38;&#x5206;&#x6570;&#x6620;&#x5C04;&#x5230;<span class="math inline">\([0,1]\)</span>&#x533A;&#x95F4;&#x4E2D;&#xFF0C;&#x8F83;&#x5927;&#x7684;&#x6570;&#x503C;&#x8868;&#x793A;&#x8F83;&#x53EF;&#x80FD;&#x7684;&#x5F02;&#x5E38;&#x3002; <span class="math display">\[g(x ; \gamma)=2^{-\frac{x^{2}}{\gamma^{2}}}\]</span></p><hr><h2 id="&#x901A;&#x8FC7;&#x6807;&#x7B7E;&#x6269;&#x6563;&#x66F4;&#x65B0;&#x5206;&#x6570;">&#x901A;&#x8FC7;&#x6807;&#x7B7E;&#x6269;&#x6563;&#x66F4;&#x65B0;&#x5206;&#x6570;</h2><p>&#x56E0;&#x4E3A;&#x8981;&#x6700;&#x5927;&#x5316;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x901A;&#x8FC7;&#x6807;&#x7B7E;&#x6269;&#x6563;&#x66F4;&#x65B0;&#x521D;&#x59CB;&#x5316;&#x5F02;&#x5E38;&#x5206;&#x6570; <span class="math display">\[\begin{array}{l}{S(f)=\frac{1}{Z(f)}\left[\operatorname{score}(f)+\alpha \sum_{f_{j} \in L_{a}} g\left(d\left(f, f_{j}\right) ; \eta\right)\right]} \\ {Z(f)=1+\alpha \sum_{f_{j} \in L} g\left(d\left(f, f_{j}\right) ; \eta\right)}\end{array}\]</span></p><p>&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x8BA9;&#x90A3;&#x4E9B;&#x79BB;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x8FD1;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x83B7;&#x5F97;&#x6807;&#x7B7E;&#x7684;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F71;&#x54CD;&#x56E0;&#x5B50;&#x5E73;&#x8861;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x7ED3;&#x679C;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;Semi-supervised Anomaly Detection with an Application to Water Analytics(ICDM&amp;apos;18)&lt;/p&gt;
&lt;hr&gt;
&lt;h2 id=&quot;&amp;#x6982;&amp;#x8981;&quot;&gt;&amp;#x6982;&amp;#x8981
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>Signature-based IDS 混合告警管理策略</title>
    <link href="http://www.liufr.com/2019/11/01/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-11-01-%E6%B7%B7%E5%90%88%E5%91%8A%E8%AD%A6%E7%AE%A1%E7%90%86%E7%AD%96%E7%95%A5/"/>
    <id>http://www.liufr.com/2019/11/01/数据挖掘/2019-11-01-混合告警管理策略/</id>
    <published>2019-10-31T16:00:00.000Z</published>
    <updated>2019-11-01T08:40:04.738Z</updated>
    
    <content type="html"><![CDATA[<p><a href="https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;arnumber=8809121&amp;tag=1" target="_blank" rel="noopener">A hybrid alarm management strategy in signature-based intrusion detection systems</a></p><p>&#x672C;&#x6587;&#x8BA4;&#x4E3A;&#x5355;&#x4E00;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x8003;&#x8651;&#x6DF7;&#x5408;&#x7684;&#x7B56;&#x7565;&#x6765;&#x8FDB;&#x884C;&#x544A;&#x8B66;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x51CF;&#x5C11;&#x544A;&#x8B66;&#x7684;&#x76EE;&#x7684;</p><p><img src="/2019/11/01/&#x6570;&#x636E;&#x6316;&#x6398;/2019-11-01-&#x6DF7;&#x5408;&#x544A;&#x8B66;&#x7BA1;&#x7406;&#x7B56;&#x7565;/strategy.jpg"></p><h2 id="alarm-verification">Alarm verification</h2><p>&#x8BA4;&#x8BC1;&#x6A21;&#x5757;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#xFF1A;&#x8B66;&#x544A; + &#x7F51;&#x7EDC;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;</p><p>&#x7ED3;&#x679C;&#x5206;&#x6790;&#x662F;&#x4E00;&#x4E2A;&#x4E5D;&#x7EF4;&#x5411;&#x91CF;&#xFF1A;<strong>time, IP, port, protocol, OS, OS version, service, service version and vulnerability referenc</strong></p><h3 id="&#x62A5;&#x8B66;&#x4E0E;&#x6F0F;&#x6D1E;&#x7684;&#x76F8;&#x5173;&#x6027;">&#x62A5;&#x8B66;&#x4E0E;&#x6F0F;&#x6D1E;&#x7684;&#x76F8;&#x5173;&#x6027;</h3><p>&#x8FD9;&#x4E00;&#x6B65;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x6F0F;&#x6D1E;&#x4E0E;&#x7279;&#x5B9A;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x3002;</p><h3 id="&#x8BA4;&#x8BC1;&#x5411;&#x91CF;&#x7684;&#x751F;&#x6210;">&#x8BA4;&#x8BC1;&#x5411;&#x91CF;&#x7684;&#x751F;&#x6210;</h3><p><img src="/2019/11/01/&#x6570;&#x636E;&#x6316;&#x6398;/2019-11-01-&#x6DF7;&#x5408;&#x544A;&#x8B66;&#x7BA1;&#x7406;&#x7B56;&#x7565;/vector.jpg"></p><p>&#x6839;&#x636E;&#x4E0A;&#x8868;&#x5F62;&#x6210;&#x4E00;&#x4E2A;01&#x5411;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x51FA;&#xFF1A; * &#x5168;1&#x5411;&#x91CF;&#xFF1A;&#x9AD8;&#x5174;&#x8DA3;&#x5EA6;&#x7684;&#x544A;&#x8B66; * 111100000&#x5411;&#x91CF;&#xFF1A;&#x53EF;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x4F4E;&#x5174;&#x8DA3;&#x5EA6;&#x7684;&#x5411;&#x91CF; * &#x7B2C;&#x4E8C;&#x4F4D;&#x4E3A;0&#x7684;&#x5411;&#x91CF;&#xFF1A;IP&#x4E0D;&#x5339;&#x914D;&#x90A3;&#x4E48;&#x544A;&#x8B66;&#x88AB;&#x820D;&#x5F03; * &#x7B2C;&#x4E00;&#x4F4D;&#x4E3A;0&#x7684;&#x5411;&#x91CF;&#xFF1A;&#x6839;&#x7EDD;&#x5176;&#x4ED6;&#x5C5E;&#x6027;&#x505A;&#x5339;&#x914D;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x751F;&#x6210;&#x5F02;&#x5E38;&#x8C03;&#x6574;&#x9608;&#x503C;</p><h3 id="&#x544A;&#x8B66;&#x4F18;&#x5148;&#x7EA7;">&#x544A;&#x8B66;&#x4F18;&#x5148;&#x7EA7;</h3><p>&#x4F18;&#x5148;&#x7EA7;&#x53D6;&#x51B3;&#x4E8E;&#x4EE5;&#x4E0B;&#x7684;&#x5F71;&#x54CD;&#x56E0;&#x5B50;&#xFF1A; * &#x6A21;&#x578B;&#x53EF;&#x4FE1;&#x5EA6;&#xFF1A;&#x7531;ArcSight&#xFF08;&#x8861;&#x91CF;&#x5A01;&#x80C1;&#x7B49;&#x7EA7;&#x7684;&#x516C;&#x5F0F;&#xFF09;&#x6765;&#x8FDB;&#x884C;&#x8BC4;&#x5224; * &#x76F8;&#x5173;&#x5EA6;&#xFF1A; * &#x4E25;&#x91CD;&#x7A0B;&#x5EA6; * &#x4E34;&#x754C;&#x7A0B;&#x5EA6;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&lt;a href=&quot;https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;amp;arnumber=8809121&amp;amp;tag=1&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;A hybrid alarm ma
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>logparser</title>
    <link href="http://www.liufr.com/2019/10/30/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-10-30-logparser/"/>
    <id>http://www.liufr.com/2019/10/30/数据挖掘/2019-10-30-logparser/</id>
    <published>2019-10-29T16:00:00.000Z</published>
    <updated>2019-11-20T01:38:58.030Z</updated>
    
    <content type="html"><![CDATA[<p>&#x6574;&#x7406;&#x7FFB;&#x8BD1;&#x81EA;<a href="https://logparser.readthedocs.io/en/latest/README.html" target="_blank" rel="noopener">logparser</a></p><h2 id="slct"><a href="http://www.quretec.com/u/vilo/edu/2003-04/DM_seminar_2003_II/ver1/P12/slct-ipom03-web.pdf" target="_blank" rel="noopener">SLCT</a></h2><p>SLCT&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x805A;&#x7C7B;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x53CD;&#x6620;&#x7684;&#x662F;&#x67D0;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x65E5;&#x5FD7;&#x51FA;&#x73B0;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#x3002;SLCT&#x53EF;&#x4EE5;&#x5BF9;&#x5DF2;&#x6709;&#x7684;&#x6B63;&#x5E38;&#x65E5;&#x5FD7;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x90A3;&#x4E9B;&#x65B0;&#x51FA;&#x73B0;&#x7684;&#x4E0D;&#x5C5E;&#x4E8E;&#x6B63;&#x5E38;&#x6A21;&#x5F0F;&#x7684;&#x65E5;&#x5FD7;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x8BCA;&#x65AD;&#x3002;</p><h3 id="&#x5355;&#x8BCD;&#x8868;&#x7684;&#x6784;&#x5EFA;">&#x5355;&#x8BCD;&#x8868;&#x7684;&#x6784;&#x5EFA;</h3><p>SLCT&#x4F1A;&#x626B;&#x63CF;&#x4E00;&#x904D;&#x65E5;&#x5FD7;&#x5E76;&#x4E14;&#x7EDF;&#x8BA1;&#x5355;&#x8BCD;&#x7684;&#x51FA;&#x73B0;&#x9891;&#x6B21;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8003;&#x8651;&#x5355;&#x8BCD;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;&#x4F8B;&#x5982;&quot;send&quot;&#x51FA;&#x73B0;&#x5728;log&#x65E5;&#x5FD7;&#x91CC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3001;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F4D;&#x7F6E;&#x662F;&#x5F53;&#x4F5C;&#x4E0D;&#x540C;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x53D6;&#x51FA;&#x9AD8;&#x9891;&#x8BCD;&#x3002;</p><h3 id="&#x805A;&#x7C7B;&#x7684;&#x6784;&#x5EFA;">&#x805A;&#x7C7B;&#x7684;&#x6784;&#x5EFA;</h3><p>SLCT&#x7B2C;&#x4E8C;&#x6B21;&#x626B;&#x63CF;log&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x6B21;&#x5173;&#x6CE8;&#x9AD8;&#x9891;&#x8BCD;&#x3002;&#x6240;&#x6709;&#x7684;&#x9AD8;&#x9891;&#x8BCD;&#x90FD;&#x4F1A;&#x88AB;&#x62BD;&#x53D6;&#x6210;&#x6A21;&#x677F;&#x3002;&#x7B26;&#x5408;&#x56FA;&#x5B9A;&#x6A21;&#x677F;&#x7684;&#x65E5;&#x5FD7;&#x4F1A;&#x88AB;&#x8BA1;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x805A;&#x4E3A;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#x3002;</p><h3 id="&#x65E5;&#x5FD7;&#x6A21;&#x677F;&#x7684;&#x62BD;&#x53D6;">&#x65E5;&#x5FD7;&#x6A21;&#x677F;&#x7684;&#x62BD;&#x53D6;</h3><p>SLCT&#x4F1A;&#x904D;&#x5386;&#x6240;&#x6709;&#x7684;&#x805A;&#x7C7B;&#x7ED3;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8BA1;&#x6570;&#x5927;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#x7684;&#x6240;&#x6709;&#x6A21;&#x677F;&#x8F93;&#x51FA;&#x3002;&#x4E0D;&#x6EE1;&#x8DB3;&#x6570;&#x91CF;&#x7684;&#x805A;&#x7C7B;&#x88AB;&#x89C6;&#x4F5C;&#x79BB;&#x7FA4;&#x7684;&#x7C7B;&#x3002;</p><h3 id="&#x805A;&#x7C7B;&#x7684;&#x96C6;&#x5408;">&#x805A;&#x7C7B;&#x7684;&#x96C6;&#x5408;</h3><p>&#x8FD9;&#x4E00;&#x6B65;&#x53EF;&#x9009;&#x3002;SLCT&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x662F;&#x5426;&#x6709;&#x5B50;&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x4E0E;&#x7236;&#x7C7B;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x3002;&#x5927;&#x6982;&#x7387;&#x5B50;&#x7C7B;&#x6BD4;&#x8F83;&#x8BE6;&#x7EC6;&#x5177;&#x4F53;&#xFF0C;&#x7236;&#x7C7B;&#x6BD4;&#x8F83;&#x7B3C;&#x7EDF;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x8981;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x805A;&#x7C7B;&#x7684;&#x7C92;&#x5EA6;&#x4ECE;&#x800C;&#x786E;&#x5B9A;&#x7ED3;&#x679C;&#x3002;</p><hr><h2 id="iplom">IPLoM</h2><p>&#x8FED;&#x4EE3;&#x5212;&#x5206;&#x65E5;&#x5FD7;&#x6316;&#x6398;&#xFF0C;&#x5229;&#x7528;&#x4E86;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x65E5;&#x5FD7;&#x4FE1;&#x606F;&#x7279;&#x5F81;&#x6765;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x5212;&#x5206;&#xFF0C;&#x56E0;&#x6B64;&#x6765;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x7684;&#x4FE1;&#x606F;&#x7C7B;&#x578B;&#x62BD;&#x53D6;&#x3002;</p><h3 id="&#x6839;&#x636E;&#x4E8B;&#x4EF6;&#x5927;&#x5C0F;&#x6765;&#x5212;&#x5206;">&#x6839;&#x636E;&#x4E8B;&#x4EF6;&#x5927;&#x5C0F;&#x6765;&#x5212;&#x5206;</h3><p>&#x65E5;&#x5FD7;&#x6839;&#x636E;&#x957F;&#x5EA6;&#x5212;&#x5206;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x522B;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x7684;&#x65E5;&#x5FD7;&#x957F;&#x5EA6;&#x662F;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x5904;&#x7406;&#x7684;&#x3002;</p><h3 id="&#x6839;&#x636E;token&#x7684;&#x4F4D;&#x7F6E;&#x6765;&#x5212;&#x5206;">&#x6839;&#x636E;token&#x7684;&#x4F4D;&#x7F6E;&#x6765;&#x5212;&#x5206;</h3><p>&#x5728;&#x4E0A;&#x4E00;&#x6B65;&#x7684;&#x5904;&#x7406;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x805A;&#x7C7B;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x957F;&#x5EA6;&#x4E3A;n&#x7684;m&#x6761;&#x65E5;&#x5FD7;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x805A;&#x7C7B;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x805A;&#x7C7B;&#x5C31;&#x53EF;&#x4EE5;&#x89C6;&#x4F5C;&#x4E00;&#x4E2A;m*n&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x8FD9;&#x6709;&#x524D;&#x63D0;&#x5047;&#x8BBE;&#x5C31;&#x662F;&#x6BCF;&#x6761;&#x65E5;&#x5FD7;&#x91CC;&#x7684;&#x5355;&#x8BCD;&#x90FD;&#x662F;&#x552F;&#x4E00;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#x7684;&#x5212;&#x5206;&#x3002;</p><h3 id="&#x901A;&#x8FC7;&#x641C;&#x7D20;&#x6620;&#x5C04;&#x6765;&#x5212;&#x5206;">&#x901A;&#x8FC7;&#x641C;&#x7D20;&#x6620;&#x5C04;&#x6765;&#x5212;&#x5206;</h3><p>&#x5728;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x4E24;&#x5217;&#x65E5;&#x5FD7;&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x88AB;&#x9009;&#x4F5C;&#x5212;&#x5206;&#x57FA;&#x51C6;&#x3002;&#x7EDF;&#x8BA1;&#x4E24;&#x5217;&#x4E2D;&#x4E92;&#x4E0D;&#x76F8;&#x540C;&#x5355;&#x8BCD;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4EE5;&#x53CA;&#x6700;&#x9AD8;&#x9891;&#x5355;&#x8BCD;&#x7684;&#x6570;&#x91CF;&#x3002;&#x56E0;&#x800C;&#x5B58;&#x5728;&#x56DB;&#x79CD;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#xFF1A;1&#x5BF9;1&#xFF0C;1&#x5BF9;&#x591A;&#xFF0C;&#x591A;&#x5BF9;1&#xFF0C;&#x591A;&#x5BF9;&#x591A;&#x3002;&#x4E24;&#x5217;&#x4E2D;&#x5305;&#x542B;&#x76F8;&#x540C;&#x7684;1&#x5BF9;1&#x5173;&#x7CFB;&#x7684;&#x65E5;&#x5FD7;&#x53EF;&#x4EE5;&#x88AB;&#x5212;&#x4E3A;&#x4E00;&#x7C7B;&#x3002;</p><h3 id="&#x62BD;&#x53D6;&#x65E5;&#x5FD7;&#x6A21;&#x677F;">&#x62BD;&#x53D6;&#x65E5;&#x5FD7;&#x6A21;&#x677F;</h3><p>&#x4E3B;&#x8981;&#x62BD;&#x53D6;&#x72EC;&#x6709;&#x7684;&#x5355;&#x8BCD;</p><hr><h2 id="lke">LKE</h2><h3 id="&#x65E5;&#x5FD7;&#x805A;&#x7C7B;">&#x65E5;&#x5FD7;&#x805A;&#x7C7B;</h3><p>&#x6709;&#x6743;&#x91CD;&#x7684;&#x7F16;&#x8F91;&#x8DDD;&#x79BB;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8861;&#x91CF;&#x4E24;&#x4E2A;&#x65E5;&#x5FD7;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;<span class="math inline">\(WED=\sum_{i=1}^{n}\frac{1}{1+e^{x_{i}-v}}\)</span>, n&#x662F;&#x7F16;&#x8F91;&#x8DDD;&#x79BB;&#xFF0C;<span class="math inline">\(x_i\)</span>&#x662F;&#x901A;&#x8FC7;&#x7B2C;i&#x6B21;&#x64CD;&#x4F5C;&#x8BCD;&#x7D22;&#x5F15;&#xFF0C;<span class="math inline">\(v\)</span>&#x662F;&#x63A7;&#x5236;&#x6743;&#x91CD;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x65E5;&#x5FD7;&#x7684;WED&#x5C0F;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#x90A3;&#x4E48;&#x5C31;&#x8BF4;&#x660E;&#x4E24;&#x4E2A;&#x65E5;&#x5FD7;&#x76F8;&#x8FDE;&#xFF0C;&#x5982;&#x6B64;&#x53EF;&#x4EE5;&#x89C6;&#x4F5C;&#x4E00;&#x79CD;&#x805A;&#x7C7B;&#x7ED3;&#x679C;&#x3002;</p><h3 id="&#x805A;&#x7C7B;&#x5212;&#x5206;">&#x805A;&#x7C7B;&#x5212;&#x5206;</h3><p>LKE&#x4F1A;&#x5BFB;&#x627E;&#x516C;&#x5171;&#x6700;&#x957F;&#x5E8F;&#x5217;&#xFF0C;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;LCS&#x7684;&#x957F;&#x5EA6;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x8D85;&#x8FC7;&#x9608;&#x503C;&#x4ECE;&#x800C;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x9700;&#x8981;&#x7EE7;&#x7EED;&#x5212;&#x5206;&#x3002;</p><h3 id="&#x65E5;&#x5FD7;&#x6A21;&#x677F;&#x62BD;&#x53D6;">&#x65E5;&#x5FD7;&#x6A21;&#x677F;&#x62BD;&#x53D6;</h3><p>&#x540C;&#x4E0A;</p><hr><h2 id="logsig">LogSig</h2><p>&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x57FA;&#x4E8E;&#x4FE1;&#x606F;&#x7684;signature&#x6765;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x7684;</p><h3 id="&#x751F;&#x6210;&#x5355;&#x8BCD;&#x5BF9;">&#x751F;&#x6210;&#x5355;&#x8BCD;&#x5BF9;</h3><p>&#x4F8B;&#x5982; &#x201C;Verification succeeded for blk_904791815409399662&#x201D; &#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x6210;&#x5982;&#x4E0B;&#x7684;&#x5355;&#x8BCD;&#x5BF9;: (Verification, succeeded), (Verification, for), (Verification, blk_904791815409399662), (succeeded, for), (succeeded, blk_904791815409399662), (for, blk_904791815409399662). &#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x5BF9;&#x90FD;&#x8981;&#x4FDD;&#x8BC1;&#x5176;&#x539F;&#x59CB;&#x7684;&#x5E8F;&#x5217;&#x3002;</p><h3 id="&#x805A;&#x7C7B;">&#x805A;&#x7C7B;</h3><p>&#x7528;&#x6237;&#x6765;&#x51B3;&#x5B9A;&#x805A;&#x7C7B;&#x7684;&#x6570;&#x91CF;k&#xFF0C;&#x6700;&#x521D;&#x662F;&#x968F;&#x673A;&#x5212;&#x5206;k&#x4E2A;&#x7C7B;&#xFF0C;&#x5728;&#x6BCF;&#x6B21;&#x805A;&#x7C7B;&#x7684;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x6839;&#x636E;&#x4E0A;&#x9762;&#x8BA1;&#x7B97;&#x7684;&#x5355;&#x8BCD;&#x5BF9;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x8C03;&#x6574;&#x5212;&#x5206;&#xFF0C;&#x76F4;&#x5230;&#x805A;&#x7C7B;&#x7ED3;&#x679C;&#x4E0D;&#x518D;&#x53D8;(&#x7C7B;&#x4F3C;k-means)</p><h3 id="&#x65E5;&#x5FD7;&#x6A21;&#x677F;&#x62BD;&#x53D6;-1">&#x65E5;&#x5FD7;&#x6A21;&#x677F;&#x62BD;&#x53D6;</h3><p>&#x5BF9;k&#x4E2A;&#x805A;&#x7C7B;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x62BD;&#x53D6;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x4E2D;&#x5355;&#x8BCD;&#x5927;&#x4E8E;&#x4E00;&#x534A;&#x6570;&#x91CF;&#x7684;&#x4F5C;&#x4E3A;&#x5019;&#x9009;&#x6837;&#x672C;&#x3002;&#x9009;&#x53D6;&#x8BCD;&#x9891;&#x6700;&#x9AD8;&#x7684;&#x4F5C;&#x4E3A;&#x6837;&#x672C;&#xFF0C;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&amp;#x6574;&amp;#x7406;&amp;#x7FFB;&amp;#x8BD1;&amp;#x81EA;&lt;a href=&quot;https://logparser.readthedocs.io/en/latest/README.html&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;l
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>时间循环一致性学习</title>
    <link href="http://www.liufr.com/2019/09/18/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-09-18-%E6%97%B6%E9%97%B4%E5%BE%AA%E7%8E%AF%E4%B8%80%E8%87%B4%E6%80%A7%E5%AD%A6%E4%B9%A0/"/>
    <id>http://www.liufr.com/2019/09/18/数据挖掘/2019-09-18-时间循环一致性学习/</id>
    <published>2019-09-17T16:00:00.000Z</published>
    <updated>2019-09-18T09:05:28.901Z</updated>
    
    <content type="html"><![CDATA[<p><a href="https://sites.google.com/view/temporal-cycle-consistency" target="_blank" rel="noopener">Temporal Cycle-Consistency Learning(CVPR&apos;19)</a></p><p>&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;TCC&#x7684;&#x65B9;&#x6CD5;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x89C6;&#x9891;&#x7684;&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#x635F;&#x5931;&#x627E;&#x5230;&#x4E0D;&#x540C;&#x89C6;&#x9891;&#x5E27;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x6700;&#x8FD1;&#x90BB;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x89C6;&#x9891;&#x5BF9;&#x9F50;&#x3002;</p><h2 id="&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x8868;&#x793A;&#x5B66;&#x4E60;">&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x8868;&#x793A;&#x5B66;&#x4E60;</h2><p>&#x4E3B;&#x8981;&#x8D21;&#x732E;&#x662F;&#x91C7;&#x7528;&#x4E86;&#x81EA;&#x76D1;&#x7763;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5B66;&#x4E60;&#x4E86;&#x4E00;&#x4E2A;&#x5D4C;&#x5165;&#x7A7A;&#x95F4;&#xFF08;embedding space&#xFF09;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x4E24;&#x4E2A;&#x76F8;&#x4F3C;&#x7684;&#x89C6;&#x9891;&#x5E8F;&#x5217;&#x53EF;&#x4EE5;&#x624D;&#x65F6;&#x95F4;&#x4E0A;&#x8FDB;&#x884C;&#x5BF9;&#x9F50;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x5D4C;&#x5165;&#x5F0F;&#x7A7A;&#x95F4;&#x91CC;&#x5C06;&#x4E24;&#x4E2A;&#x5E8F;&#x5217;&#x4E0A;&#x6700;&#x77ED;&#x8DDD;&#x79BB;&#x7684;&#x70B9;&#x4E00;&#x5BF9;&#x4E00;&#x8FDE;&#x63A5;&#x540E;&#x7684;&#x6570;&#x91CF;&#x6700;&#x5927;&#x5316;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x6837;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x672C;&#x6587;&#x901A;&#x8FC7;&#x5C06;&#x4E24;&#x4E2A;&#x5E8F;&#x5217;&#x4E2D;&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5E27;&#x7684;&#x6570;&#x91CF;&#x6700;&#x5927;&#x5316;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><p><img src="/2019/09/18/&#x6570;&#x636E;&#x6316;&#x6398;/2019-09-18-&#x65F6;&#x95F4;&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#x5B66;&#x4E60;/TCC.jpg"></p><p>&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x662F;&#x79BB;&#x6563;&#x4E0D;&#x53EF;&#x5FAE;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x4F7F;&#x7528;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x5728;&#x5D4C;&#x5165;&#x5F0F;&#x7A7A;&#x95F4;&#x91CC;&#x8FDB;&#x884C;&#x5B66;&#xFF0C;&#x672C;&#x6587;&#x63D0;&#x51FA;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x635F;&#x5931;&#xFF08;cycle-consistency loss&#xFF09;&#xFF0C;&#x4E0B;&#x4E00;&#x8282;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;</p><p>&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x5E27;<span class="math inline">\(s_i\)</span>&#xFF0C;&#x5D4C;&#x5165;&#x8868;&#x8FBE;&#xFF08;embedding&#xFF09;&#x4E3A;<span class="math inline">\(u_i=\phi(s_i;\theta)\)</span>&#xFF0C;&#x5176;&#x4E2D;<span class="math inline">\(\phi\)</span>&#x662F;&#x4EE5;<span class="math inline">\(\theta\)</span>&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;encoder&#x3002;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684;&#x4E24;&#x4E2A;&#x89C6;&#x9891;&#x5E8F;&#x5217;<span class="math inline">\(S,T\)</span>&#xFF0C;&#x957F;&#x5EA6;&#x5206;&#x522B;&#x4E3A;<span class="math inline">\(N,M\)</span>&#xFF0C;embedding&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x8BA1;&#x7B97;&#x4E3A;<span class="math inline">\(U={u_1,u_2,...,u_N}\)</span>&#x548C;<span class="math inline">\(V={v_1,v_2,...v_M}\)</span>,&#x5176;&#x4E2D;&#x6709;<span class="math inline">\(u_i=\phi(s_i;\theta),v_i=\phi(t_i;\theta)\)</span></p><h3 id="&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;">&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;</h3><p>&#x5982;&#x679C;<span class="math inline">\(u_i\in U\)</span>&#x5BF9;&#x4E8E;<span class="math inline">\(v_j=arg\ min_{v\in V}||u_i-v||\)</span>&#xFF0C;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x8FC7;&#x7A0B;&#xFF0C;&#x5BF9;&#x4E8E;<span class="math inline">\(v_j\)</span>&#x627E;&#x5230;&#x6709;<span class="math inline">\(u_k=arg\ min_{u\in U}||v_j-u||\)</span>&#x3002;&#x5982;&#x679C;<span class="math inline">\(i==k\)</span>&#x90A3;&#x4E48;&#x5C31;&#x8BF4;&#x660E;&#x5B58;&#x5728;&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#x56FE;2&#x7ED9;&#x51FA;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6700;&#x597D;&#x7684;&#x5D4C;&#x5165;&#x7A7A;&#x95F4;&#x5C31;&#x662F;&#x80FD;&#x6709;&#x6700;&#x591A;&#x5339;&#x914D;&#x7684;&#x70B9;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p><h3 id="&#x53CD;&#x5411;&#x5FAA;&#x73AF;&#x5206;&#x7C7B;cycle-back-classification">&#x53CD;&#x5411;&#x5FAA;&#x73AF;&#x5206;&#x7C7B;&#xFF08;cycle-back Classification&#xFF09;</h3><p>&#x4E3A;&#x4E86;&#x786E;&#x5B9A;<span class="math inline">\(u_i\)</span>&#x7684;&#x6700;&#x8FD1;&#x90BB;<span class="math inline">\(\tilde{v}\)</span>&#xFF08;soft nearest neighbor&#xFF09;&#xFF0C;&#x4F7F;&#x7528;softmax&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E00;&#x5E27;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x5339;&#x914D;&#x5E27;&#x4E3A;1&#xFF0C;&#x5176;&#x4ED6;&#x5747;&#x4E3A;0&#x3002;</p><p><span class="math display">\[\tilde{v} = \sum_j^M\alpha_jv_j, \ where \ \alpha_j=\frac{e^{-||u_i-v_j||^2}}{\sum_k^Me^{-||u_i-v_k||^2}}\]</span></p><p>&#x5176;&#x4E2D;<span class="math inline">\(\alpha\)</span>&#x662F;&#x76F8;&#x4F3C;&#x6027;&#x5206;&#x5E03;&#x6982;&#x7387;&#xFF0C;&#x4EA4;&#x53C9;&#x71B5;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A; <span class="math display">\[L_{abc} = -\sum_j^Ny_jlog(\hat{y_j})\]</span></p><h3 id="&#x53CD;&#x5411;&#x5FAA;&#x73AF;&#x56DE;&#x5F52;cycle-back-regression">&#x53CD;&#x5411;&#x5FAA;&#x73AF;&#x56DE;&#x5F52;&#xFF08;cycle-back Regression&#xFF09;</h3><p>&#x5C3D;&#x7BA1;&#x4E0A;&#x9762;&#x7684;Classification&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7528;&#x4F5C;&#x5B66;&#x4E60;&#xFF0C;&#x4F46;&#x662F;&#x635F;&#x5931;&#x51FD;&#x6570;&#x65E0;&#x6CD5;&#x76F4;&#x89C2;&#x611F;&#x53D7;&#x5FAA;&#x73AF;&#x56DE;&#x6765;&#x540E;&#x7684;&#x8DDD;&#x79BB;&#x7ED3;&#x679C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6CA1;&#x6CD5;&#x8861;&#x91CF;cycle-back&#x56DE;&#x6765;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x4E0E;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x8FDC;&#x8FD1;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x70B9;&#x5728;&#x5411;&#x56DE;&#x5FAA;&#x73AF;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x53CA;&#x65F6;&#x627E;&#x5230;&#x5408;&#x7406;&#x7684;&#x5E27;&#xFF0C;&#x90A3;&#x4E48;&#x60E9;&#x7F5A;&#x5E94;&#x8BE5;&#x662F;&#x8F83;&#x5C0F;&#x7684;&#x3002;&#x672C;&#x6587;&#x63D0;&#x51FA;&#x53CD;&#x5411;&#x5FAA;&#x73AF;&#x56DE;&#x5F52;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;</p><p><img src="/2019/09/18/&#x6570;&#x636E;&#x6316;&#x6398;/2019-09-18-&#x65F6;&#x95F4;&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#x5B66;&#x4E60;/TCC-Regression.jpg"></p><p>&#x9664;&#x4E86;&#x50CF;&#x4E0A;&#x6587;&#x4E00;&#x6837;&#x8BA1;&#x7B97;&#x6700;&#x8FD1;&#x90BB;<span class="math inline">\(\tilde{v}\)</span>&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x8981;&#x8BA1;&#x7B97;&#x76F8;&#x4F3C;&#x6027;&#x5411;&#x91CF; <span class="math display">\[\beta_k=\frac{e^{-||\tilde{v}-u_k||^2}}{\sum_j^Ne^{-||\tilde{v}_i-u_j||^2}}\]</span></p><p>&#x589E;&#x52A0;&#x7684;&#x7EA6;&#x675F;&#x4E3A;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x70B9;&#x9644;&#x8FD1;&#x6709;&#x4E00;&#x4E2A;&#x6CE2;&#x5CF0;&#xFF08;Peak&#xFF09;&#x5B9A;&#x4E49;Loss&#x4E3A; <span class="math display">\[L{cbr}=\frac{|i-\mu|^2}{\sigma^2} + \lambda\ log(\sigma)\]</span> &#x5176;&#x4E2D;<span class="math inline">\(\mu=\sum_k^N\beta_k*k, \sigma^2=\sum_k^N\beta_k*(k-\mu)^2, \lambda\)</span> &#x662F;&#x6B63;&#x5219;&#x5316;&#x7684;&#x6743;&#x91CD;&#x53C2;&#x6570;</p><h2 id="&#x5BF9;&#x4E8E;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7684;&#x5E94;&#x7528;&#x601D;&#x8003;">&#x5BF9;&#x4E8E;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7684;&#x5E94;&#x7528;&#x601D;&#x8003;</h2><p><img src="/2019/09/18/&#x6570;&#x636E;&#x6316;&#x6398;/2019-09-18-&#x65F6;&#x95F4;&#x5FAA;&#x73AF;&#x4E00;&#x81F4;&#x6027;&#x5B66;&#x4E60;/TCC-Anomaly.jpg"></p><p>&#x7528;TCC&#x6765;&#x505A;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x7528;&#x4F5C;&#x6BD4;&#x5BF9;&#x7684;&#x5E8F;&#x5217;&#x4E0E;&#x5F53;&#x524D;&#x5E8F;&#x5217;&#x8981;&#x6709;&#x76F8;&#x4F3C;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x5173;&#x7CFB;&#x624D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x9759;&#x6001;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8DDF;&#x540E;&#x5411;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x524D;&#x5411;&#x8BA1;&#x7B97;&#xFF08;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF0C;&#x6700;&#x7406;&#x60F3;&#x662F;&#x6BD4;&#x5BF9;&#x5230;&#x9AD8;&#x65AF;&#x7684;&#x6CE2;&#x5CF0;&#x4F4D;&#x7F6E;&#xFF09;&#xFF0C;&#x597D;&#x5728;&#x5BF9;&#x4E8E;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x6765;&#x8BF4;&#xFF0C;&#x4E0D;&#x9700;&#x8981;embedding&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x9700;&#x8981;&#x4E0B;&#x91C7;&#x6837;&#x6765;&#x66FF;&#x4EE3;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;</p><p>&#x63A5;&#x4E0B;&#x6765;&#x6253;&#x7B97;&#x5F00;&#x6E90;&#x7801;+TCC&#x5B9E;&#x73B0;&#x65F6;&#x5E8F;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x770B;&#x770B;&#x6548;&#x679C;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&lt;a href=&quot;https://sites.google.com/view/temporal-cycle-consistency&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;Temporal Cycle-Consistency Learning(CVP
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
      <category term="CVPR" scheme="http://www.liufr.com/tags/CVPR/"/>
    
  </entry>
  
  <entry>
    <title>时间注意力模型下的时序预测</title>
    <link href="http://www.liufr.com/2019/09/12/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-09-12-%E6%97%B6%E9%97%B4%E6%B3%A8%E6%84%8F%E5%8A%9B%E6%A8%A1%E5%9E%8B%E4%B8%8B%E7%9A%84%E6%97%B6%E5%BA%8F%E9%A2%84%E6%B5%8B/"/>
    <id>http://www.liufr.com/2019/09/12/数据挖掘/2019-09-12-时间注意力模型下的时序预测/</id>
    <published>2019-09-11T16:00:00.000Z</published>
    <updated>2019-09-17T13:28:34.676Z</updated>
    
    <content type="html"><![CDATA[<p>Multi-Horizon Time Series Forecasting with Temporal Attention Learning(KDD&apos; 19)</p><p>&#x6587;&#x7AE0;&#x9610;&#x8FF0;&#x4E86;&#x5386;&#x53F2;&#x4FE1;&#x606F;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6A21;&#x5F0F;&#x5BF9;&#x957F;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x7684;&#x9884;&#x6D4B;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x4E2D;&#x624B;&#x52A8;&#x8BBE;&#x7F6E;&#x65F6;&#x95F4;&#x4F9D;&#x8D56;&#x4ECE;&#x800C;&#x63A2;&#x7D22;&#x76F8;&#x5173;&#x7684;&#x65F6;&#x5E8F;&#x6A21;&#x5F0F;&#x662F;&#x5F88;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#xFF0C;&#x672C;&#x6587;&#x7528;DNN&#x7684;&#x65B9;&#x6CD5;&#x63D0;&#x51FA;&#x4E86;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x591A;&#x89C6;&#x754C;&#x6A21;&#x578B;&#x6765;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF0C;&#x4ECE;&#x65F6;&#x95F4;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x4E0A;&#x6765;&#x66F4;&#x597D;&#x5730;&#x6355;&#x83B7;&#x5386;&#x53F2;&#x6570;&#x636E;&#x7684;&#x6F5C;&#x5728;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD8;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x591A;&#x6A21;&#x578B;&#x7684;&#x878D;&#x5408;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x7ED3;&#x5408;&#x4E0D;&#x540C;&#x5386;&#x53F2;&#x6570;&#x636E;&#x7684;&#x7279;&#x5F81;&#x6765;&#x66F4;&#x597D;&#x5730;&#x9884;&#x6D4B;&#x3002;</p><p>multi-horizon&#x4EE3;&#x8868;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;&#x5728;&#x672A;&#x6765;&#x65F6;&#x95F4;&#x5185;&#x8FDB;&#x884C;&#x591A;&#x6B65;&#x9884;&#x6D4B;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x8D44;&#x6E90;&#x89C4;&#x5212;&#x7684;&#x9884;&#x6D4B;&#x4EE5;&#x53CA;&#x51B3;&#x7B56;&#x3002;&#x8FD9;&#x5BF9;LSTM&#x63D0;&#x51FA;&#x4E86;&#x6311;&#x6218;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x524D;&#x7684;&#x8F93;&#x5165;&#x6E90;&#x4E8E;&#x5386;&#x53F2;&#x4FE1;&#x606F;&#x548C;&#x672A;&#x6765;&#x52A8;&#x6001;&#x8F93;&#x5165;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x53EF;&#x4EE5;&#x7CBE;&#x786E;&#x9884;&#x6D4B;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BF9;&#x6F5C;&#x5728;&#x6A21;&#x578B;&#x7684;&#x9002;&#x5F53;&#x8868;&#x793A;&#x4EE5;&#x53CA;&#x5386;&#x53F2;&#x6570;&#x636E;&#x65F6;&#x95F4;&#x6A21;&#x5F0F;&#x7684;&#x53C2;&#x7167;&#x3002;</p><h2 id="&#x65B9;&#x6CD5;">&#x65B9;&#x6CD5;</h2><h3 id="&#x57FA;&#x7840;&#x7F16;&#x7801;-&#x89E3;&#x7801;&#x7ED3;&#x6784;">&#x57FA;&#x7840;&#x7F16;&#x7801;-&#x89E3;&#x7801;&#x7ED3;&#x6784;</h3><p>&#x91C7;&#x7528;&#x7684;&#x662F;seq2seq&#x6D41;&#x6C34;&#x7EBF;&#x7ED3;&#x6784;&#x6765;&#x7F16;&#x7801;&#x5386;&#x53F2;/&#x672A;&#x6765;&#x7684;&#x8F93;&#x5165;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x7801;&#x7528;&#x4E8E;&#x672A;&#x6765;&#x7684;&#x9884;&#x6D4B;</p><p><img src="/2019/09/12/&#x6570;&#x636E;&#x6316;&#x6398;/2019-09-12-&#x65F6;&#x95F4;&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;&#x4E0B;&#x7684;&#x65F6;&#x5E8F;&#x9884;&#x6D4B;/Multi-Horizon.jpg"></p><p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x7F16;&#x7801;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x4E24;&#x5C42;&#x7684;LSTM&#x67B6;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5386;&#x53F2;&#x4FE1;&#x606F;&#x5339;&#x914D;&#x5230;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x4E0A;&#x4E00;&#x5C42;&#x7684;<span class="math inline">\(h_{t-1}\)</span>&#x3002;&#x5176;&#x4E2D;<span class="math inline">\(x_t\)</span>&#x4EE3;&#x8868;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x4E2D;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x9690;&#x85CF;&#x5C42;&#x5C31;&#x662F;<span class="math inline">\(h_t\)</span>&#xFF0C;&#x5185;&#x90E8;&#x7684;&#x95E8;(gate cell)&#x5C31;&#x662F;<span class="math inline">\(i_t,f_t,o_t,c_t\)</span> <span class="math display">\[\begin{array}{l}{i_{t}=\sigma\left(W_{i x} x_{t}+W_{i m} m_{t-1}\right)} \\ {f_{t}=\sigma\left(W_{f x} x_{t}+W_{f m} m_{t-1}\right)} \\ {o_{t}=\sigma\left(W_{o x} x_{t}+W_{o m} m_{t-1}\right)} \\ {c_{t}=f_{t} \cdot c_{t-1}+i_{t} \cdot \tanh \left(W_{c x} x_{t}+W_{c m} m_{t-1}\right)} \\ {h_{t}=o_{t} \cdot \tanh \left(c_{t}\right)}\end{array}\]</span></p><p>&#x4E0A;&#x8FF0;&#x590D;&#x6742;&#x7684;&#x516C;&#x5F0F;&#x7B80;&#x5199;&#x6210;<span class="math inline">\(h_t^e=LSTM^e(x_t;h_{t-1})\)</span>, &#x5176;&#x4E2D;<span class="math inline">\(e\)</span>&#x5C31;&#x8868;&#x793A;&#x5728;&#x9690;&#x542B;&#x5C42;&#x4E2D;&#x5DF2;&#x7ECF;&#x7ECF;&#x8FC7;&#x4E86;&#x7F16;&#x7801;&#x3002;</p><p>&#x89E3;&#x7801;&#x5668;&#x5C31;&#x662F;&#x5C06;&#x7F16;&#x7801;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x5F53;&#x4F5C;&#x8F93;&#x5165;&#x7684;&#x521D;&#x59CB;&#x72B6;&#x6001;&#xFF0C;&#x672A;&#x6765;&#x7684;&#x4FE1;&#x606F;&#x4E5F;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x751F;&#x6210;&#x672A;&#x6765;&#x5E8F;&#x5217;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8F93;&#x51FA;&#x3002;&#x89E3;&#x7801;&#x5668;&#x8BBE;&#x8BA1;&#x6210;&#x4E00;&#x4E2A;&#x53CC;&#x5411;LSTM&#x7F51;&#x7EDC;&#xFF0C;&#x53EF;&#x4EE5;&#x6B63;&#x5411;&#x548C;&#x9006;&#x5411;&#x4F20;&#x64AD;&#x672A;&#x6765;&#x7684;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x524D;&#x5411;&#x548C;&#x540E;&#x5411;&#x7684;&#x8F93;&#x5165;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x672A;&#x6765;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x4E2D;&#x89C2;&#x5BDF;&#x5F97;&#x5230;&#x3002;BiLSTM&#x7684;&#x9690;&#x542B;&#x5C42;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x57DF;&#x4E0A;&#x7684;&#x5377;&#x79EF;&#x5C42;&#x6765;&#x8FDB;&#x884C;&#x6700;&#x540E;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x6211;&#x4EEC;&#x5F3A;&#x8C03;&#x8BF4;&#x6700;&#x540E;&#x7684;&#x9884;&#x6D4B;&#x5E94;&#x8BE5;&#x662F;&#x5728;BiLSTM&#x4FE1;&#x606F;&#x4F20;&#x64AD;&#x540E;&#x6765;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x4FE1;&#x606F;&#x4F20;&#x64AD;&#x72B6;&#x6001;&#x548C;&#x4FE1;&#x606F;&#x9884;&#x6D4B;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x5206;&#x79BB;&#xFF0C;&#x9632;&#x6B62;&#x5728;&#x4E00;&#x4E2A;&#x957F;&#x89C6;&#x754C;&#xFF08;long horizon&#xFF09;&#x4E2D;&#x9519;&#x8BEF;&#x7684;&#x7D2F;&#x52A0;&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x4E2D;&#x524D;&#x5411;&#x548C;&#x540E;&#x5411;&#x7684;&#x4FE1;&#x606F;&#x4F20;&#x64AD;&#x662F;&#x5206;&#x79BB;&#x7684;&#x3002;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[\begin{aligned} h_{t}^{f} &amp;=L S T M^{f}\left(x_{t} ; h_{t-1}\right) \\ h_{t}^{b} &amp;=L S T M^{b}\left(x_{t} ; h_{t+1}\right) \\ h_{t} &amp;=\left[h_{t}^{f} ; h_{t}^{b}\right] \end{aligned}\]</span></p><p>&#x4E0A;&#x5F0F;&#x53EF;&#x4EE5;&#x7EFC;&#x5408;&#x5199;&#x6210;<span class="math inline">\(h_t^d = BiLSTM^d(x_t;h_{t-1},h_{t+1})\)</span>&#xFF0C;&#x4E3A;&#x4E86;&#x4ECE;&#x9690;&#x542B;&#x5C42;&#x751F;&#x6210;&#x5206;&#x4F4D;&#x6570;&#x7684;&#x9884;&#x6D4B;&#xFF0C;&#x6211;&#x4EEC;&#x52A0;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x5C42;&#xFF0C;&#x5728;&#x7F16;&#x7801;&#x89E3;&#x7801;&#x5C42;&#x7684;K&#x7EF4;&#x5206;&#x4F4D;&#x6570;&#x9884;&#x6D4B;&#x5219;&#x4E3A; <span class="math display">\[\begin{aligned} y_{t}^{e} &amp;=W_{e} h_{t}^{e}+b_{e} \\ y_{t}^{d} &amp;=W_{d} h_{t}^{d}+b_{d}  \end{aligned}\]</span></p><h3 id="embedding">Embedding</h3><p>&#x901A;&#x8FC7;Embedding&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x5C06;&#x660E;&#x786E;&#x7684;&#x53D8;&#x91CF;&#x6620;&#x5C04;&#x4E3A;&#x6570;&#x4E2A;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x91C7;&#x7528;one-hot&#x7F16;&#x7801;&#x4EE3;&#x8868;<span class="math inline">\(|C|\)</span>&#x53D8;&#x91CF;<span class="math inline">\(x_c=\{0...010...0\}\in R^{|C|}\)</span>&#xFF0C;&#x5B66;&#x4E60;&#x7684;&#x5D4C;&#x5165;&#x5F0F;&#x77E9;&#x9635;<span class="math inline">\(W_c\in R^{D*|C|}\)</span>&#xFF0C;&#x53D8;&#x5316;&#x540E;&#x7684;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x7531;<span class="math inline">\(x_c&apos;=W_cx_c\)</span>&#x8BA1;&#x7B97;&#x5F97;&#x3002;</p><h3 id="&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;">&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;</h3><p>&#x7F16;&#x7801;&#x89E3;&#x7801;&#x6A21;&#x578B;&#x7531;&#x4E8E;&#x5185;&#x5B58;&#x7684;&#x66F4;&#x65B0;&#x5F88;&#x96BE;&#x6355;&#x83B7;&#x957F;&#x671F;&#x7684;&#x8BB0;&#x5FC6;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A; <img src="/2019/09/12/&#x6570;&#x636E;&#x6316;&#x6398;/2019-09-12-&#x65F6;&#x95F4;&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;&#x4E0B;&#x7684;&#x65F6;&#x5E8F;&#x9884;&#x6D4B;/multi-scale.jpg"> &#x6700;&#x4E0B;&#x5C42;&#x7684;&#x662F;&#x5386;&#x53F2;&#x7F16;&#x7801;&#x6A21;&#x5757;&#xFF0C;&#x6700;&#x4E0A;&#x5C42;&#x662F;&#x4E00;&#x4E2A;BiLSTM&#x7684;&#x672A;&#x6765;&#x89E3;&#x7801;&#x6A21;&#x5757;&#xFF0C;&#x6587;&#x7AE0;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x591A;&#x6A21;&#x578B;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x673A;&#x5236;&#xFF0C;&#x4ED6;&#x7531;&#x6BCF;&#x6B21;&#x672A;&#x6765;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x4E2D;&#x7684;BiLSTM&#x7684;&#x9690;&#x85CF;&#x5C42;&#x5F15;&#x5BFC;&#xFF0C;&#x5E76;&#x4E14;&#x878D;&#x5408;&#x4E0D;&#x540C;&#x7684;&#x6743;&#x91CD;&#x5E94;&#x7528;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5386;&#x53F2;&#x6570;&#x636E;&#x4E2D;</p><p><strong>&#x65F6;&#x95F4;&#x6CE8;&#x610F;&#x529B;</strong></p><p>&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x5168;&#x4F53;&#x7684;&#x5386;&#x53F2;&#x6570;&#x636E;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x592A;&#x957F;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6A21;&#x7CCA;&#x6389;&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x4E14;&#x8BA1;&#x7B97;&#x4E0D;&#x591F;&#x6709;&#x6548;&#x7387;&#x3002;&#x6587;&#x7AE0;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x5206;&#x79BB;&#x6027;&#x6CE8;&#x610F;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x4E0B;&#x7684;&#x5386;&#x53F2;&#x6570;&#x636E;&#x5E76;&#x5C06;&#x5176;&#x7ED3;&#x5408;&#x5230;&#x591A;&#x5F62;&#x6001;&#x878D;&#x5408;&#x7684;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x957F;&#x5EA6;&#x53EF;&#x4EE5;&#x7531;&#x4EBA;&#x4E3A;&#x8BBE;&#x5B9A;&#x3002;&#x65F6;&#x95F4;&#x6CE8;&#x610F;&#x529B;&#x7684;&#x6743;&#x91CD;<span class="math inline">\(\gamma_{1:T_h}\)</span>&#x53EF;&#x4EE5;&#x8868;&#x8FF0;&#x4E3A; <span class="math display">\[\begin{array}{c}{\mathbf{g}=\mathbf{v}_{g}^{\top} \tanh \left(\mathbf{W}_{g} \mathbf{s}_{t}+\mathbf{V}_{g} \mathbf{h}+\mathbf{b}_{g}\right)} \\ {\gamma_{i}=\frac{\exp \left(g_{i}\right)}{\sum_{j=1}^{T_{h}} \exp \left(g_{j}\right)} \quad \text { for } i=1 \ldots T_{h}}\end{array}\]</span></p><p>&#x7136;&#x540E;&#x52A0;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x5411;&#x91CF;<span class="math inline">\(c_t\)</span>&#x548C;transformer<span class="math inline">\(d_t\)</span>&#x4E3A;&#xFF1A; <span class="math display">\[\begin{aligned} \mathbf{c}_{t} &amp;=\sum_{i=1}^{T_{h}} \gamma_{i} \mathbf{h}_{i} \\ \mathbf{d}_{t} &amp;=\operatorname{ReLU}\left(\mathbf{W}_{d} \mathbf{c}_{t}+\mathbf{b}_{d}\right) \end{aligned}\]</span></p><p><strong>&#x591A;&#x5F62;&#x6001;&#x878D;&#x5408;</strong></p><p>&#x56FE;3 &#x7ED9;&#x51FA;&#x7684;&#x662F;M=2&#x7684;&#x878D;&#x5408;&#x7ED3;&#x679C;&#xFF0C; <span class="math display">\[\begin{array}{l}{\mathbf{p}_{t}^{m}=\mathbf{v}_{p}^{\top} \tanh \left(\mathbf{W}_{p} \mathbf{s}_{t}+\mathbf{V}_{p}^{m} \mathbf{d}_{t}^{m}+\mathbf{b}_{p}\right)} \\ {\phi_{t}^{m}=\frac{\exp \left(p_{t}^{m}\right)}{\sum_{k=1}^{M} \exp \left(p_{t}^{k}\right)} \quad \text { for } m=1 \ldots M}\end{array}\]</span></p><p>&#x878D;&#x5408;&#x540E;&#x7684;&#x77E5;&#x8BC6;&#x5E93;<span class="math inline">\(x_t\)</span>&#x53EF;&#x4EE5;&#x7531;<span class="math inline">\(d_t^m\)</span>&#x7684;&#x52A0;&#x548C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x7ED9;&#x51FA;</p><p><span class="math display">\[x_t=\sum_{m=1}^M\phi_t^md_t^m\]</span></p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;Multi-Horizon Time Series Forecasting with Temporal Attention Learning(KDD&amp;apos; 19)&lt;/p&gt;
&lt;p&gt;&amp;#x6587;&amp;#x7AE0;&amp;#x9610;&amp;#x8FF0;&amp;#x4E86;&amp;#x53
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
      <category term="time series" scheme="http://www.liufr.com/tags/time-series/"/>
    
      <category term="KDD" scheme="http://www.liufr.com/tags/KDD/"/>
    
  </entry>
  
  <entry>
    <title>多维时序无监督异常检测</title>
    <link href="http://www.liufr.com/2019/09/09/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-09-09-DNN%E5%A4%9A%E7%BB%B4%E6%97%B6%E5%BA%8F%E6%97%A0%E7%9B%91%E7%9D%A3%E5%BC%82%E5%B8%B8%E6%A3%80%E6%B5%8B/"/>
    <id>http://www.liufr.com/2019/09/09/数据挖掘/2019-09-09-DNN多维时序无监督异常检测/</id>
    <published>2019-09-08T16:00:00.000Z</published>
    <updated>2019-09-17T13:29:36.391Z</updated>
    
    <content type="html"><![CDATA[<p>A Deep Neural Network for Unsupervised Anomaly Detectionand Diagnosisin Multivariate Time Series Data</p><h2 id="&#x8D21;&#x732E;">&#x8D21;&#x732E;</h2><ul><li>&#x5F62;&#x5F0F;&#x5316;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x5230;&#x4E09;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x4E0A;&#xFF1A;<ul><li>&#x5F02;&#x5E38;&#x68C0;&#x6D4B;</li><li>&#x6839;&#x56E0;&#x5B9A;&#x4F4D;</li><li>&#x5F02;&#x5E38;&#x4E25;&#x91CD;&#x6027;&#x89E3;&#x91CA;</li></ul></li><li>&#x63D0;&#x51FA;&#x4E86;&#x7CFB;&#x7EDF;&#x7B7E;&#x540D;&#x77E9;&#x9635;&#xFF08;system signature matrix&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x7528;MSCRED&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x7F16;&#x7801;&#x5668;&#x6765;&#x7F16;&#x7801;tensor&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x57FA;&#x4E8E;&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;&#x7684;ConvLSTM&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x7684;&#x6A21;&#x578B;&#x3002;&#x8BE5;&#x6A21;&#x578B;&#x9996;&#x6B21;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x95EE;&#x9898;</li><li>&#x6027;&#x80FD;&#x8D85;&#x8D8A;baseline</li></ul><h2 id="mscred-&#x6846;&#x67B6;">MSCRED &#x6846;&#x67B6;</h2><p>Multi-Scale Convolutional Recurrent Encoder-Decoder</p><p>&#x5927;&#x4F53;&#x601D;&#x8DEF;&#xFF1A; 1. &#x751F;&#x6210;&#x591A;&#x5C3A;&#x5EA6;&#x7684;&#x7CFB;&#x7EDF;&#x7B7E;&#x540D;&#x77E9;&#x9635; 2. &#x901A;&#x8FC7;&#x5377;&#x79EF;&#x7F16;&#x7801;&#x5668;&#x628A;&#x7A7A;&#x95F4;&#x4FE1;&#x606F;&#x7F16;&#x7801;&#x5230;&#x7B7E;&#x540D;&#x77E9;&#x9635;&#x4E2D; 3. &#x628A;&#x65F6;&#x95F4;&#x4FE1;&#x606F;&#x7F16;&#x7801;&#x5230;ConvLSTM&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;&#x4E2D; 4. &#x6839;&#x636E;&#x5377;&#x79EF;&#x89E3;&#x7801;&#x5668;&#x91CD;&#x6784;&#x7B7E;&#x540D;&#x77E9;&#x9635;&#xFF0C;&#x5229;&#x7528;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x6765;&#x8FDB;&#x884C;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5B66;&#x4E60;</p><h3 id="&#x4F7F;&#x7528;&#x7B7E;&#x540D;&#x77E9;&#x9635;&#x63CF;&#x8FF0;&#x72B6;&#x6001;">&#x4F7F;&#x7528;&#x7B7E;&#x540D;&#x77E9;&#x9635;&#x63CF;&#x8FF0;&#x72B6;&#x6001;</h3><p>&#x5BF9;&#x4E8E;&#x65F6;&#x95F4;&#x6BB5;<span class="math inline">\(t-w\)</span> &#x5230; <span class="math inline">\(t\)</span> &#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x4E24;&#x4E2A;&#x65F6;&#x5E8F;<span class="math inline">\(x_i^w =(x_i^{t-w},x_i^{t-w-1},...,x_i^t)\)</span> &#x4E0E; <span class="math inline">\(x_j^w =(x_j^{t-w},x_j^{t-w-1},...,x_j^t)\)</span>&#xFF0C;&#x8054;&#x5408;&#x8BA1;&#x7B97; <span class="math display">\[m_{ij}^t = \frac{sum_{\delta=0}^\omega x_i^{t-\delta}x_j^{t-\delta}}{K}\]</span> &#x5176;&#x4E2D;<span class="math inline">\(K\)</span>&#x4F5C;&#x4E3A;&#x7F29;&#x653E;&#x56E0;&#x5B50;&#x3002;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x53EF;&#x4EE5;&#x8861;&#x91CF;&#x76F8;&#x4F3C;&#x6027;&#x4E14;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x9C81;&#x68D2;&#x6027;&#xFF0C;&#x6709;<span class="math inline">\(m\)</span>&#x6784;&#x6210;&#x5B8C;&#x5168;&#x77E9;&#x9635;<span class="math inline">\(M\)</span></p><h3 id="&#x5377;&#x79EF;&#x4E0B;&#x7684;&#x7F16;&#x7801;&#x5668;">&#x5377;&#x79EF;&#x4E0B;&#x7684;&#x7F16;&#x7801;&#x5668;</h3><p>&#x9996;&#x5148;&#x5C06;<span class="math inline">\(M^t\)</span>&#x7528;&#x4E0D;&#x540C;&#x5C3A;&#x5EA6;&#x8FDE;&#x63A5;&#x6210;tensor <span class="math inline">\(\chi^{t,0}\in \mathbb{R}^{n*n*s}\)</span> &#x7136;&#x540E;&#x518D;&#x4F20;&#x5165;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x524D;&#x540E;&#x4E24;&#x5C42;&#x7684;&#x901A;&#x8FC7;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x8FDE;&#x63A5; <span class="math display">\[\chi^{t,l}=f(W^l*\chi^{t,l-1}+b^l)\]</span> &#x6FC0;&#x52B1;&#x51FD;&#x6570;&#x7528;&#x7684;&#x662F;SELU</p><p><img src="/2019/09/09/&#x6570;&#x636E;&#x6316;&#x6398;/2019-09-09-DNN&#x591A;&#x7EF4;&#x65F6;&#x5E8F;&#x65E0;&#x76D1;&#x7763;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;/MSCRED.jpg"></p><h3 id="&#x57FA;&#x4E8E;&#x6CE8;&#x610F;&#x529B;&#x7684;convlstm">&#x57FA;&#x4E8E;&#x6CE8;&#x610F;&#x529B;&#x7684;ConvLSTM</h3><p>&#x4F20;&#x7EDF;&#x7684;ConvLSTM&#x53EF;&#x80FD;&#x968F;&#x7740;&#x65F6;&#x5E8F;&#x5E8F;&#x5217;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6027;&#x80FD;&#x53D1;&#x751F;&#x4E0B;&#x964D;&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x6CE8;&#x610F;&#x529B;&#x6A21;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x65F6;&#x95F4;&#x6233;&#x52A8;&#x6001;&#x91C7;&#x53D6;&#x76F8;&#x5173;&#x9690;&#x542B;&#x5C42;&#xFF08;feature map&#xFF09;&#x3002;&#x9690;&#x542B;&#x5C42;&#x7684;&#x66F4;&#x65B0;<span class="math inline">\(H^{t,l} = ConvLSTM(\chi^{t,l},H^{t-1,l})\)</span></p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;A Deep Neural Network for Unsupervised Anomaly Detectionand Diagnosisin Multivariate Time Series Data&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x8D21;&amp;#x732E;&quot;&gt;&amp;#x8D
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
      <category term="AAAI" scheme="http://www.liufr.com/tags/AAAI/"/>
    
  </entry>
  
  <entry>
    <title>异常检测（MSRA，KDD&#39;19）</title>
    <link href="http://www.liufr.com/2019/08/14/%E6%95%B0%E6%8D%AE%E6%8C%96%E6%8E%98/2019-08-14-%E5%BC%82%E5%B8%B8%E6%A3%80%E6%B5%8B%EF%BC%88MSRA%20KDD&#39;19%EF%BC%89/"/>
    <id>http://www.liufr.com/2019/08/14/数据挖掘/2019-08-14-异常检测（MSRA KDD&#39;19）/</id>
    <published>2019-08-13T16:00:00.000Z</published>
    <updated>2019-09-17T13:28:59.047Z</updated>
    
    <content type="html"><![CDATA[<p>Time-Series Anomaly Detection Service at Microsoft</p><p>Spectral Residual(SR) &#x4EE5;&#x53CA; Convolutional Neural Network(CRR) &#x65B9;&#x6CD5;&#x6765;&#x8FDB;&#x884C;&#x65F6;&#x5E8F;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x3002;</p><p>&#x6311;&#x6218;&#xFF1A; 1. &#x7F3A;&#x5C11;&#x6807;&#x7B7E;&#xFF1A;&#x7CFB;&#x7EDF;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x540C;&#x65F6;&#x5904;&#x7406;&#x5343;&#x767E;&#x4E07;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x4E0D;&#x80FD;&#x624B;&#x52A8;&#x6DFB;&#x52A0;&#x6807;&#x7B7E;&#x3002;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E5F;&#x662F;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x8BC6;&#x522B;&#x4ECE;&#x524D;&#x6CA1;&#x6709;&#x8FC7;&#x7684;&#x5F02;&#x5E38;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6709;&#x76D1;&#x7763;&#x7684;&#x6A21;&#x578B;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x7684;&#x3002; 2. &#x666E;&#x9002;&#x6027;&#xFF1A;&#x9700;&#x8981;&#x517C;&#x5BB9;&#x591A;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x5F0F;&#x3002; 3. &#x6709;&#x6548;&#x6027;&#xFF1A;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x5F80;&#x5F80;&#x8981;&#x5B9E;&#x65F6;&#x5904;&#x7406;&#x5F88;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5206;&#x949F;&#x7EA7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5728;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x5185;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p><p>CNN&#x662F;&#x4E00;&#x79CD;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x6709;&#x76D1;&#x7763;&#x68C0;&#x6D4B;&#xFF0C;SR&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E8C;&#x8005;&#x7ED3;&#x5408;&#x3002;</p><hr><h2 id="&#x7CFB;&#x7EDF;">&#x7CFB;&#x7EDF;</h2><h3 id="data-ingestion">Data Ingestion</h3><p>&#x8FDE;&#x63A5;&#x53CA;&#x7C92;&#x5EA6;&#x3002;&#x8FDE;&#x63A5;&#x53EF;&#x4EE5;&#x5C06;&#x7528;&#x6237;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x548C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x5BF9;&#x63A5;&#xFF0C;&#x7C92;&#x5EA6;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4EFB;&#x52A1;&#x5468;&#x671F;&#x6027;&#x63A5;&#x7EB3;&#x65B0;&#x7684;&#x6570;&#x636E;&#x3002;&#xFF08;fluxDB&#x548C;Kafka&#xFF09; ### Online Compute &#x5728;&#x7EBF;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x8BA9;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x90FD;&#x5728;&#x8FDB;&#x5165;&#x6D41;&#x6C34;&#x7EBF;&#x540E;&#x7ACB;&#x5373;&#x5F97;&#x5230;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x6765;&#x4F18;&#x5316;&#x5185;&#x5B58;&#x4EE5;&#x53CA;&#x4FDD;&#x8BC1;&#x8BA1;&#x7B97;&#x6709;&#x6548;&#x6027;&#x3002;&#xFF08;Flink&#xFF09; ### Experimentation Platform &#x8861;&#x91CF;&#x6027;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x4EBA;&#x5DE5;&#x6807;&#x8BB0;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x6765;&#x8BC4;&#x5224;&#x68C0;&#x6D4B;&#x7684;&#x51C6;&#x786E;&#x6027;</p><hr><h2 id="&#x65B9;&#x6CD5;">&#x65B9;&#x6CD5;</h2><p>&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;SR&#x7684;&#x57FA;&#x7840;&#x662F;&#xFF0C;&#x65F6;&#x5E8F;&#x7684;&#x5F02;&#x5E38;&#x8868;&#x73B0;&#x5728;&#x56FE;&#x5F62;&#x56FE;&#x50CF;&#x4E0A;&#x6765;&#x8BF4;&#x5F80;&#x5F80;&#x662F;&#x7A81;&#x51FA;&#x7684;&#x3002;CNN&#x53EF;&#x884C;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6709;&#x6807;&#x7B7E;&#x7684;&#x6570;&#x636E;&#x6548;&#x679C;&#x8F83;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x4E8C;&#x8005;&#x8981;&#x7ED3;&#x5408;</p><h3 id="sr">SR</h3><p>&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A; 1. &#x5FEB;&#x901F;&#x5085;&#x91CC;&#x53F6;&#x53D8;&#x5316;FTT&#x5F97;&#x5230;&#x5BF9;&#x6570;&#x632F;&#x5E45;&#x9891;&#x8C31; 2. &#x8BA1;&#x7B97;&#x9891;&#x8C31;&#x5197;&#x4F59; 3. &#x9006;&#x5085;&#x91CC;&#x53F6;&#x53D8;&#x5316;&#x5C06;&#x5E8F;&#x5217;&#x53CD;&#x8F6C;&#x5230;&#x7A7A;&#x95F4;&#x57DF;&#x540D;</p><p>&#x7279;&#x522B;&#x7684;&#x5FEB;&#x901F;&#x5085;&#x91CC;&#x53F6;FFT&#x662F;&#x901A;&#x8FC7;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5904;&#x7406;&#x961F;&#x5217;&#x7684;&#x3002;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5173;&#x6CE8;&#x5EF6;&#x8FDF;&#xFF0C;&#x53D1;&#x73B0;&#x5F53;&#x68C0;&#x6D4B;&#x70B9;&#x662F;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x4E2D;&#x95F4;&#x70B9;&#x65F6;&#x6548;&#x679C;&#x6700;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x5728;&#x5DF2;&#x77E5;&#x8F93;&#x5165;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x70B9;&#x540E;&#x52A0;&#x4E0A;&#x51E0;&#x4E2A;&#x9884;&#x6D4B;&#x70B9;&#x6765;&#x4ECE;&#x800C;&#x4F7F;&#x8BE5;&#x70B9;&#x653E;&#x5728;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#xFF0C;&#x5BF9;&#x4E8E;<span class="math inline">\(x_n\)</span>&#x540E;&#x7684;&#x4F30;&#x8BA1;&#x70B9;<span class="math inline">\(x_{n+1}\)</span>&#x8BA1;&#x7B97;&#x5982;&#x4E0B;&#xFF1A; <span class="math display">\[\bar{g}=\frac{1}{m}\sum_{i=1}^mg(x_n,x_{n-i})\\x_{n+1} = x_{n-m+1}+\bar{g}\cdot m\]</span></p><p>&#x5176;&#x4E2D;<span class="math inline">\(g(x_i,x_j)\)</span>&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;i&#xFF0C;j&#x4E24;&#x70B9;&#x76F4;&#x7EBF;&#x4E0A;&#x7684;&#x659C;&#x7387;&#xFF0C;<span class="math inline">\(\bar{g}\)</span>&#x4E5F;&#x5C31;&#x662F;&#x5E73;&#x5747;&#x68AF;&#x5EA6;&#xFF0C;m=5&#xFF0C;<span class="math inline">\(x_{n+1}\)</span>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#x8FD9;&#x91CC;&#x590D;&#x5236;K&#x6B21;&#x52A0;&#x5230;&#x5E8F;&#x5217;&#x672B;&#x5C3E;&#x5373;&#x53EF;&#x3002;</p><hr><h3 id="sr-cnn">SR-CNN</h3><p>&#x539F;&#x59CB;&#x7684;SR&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x9608;&#x503C;&#x5B9E;&#x73B0;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x66F4;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x8981;&#x91C7;&#x7528;CNN&#xFF0C;&#x7528;&#x5728;&#x663E;&#x8457;&#x56FE;&#xFF08;FTT&#x53D8;&#x6362;&#x540E;&#x7684;&#xFF09;&#x800C;&#x975E;&#x539F;&#x59CB;&#x8F93;&#x5165;&#x56FE;&#x3002;CNN&#x7531;&#x4E24;&#x4E2A;1-D&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF08;&#x5377;&#x79EF;&#x6838;&#x5927;&#x5C0F;&#x4E0E;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x4E00;&#x6837;&#xFF09;&#x4EE5;&#x53CA;&#x4E24;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x6784;&#x6210;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x901A;&#x9053;&#x5927;&#x5C0F;&#x4E0E;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x4E00;&#x6837;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x5927;&#x5C0F;&#x7FFB;&#x500D;&#xFF0C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x5728;Sigmoid&#x8F93;&#x51FA;&#x524D;&#x662F;&#x5806;&#x53E0;&#x7684;&#xFF0C;&#x4EA4;&#x53C9;&#x71B5;&#x91C7;&#x7528;&#x635F;&#x5931;&#x51FD;&#x6570;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;Time-Series Anomaly Detection Service at Microsoft&lt;/p&gt;
&lt;p&gt;Spectral Residual(SR) &amp;#x4EE5;&amp;#x53CA; Convolutional Neural Network(CRR) &amp;#x65B
      
    
    </summary>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/categories/Anomaly-detection/"/>
    
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
      <category term="KDD" scheme="http://www.liufr.com/tags/KDD/"/>
    
  </entry>
  
  <entry>
    <title>利用时序决策树进行DGA僵尸检测</title>
    <link href="http://www.liufr.com/2019/07/21/%E5%AE%89%E5%85%A8/2019-07-22-%E5%88%A9%E7%94%A8%E6%97%B6%E5%BA%8F%E5%86%B3%E7%AD%96%E6%A0%91%E8%BF%9B%E8%A1%8CDGA%E5%83%B5%E5%B0%B8%E6%A3%80%E6%B5%8B/"/>
    <id>http://www.liufr.com/2019/07/21/安全/2019-07-22-利用时序决策树进行DGA僵尸检测/</id>
    <published>2019-07-20T16:00:00.000Z</published>
    <updated>2019-07-22T07:12:27.904Z</updated>
    
    <content type="html"><![CDATA[<p>DGA Bot Detection with Time Series Decision Trees</p><h2 id="&#x4E3B;&#x8981;&#x601D;&#x8DEF;">&#x4E3B;&#x8981;&#x601D;&#x8DEF;</h2><ol type="1"><li>&#x6807;&#x7B7E;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#x5206;&#x7C7B;&#x6280;&#x672F;&#xFF0C;&#x8BE5;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x5BF9;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x751F;&#x6210;&#x6709;&#x6807;&#x7B7E;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x50F5;&#x5C38;&#x7F51;&#x7EDC;&#x63D0;&#x4F9B;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x611F;&#x67D3;IP</li><li>&#x8BAD;&#x7EC3;&#x6A21;&#x5757;&#x4F7F;&#x7528;&#x5BF9;&#x751F;&#x6210;&#x7684;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6709;&#x76D1;&#x7763;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x50F5;&#x5C38;&#x7F51;&#x7EDC;&#x5BB6;&#x65CF;&#x90FD;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x68C0;&#x6D4B;&#x6A21;&#x578B;&#x3002;&#x5229;&#x7528;&#x5178;&#x578B;&#x7684;IP&#x65F6;&#x95F4;&#x8F6E;&#x5ED3;&#x8BC4;&#x4F30;&#x3002;</li><li>&#x68C0;&#x6D4B;&#x6A21;&#x5757;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x68C0;&#x6D4B;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x7684;IP&#x3002;</li></ol><h2 id="&#x6807;&#x7B7E;&#x6A21;&#x5757;">&#x6807;&#x7B7E;&#x6A21;&#x5757;</h2><p>&#x7ED9;&#x6709;&#x76D1;&#x7763;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x53D7;&#x611F;&#x67D3;IP&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x8BE5;&#x6A21;&#x5757;&#x53EA;&#x5904;&#x7406;&#x5728;DNS&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x57DF;&#x540D;&#xFF0C;&#x5229;&#x7528;&#x7684;&#x539F;&#x7406;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x76F8;&#x540C;DGA&#x50F5;&#x5C38;&#x7F51;&#x7EDC;&#x7684;&#x5B50;&#x96C6;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#x3002;</p><ol type="1"><li><strong>&#x6570;&#x636E;&#x9884;&#x5904;&#x7406;</strong> &#x901A;&#x8FC7;&#x542F;&#x53D1;&#x5F0F;&#x65B9;&#x6CD5;&#x51CF;&#x5C0F;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x51CF;&#x5C11;&#x826F;&#x6027;&#x7684;DNS&#x6D41;&#x91CF;&#xFF0C;&#x53EA;&#x4FDD;&#x7559;&#x53EF;&#x7591;&#x7684;NXDOMAIN&#x6765;&#x8FDB;&#x884C;&#x540E;&#x7EED;&#x7684;&#x805A;&#x7C7B;&#x3002;&#xFF08;&#x6839;&#x636E;&#x57DF;&#x540D;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF09;</li><li><strong>&#x5206;&#x7EA7;&#x805A;&#x7C7B;</strong> D&#x4F5C;&#x4E3A;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x57DF;&#x540D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x57DF;&#x540D;d&#x90FD;&#x7531;&#x4E00;&#x7EC4;IP&#x4EE3;&#x8868;&#xFF0C;&#x8FD9;&#x7EC4;IP&#x53EF;&#x4EE5;&#x81F3;&#x5C11;&#x533A;&#x5206;&#x4E00;&#x4E2A;&#x4E0D;&#x6210;&#x529F;&#x7684;DNS&#x8BF7;&#x6C42;&#x3002;&#x805A;&#x7C7B;&#x7ED3;&#x679C;C&#x53EF;&#x4EE5;&#x4EE3;&#x8868;D&#x7684;&#x4E00;&#x79CD;&#x5212;&#x5206;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;c&#x90FD;&#x662F;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x805A;&#x7C7B;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4E24;&#x4E2A;&#x7C7B;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x5982;&#x679C;&#x76F8;&#x4F3C;&#x5EA6;&#x5728;&#x9650;&#x5236;&#x5185;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF1B;&#x8BE5;&#x9650;&#x5236;&#x4E5F;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x6CA1;&#x6709;&#x5171;&#x4EAB;&#x8DB3;&#x591F;IP&#x7684;&#x4E24;&#x4E2A;&#x7C7B;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x3002;</li></ol><p>&#x76F8;&#x4F3C;&#x5EA6;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#xFF1A; <span class="math display">\[\forall(c_i,c_j) \in C^2, sim(c_i.c_j) = |IP^{c_i}\cap IP^{c_j} |\]</span></p><p>&#x76F8;&#x4F3C;&#x5EA6;&#x9650;&#x5236;&#x516C;&#x5F0F;&#xFF1A; <span class="math display">\[sim(c_1^*,c_2^*) &gt; \alpha \cdot min(|IP^{c_1^*}|,|IP^{c_2^*}|) \]</span></p><p><img src="/2019/07/21/&#x5B89;&#x5168;/2019-07-22-&#x5229;&#x7528;&#x65F6;&#x5E8F;&#x51B3;&#x7B56;&#x6811;&#x8FDB;&#x884C;DGA&#x50F5;&#x5C38;&#x68C0;&#x6D4B;/DGA.jpg"></p><ol start="3" type="1"><li><strong>&#x5F97;&#x5230;&#x53D7;&#x611F;&#x67D3;&#x7684;IP</strong> &#x5F80;&#x5F80;&#x4E22;&#x5F03;&#x4E0E;&#x6076;&#x610F;&#x884C;&#x4E3A;&#x4E0D;&#x76F8;&#x5E72;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x5BF9;&#x5DF2;&#x8BC6;&#x522B;&#x7684;DGA&#x50F5;&#x5C38;&#x7F51;&#x7EDC;&#x547D;&#x540D;&#xFF0C;</li></ol><h2 id="&#x68C0;&#x6D4B;&#x6A21;&#x5757;&#x65F6;&#x5E8F;&#x51B3;&#x7B56;&#x6811;">&#x68C0;&#x6D4B;&#x6A21;&#x5757;&#xFF1A;&#x65F6;&#x5E8F;&#x51B3;&#x7B56;&#x6811;</h2><p>&#x8F93;&#x5165;&#xFF1A;DNS&#x65F6;&#x5E8F;&#xFF0C;&#x6BCF;&#x4E2A;IP&#x90FD;&#x6709;&#x6807;&#x7B7E;{Infected&#xFF0C;NonInfected}</p><p>&#x5728;CART&#x51B3;&#x7B56;&#x6811;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8BAD;&#x7EC3;&#xFF0C;&#x6839;&#x8282;&#x70B9;&#x5305;&#x542B;&#x6240;&#x6709;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x3002;&#x6BCF;&#x4E2A;&#x5185;&#x90E8;&#x8282;&#x70B9;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;<span class="math inline">\(\tau\)</span>&#x4EE5;&#x53CA;&#x6839;&#x636E;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x786E;&#x5B9A;&#x7684;&#x5206;&#x5272;&#x6761;&#x4EF6;s</p><ol type="1"><li>&#x6240;&#x6709;&#x7684;&#x5B9E;&#x4F8B;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x6807;&#x7B7E; <span class="math display">\[\forall(T_0,T_1) \in \tau^2, label(T_0)=label(T_1)\]</span></li><li>&#x6240;&#x6709;&#x7684;&#x5B9E;&#x4F8B;&#x6839;&#x636E;&#x8DDD;&#x79BB;&#x516C;&#x5F0F;&#x90FD;&#x662F;&#x76F8;&#x7B49;&#x7684; <span class="math display">\[\forall(T_0,T_1) \in \tau^2, dist(T_0,T_1)=0\]</span></li></ol><h3 id="&#x8BAD;&#x7EC3;&#x6A21;&#x5757;">&#x8BAD;&#x7EC3;&#x6A21;&#x5757;</h3><p>&#x5206;&#x6CBB;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4E00;&#x6761;&#x5B50;&#x6811;&#x6301;&#x7EED;&#x5212;&#x5206;&#x76F4;&#x5230;&#x6EE1;&#x8DB3;&#x4E0A;&#x8FF0;&#x4E24;&#x4E2A;&#x9650;&#x5236;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x9996;&#x5148;&#x8BA1;&#x7B97;&#x5206;&#x88C2;&#x7684;&#x5019;&#x9009;&#x503C;&#xFF0C;&#x8981;&#x6C42;&#x5206;&#x88C2;&#x7ED3;&#x679C;&#x4F7F;&#x5F97;&#x5B50;&#x6811;&#x6700;&#x5E72;&#x51C0;&#xFF0C;&#x5E72;&#x51C0;&#x53EF;&#x4EE5;&#x7528;&#x6807;&#x7B7E;&#x7684;&#x5B9A;&#x4E49;&#x6765;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;&#x6700;&#x4E0D;&#x5E72;&#x51C0;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x4E00;&#x534A;&#x4E3A;{Infected}&#x53E6;&#x4E00;&#x534A;&#x4E3A;{NonInfected}</p><h3 id="&#x68C0;&#x6D4B;&#x6A21;&#x5757;">&#x68C0;&#x6D4B;&#x6A21;&#x5757;</h3><p>&#x5F53;&#x51B3;&#x7B56;&#x6811;&#x6784;&#x5EFA;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4ECE;&#x6839;&#x8282;&#x70B9;&#x5230;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x4E00;&#x6761;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;&#x5212;&#x5206;&#x6765;&#x533A;&#x5206;&#x5176;&#x5C5E;&#x4E8E;&#x54EA;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;</p><h3 id="&#x65F6;&#x5E8F;&#x5212;&#x5206;&#x5019;&#x9009;">&#x65F6;&#x5E8F;&#x5212;&#x5206;&#x5019;&#x9009;</h3><ul><li>&#x6807;&#x51C6;&#x5212;&#x5206;&#xFF1A;&#x901A;&#x8FC7;&#x534A;&#x5F84;&#x5212;&#x5206;</li><li>&#x805A;&#x7C7B;&#x5212;&#x5206;&#xFF1A;&#x6839;&#x636E;&#x5230;&#x4E2D;&#x5FC3;&#x7684;&#x7684;&#x8DDD;&#x79BB;&#x8FDB;&#x884C;&#x5212;&#x5206;</li></ul><p><img src="/2019/07/21/&#x5B89;&#x5168;/2019-07-22-&#x5229;&#x7528;&#x65F6;&#x5E8F;&#x51B3;&#x7B56;&#x6811;&#x8FDB;&#x884C;DGA&#x50F5;&#x5C38;&#x68C0;&#x6D4B;/DGA1.jpg"></p><h3 id="&#x65F6;&#x5E8F;&#x8DDD;&#x79BB;">&#x65F6;&#x5E8F;&#x8DDD;&#x79BB;</h3><p>DTW&#x8DDD;&#x79BB;&#xFF08;&#x5F88;&#x597D;&#x7684;&#x5206;&#x6790;&#x65F6;&#x5E8F;&#x8DDD;&#x79BB;&#x7684;&#x65B9;&#x6CD5;&#xFF09;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;DGA Bot Detection with Time Series Decision Trees&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x4E3B;&amp;#x8981;&amp;#x601D;&amp;#x8DEF;&quot;&gt;&amp;#x4E3B;&amp;#x8981;&amp;#x601D;&amp;#x8DEF;&lt;/h2&gt;
&lt;ol
      
    
    </summary>
    
      <category term="Security" scheme="http://www.liufr.com/categories/Security/"/>
    
    
      <category term="Security" scheme="http://www.liufr.com/tags/Security/"/>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>指数加权移动平均法（EWMA）</title>
    <link href="http://www.liufr.com/2019/07/21/%E5%AE%89%E5%85%A8/2019-07-21-%E6%8C%87%E6%95%B0%E5%8A%A0%E6%9D%83%E7%A7%BB%E5%8A%A8%E5%B9%B3%E5%9D%87%E6%B3%95%EF%BC%88EWMA%EF%BC%89/"/>
    <id>http://www.liufr.com/2019/07/21/安全/2019-07-21-指数加权移动平均法（EWMA）/</id>
    <published>2019-07-20T16:00:00.000Z</published>
    <updated>2019-07-21T11:10:52.001Z</updated>
    
    <content type="html"><![CDATA[<h2 id="&#x4E3B;&#x8981;&#x601D;&#x60F3;">&#x4E3B;&#x8981;&#x601D;&#x60F3;</h2><p>Exponentially Weighted Moving Average (EWMA)&#xFF0C;&#x5BF9;&#x89C2;&#x5BDF;&#x503C;&#x7ED9;&#x4E88;&#x4E0D;&#x540C;&#x7684;&#x6743;&#x91CD;&#x6C42;&#x5F97;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x5E76;&#x4EE5;&#x5E73;&#x5747;&#x503C;&#x4E3A;&#x57FA;&#x7840;&#x786E;&#x5B9A;&#x9884;&#x6D4B;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5F80;&#x5F80;&#x8FD1;&#x671F;&#x89C2;&#x5BDF;&#x503C;&#x7684;&#x6743;&#x91CD;&#x9AD8;&#x662F;&#x56E0;&#x4E3A;&#x5176;&#x66F4;&#x80FD;&#x53CD;&#x6620;&#x8FD1;&#x671F;&#x53D8;&#x5316;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x5404;&#x4E2A;&#x6307;&#x6570;&#x52A0;&#x6743;&#x7CFB;&#x6570;&#x662F;&#x968F;&#x65F6;&#x95F4;&#x6307;&#x6570;&#x9012;&#x51CF;&#x7684;&#xFF0C;&#x8D8A;&#x9760;&#x8FD1;&#x5F53;&#x524D;&#x65F6;&#x523B;&#xFF0C;&#x52A0;&#x6743;&#x7CFB;&#x6570;&#x5C31;&#x8D8A;&#x5927;&#x3002;</p><p>&#x53EF;&#x4EE5;&#x89C6;&#x4F5C;&#x4E00;&#x79CD;&#x7406;&#x60F3;&#x7684;&#x6700;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;&#xFF0C;&#x5F53;&#x524D;&#x4F30;&#x8BA1;&#x503C;&#x7531;&#x524D;&#x4E00;&#x6B21;&#x4F30;&#x8BA1;&#x503C;&#x548C;&#x5F53;&#x524D;&#x7684;&#x62BD;&#x6837;&#x503C;&#x5171;&#x540C;&#x51B3;&#x5B9A;&#xFF1B;&#x4E5F;&#x53EF;&#x4EE5;&#x89C6;&#x4F5C;&#x4E00;&#x4E2A;&#x4F4E;&#x901A;&#x6EE4;&#x6CE2;&#x5668;&#xFF0C;&#x5254;&#x9664;&#x77ED;&#x671F;&#x6CE2;&#x52A8;&#x4FDD;&#x7559;&#x957F;&#x671F;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x7684;&#x5E73;&#x6ED1;&#x5F62;&#x5F0F;&#x3002;</p><h2 id="&#x4F18;&#x70B9;">&#x4F18;&#x70B9;</h2><ol type="1"><li>&#x4E0D;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x8FC7;&#x53BB;&#x7684;&#x6240;&#x6709;&#x6570;&#x503C;</li><li>&#x8BA1;&#x7B97;&#x91CF;&#x663E;&#x8457;&#x51CF;&#x5C0F;</li></ol><h2 id="&#x8BA1;&#x7B97;">&#x8BA1;&#x7B97;</h2><p><span class="math display">\[ v_t = \beta v_{t-1}+(1-\beta)\theta_t\]</span></p><p>&#x5176;&#x4E2D;<span class="math inline">\(\theta_t\)</span>&#x4E3A;&#x65F6;&#x523B;<span class="math inline">\(t\)</span>&#x7684;&#x5B9E;&#x9645;&#x6E29;&#x5EA6;&#xFF1B;<span class="math inline">\(\beta\)</span>&#x8868;&#x793A;&#x52A0;&#x6743;&#x4E0B;&#x964D;&#x7684;&#x901F;&#x7387;&#xFF0C;&#x5176;&#x503C;&#x8D8A;&#x5C0F;&#x4E0B;&#x964D;&#x8D8A;&#x5FEB;&#xFF1B;<span class="math inline">\(v_t\)</span>&#x4E3A;<span class="math inline">\(t\)</span>&#x65F6;&#x523B;&#x7684;EWMA&#x503C;&#x3002;</p><h2 id="&#x53D8;&#x5DEE;&#x4FEE;&#x6B63;">&#x53D8;&#x5DEE;&#x4FEE;&#x6B63;</h2><p>&#x5982;&#x679C;&#x521D;&#x59CB;&#x5316;<span class="math inline">\(v_0=0\)</span>,&#x90A3;&#x4E48;&#x521D;&#x671F;&#x503C;&#x90FD;&#x4F1A;&#x504F;&#x5C0F;&#xFF0C;&#x867D;&#x7136;&#x6700;&#x540E;&#x4F1A;&#x6162;&#x6162;&#x51CF;&#x5C0F;&#x8FD9;&#x90E8;&#x5206;&#x5F71;&#x54CD;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x5BF9;&#x516C;&#x5F0F;&#x505A;&#x51FA;&#x9002;&#x5F53;&#x4FEE;&#x6B63;&#xFF1A; <span class="math display">\[v_t = \frac{\beta v_{t-1}+(1-\beta)\theta_t}{1-\beta^t}\]</span></p><p>&#x5F53;t&#x8868;&#x8F83;&#x5C0F;&#xFF08;&#x521D;&#x671F;&#xFF09;&#x5206;&#x6BCD;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x653E;&#x5927;&#x5F53;&#x524D;&#x6570;&#x503C;&#xFF0C;&#x5F53;t&#x5F88;&#x5927;&#xFF0C;&#x5206;&#x6BCD;&#x8D8B;&#x4E3A;1&#xFF0C;&#x5BF9;&#x6570;&#x503C;&#x673A;&#x4F1A;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x3002;</p><h2 id="&#x4EE3;&#x7801;">&#x4EE3;&#x7801;</h2><figure class="highlight python"><table><tr><td class="code"><pre><span class="line"><span class="keyword">import</span> numpy <span class="keyword">as</span> np</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Ewma</span><span class="params">(object)</span>:</span></span><br><span class="line">    <span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">    In statistical quality control, the EWMA chart (or exponentially weighted moving average chart)</span></span><br><span class="line"><span class="string">    is a type of control chart used to monitor either variables or attributes-type data using the monitored business</span></span><br><span class="line"><span class="string">    or industrial process&apos;s entire history of output. While other control charts treat rational subgroups of samples</span></span><br><span class="line"><span class="string">    individually, the EWMA chart tracks the exponentially-weighted moving average of all prior sample means.</span></span><br><span class="line"><span class="string">    WIKIPEDIA: https://en.wikipedia.org/wiki/EWMA_chart</span></span><br><span class="line"><span class="string">    &quot;&quot;&quot;</span></span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">def</span> <span class="title">__init__</span><span class="params">(self, alpha=<span class="number">0.3</span>, coefficient=<span class="number">3</span>)</span>:</span></span><br><span class="line">        <span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">        :param alpha: Discount rate of ewma, usually in (0.2, 0.3).</span></span><br><span class="line"><span class="string">        :param coefficient: Coefficient is the width of the control limits, usually in (2.7, 3.0).</span></span><br><span class="line"><span class="string">        &quot;&quot;&quot;</span></span><br><span class="line">        self.alpha = alpha</span><br><span class="line">        self.coefficient = coefficient</span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">def</span> <span class="title">predict</span><span class="params">(self, X)</span>:</span></span><br><span class="line">        <span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">        Predict if a particular sample is an outlier or not.</span></span><br><span class="line"><span class="string">        :param X: the time series to detect of</span></span><br><span class="line"><span class="string">        :param type X: pandas.Series</span></span><br><span class="line"><span class="string">        :return: 1 denotes normal, 0 denotes abnormal</span></span><br><span class="line"><span class="string">        &quot;&quot;&quot;</span></span><br><span class="line">        s = [X[<span class="number">0</span>]]</span><br><span class="line">        <span class="keyword">for</span> i <span class="keyword">in</span> range(<span class="number">1</span>, len(X)):</span><br><span class="line">            temp = self.alpha * X[i] + (<span class="number">1</span> - self.alpha) * s[<span class="number">-1</span>]</span><br><span class="line">            s.append(temp)</span><br><span class="line">        s_avg = np.mean(s)</span><br><span class="line">        sigma = np.sqrt(np.var(X))</span><br><span class="line">        ucl = s_avg + self.coefficient * sigma * np.sqrt(self.alpha / (<span class="number">2</span> - self.alpha))</span><br><span class="line">        lcl = s_avg - self.coefficient * sigma * np.sqrt(self.alpha / (<span class="number">2</span> - self.alpha))</span><br><span class="line">        <span class="keyword">if</span> s[<span class="number">-1</span>] &gt; ucl <span class="keyword">or</span> s[<span class="number">-1</span>] &lt; lcl:</span><br><span class="line">            <span class="keyword">return</span> <span class="number">0</span></span><br><span class="line">        <span class="keyword">return</span> <span class="number">1</span></span><br></pre></td></tr></table></figure>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;&amp;#x4E3B;&amp;#x8981;&amp;#x601D;&amp;#x60F3;&quot;&gt;&amp;#x4E3B;&amp;#x8981;&amp;#x601D;&amp;#x60F3;&lt;/h2&gt;
&lt;p&gt;Exponentially Weighted Moving Average (EWMA)&amp;#xFF0C;&amp;#x5B
      
    
    </summary>
    
      <category term="Security" scheme="http://www.liufr.com/categories/Security/"/>
    
    
      <category term="Security" scheme="http://www.liufr.com/tags/Security/"/>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>孤立森林（Isolation Forest）</title>
    <link href="http://www.liufr.com/2019/07/21/%E5%AE%89%E5%85%A8/2019-07-22-xgboost/"/>
    <id>http://www.liufr.com/2019/07/21/安全/2019-07-22-xgboost/</id>
    <published>2019-07-20T16:00:00.000Z</published>
    <updated>2019-07-22T02:50:03.805Z</updated>
    
    <content type="html"><![CDATA[]]></content>
    
    <summary type="html">
    
      
      
        

      
    
    </summary>
    
      <category term="Security" scheme="http://www.liufr.com/categories/Security/"/>
    
    
      <category term="Security" scheme="http://www.liufr.com/tags/Security/"/>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>梯度提升决策树（GBDT）</title>
    <link href="http://www.liufr.com/2019/07/21/%E5%AE%89%E5%85%A8/2019-07-21-%E6%A2%AF%E5%BA%A6%E6%8F%90%E5%8D%87%E5%86%B3%E7%AD%96%E6%A0%91(GBDT)/"/>
    <id>http://www.liufr.com/2019/07/21/安全/2019-07-21-梯度提升决策树(GBDT)/</id>
    <published>2019-07-20T16:00:00.000Z</published>
    <updated>2019-07-22T02:02:12.151Z</updated>
    
    <content type="html"><![CDATA[<h2 id="gcdt&#x68AF;&#x5EA6;&#x63D0;&#x5347;&#x51B3;&#x7B56;&#x6811;">GCDT&#xFF1A;&#x68AF;&#x5EA6;&#x63D0;&#x5347;&#x51B3;&#x7B56;&#x6811;</h2><p>Gradient Boosting Decision Tree&#xFF0C;&#x53C8;&#x53EB;&#x505A;MART&#xFF08;Multiple Additive Regression Tree&#xFF09;&#x8FED;&#x4EE3;&#x7684;&#x51B3;&#x7B56;&#x6811;&#x7B97;&#x6CD5;&#xFF0C;&#x7531;&#x591A;&#x9897;&#x51B3;&#x7B56;&#x6811;&#x7EC4;&#x6210;&#xFF0C;&#x5177;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x3002;GBDT&#x662F;&#x4E00;&#x56DE;&#x5F52;&#x6811;&#x7528;&#x6765;&#x505A;&#x56DE;&#x5F52;&#x9884;&#x6D4B;&#xFF0C;&#x8C03;&#x6574;&#x540E;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5206;&#x7C7B;&#x3002;</p><h2 id="regression-decision-tree&#x56DE;&#x5F52;&#x6811;">Regression Decision Tree&#xFF1A;&#x56DE;&#x5F52;&#x6811;</h2><p>&#x56DE;&#x5F52;&#x6811;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x503C;&#xFF08;&#x4F8B;&#x5982;&#x5E73;&#x5747;&#x503C;&#xFF09;&#xFF0C;&#x5206;&#x652F;&#x65F6;&#x7A77;&#x4E3E;&#x6BCF;&#x4E00;&#x4E2A;feature&#x7684;&#x6BCF;&#x4E2A;&#x9608;&#x503C;&#x627E;&#x5230;&#x6700;&#x597D;&#x7684;&#x5206;&#x5272;&#x70B9;&#xFF0C;&#x4E14;&#x7528;&#x6700;&#x5C0F;&#x5316;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x8FDB;&#x884C;&#x8861;&#x91CF;&#x5206;&#x7C7B;&#x6807;&#x51C6;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x8D8A;&#x591A;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x8D8A;&#x5927;&#xFF0C;&#x76F4;&#x5230;&#x6BCF;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x9884;&#x8BBE;&#x7684;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x3002;</p><h2 id="boosting-decision-tree&#x63D0;&#x5347;&#x6811;&#x7B97;&#x6CD5;">Boosting Decision Tree&#xFF1A;&#x63D0;&#x5347;&#x6811;&#x7B97;&#x6CD5;</h2><p>Boosting&#xFF1A;&#x5C06;&#x5F31;&#x5B66;&#x4E60;&#x63D0;&#x5347;&#x4E3A;&#x5F3A;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#xFF1A;&#x5BF9;&#x4E8E;&#x8D1F;&#x8D23;&#x4EFB;&#x52A1;&#xFF0C;&#x5C06;&#x591A;&#x4E2A;&#x4E13;&#x5BB6;&#x7684;&#x5224;&#x65AD;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7EFC;&#x5408;&#x5F97;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x5224;&#x65AD;&#xFF0C;&#x6BD4;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4E13;&#x5BB6;&#x5355;&#x72EC;&#x7684;&#x5224;&#x65AD;&#x8981;&#x597D;&#x3002;</p><p>&#x63D0;&#x5347;&#x6811;&#x901A;&#x8FC7;&#x8FED;&#x4EE3;&#x591A;&#x4E2A;&#x56DE;&#x5F52;&#x6811;&#x6765;&#x8FDB;&#x884C;&#x5171;&#x540C;&#x51B3;&#x7B56;&#x3002;&#x5F53;&#x91C7;&#x7528;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x56DE;&#x5F52;&#x6811;&#x5B66;&#x4E60;&#x7684;&#x662F;&#x6240;&#x6709;&#x6811;&#x7684;&#x7ED3;&#x8BBA;&#x548C;&#x6B8B;&#x5DEE;&#xFF0C;&#x62DF;&#x5408;&#x5F97;&#x5230;&#x5F53;&#x524D;&#x7684;&#x6B8B;&#x5DEE;&#x56DE;&#x5F52;&#x6811;&#x3002;&#x6B8B;&#x5DEE;=&#x771F;&#x5B9E;&#x503C;-&#x9884;&#x6D4B;&#x503C;&#x3002;&#x63D0;&#x5347;&#x6811;&#x53EF;&#x4EE5;&#x89C6;&#x4F5C;&#x6574;&#x4E2A;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x751F;&#x6210;&#x7684;&#x56DE;&#x5F52;&#x6811;&#x7684;&#x7D2F;&#x52A0;&#x3002;</p><p>&#x6BCF;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x90FD;&#x589E;&#x52A0;&#x88AB;&#x9519;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x6837;&#x672C;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x4F7F;&#x6A21;&#x578B;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x8FED;&#x4EE3;&#x4E2D;&#x66F4;&#x52A0;&#x6CE8;&#x610F;&#x5230;&#x96BE;&#x4EE5;&#x5206;&#x7C7B;&#x7684;&#x6837;&#x672C;&#x3002;</p><p><embed src="pictures/GBDT.webp"></p><h2 id="xgboost-&#x548C;-gbdt-&#x7684;&#x533A;&#x522B;">Xgboost &#x548C; GBDT &#x7684;&#x533A;&#x522B;&#xFF1A;</h2><h3 id="gbdt">GBDT&#xFF1A;</h3><ol type="1"><li>GBDT &#x5B83;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x5F3A;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x590D;&#x6742;&#x7684;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#x548C;&#x7279;&#x5F81;&#x53D8;&#x6362;&#x3002;</li><li>GBDT &#x7684;&#x7F3A;&#x70B9;&#x4E5F;&#x5F88;&#x660E;&#x663E;&#xFF0C;Boost &#x662F;&#x4E00;&#x4E2A;&#x4E32;&#x884C;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0D;&#x597D;&#x5E76;&#x884C;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#x9AD8;&#xFF0C;&#x540C;&#x65F6;&#x4E0D;&#x592A;&#x9002;&#x5408;&#x9AD8;&#x7EF4;&#x7A00;&#x758F;&#x7279;&#x5F81;&#xFF1B;</li><li>&#x4F20;&#x7EDF; GBDT &#x5728;&#x4F18;&#x5316;&#x65F6;&#x53EA;&#x7528;&#x5230;&#x4E00;&#x9636;&#x5BFC;&#x6570;&#x4FE1;&#x606F;&#x3002;</li></ol><h3 id="xgboost">Xgboost&#xFF1A;</h3><ol type="1"><li>&#x663E;&#x793A;&#x7684;&#x628A;&#x6811;&#x6A21;&#x578B;&#x590D;&#x6742;&#x5EA6;&#x4F5C;&#x4E3A;&#x6B63;&#x5219;&#x9879;&#x52A0;&#x5230;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x4E2D;&#x3002;</li><li>&#x516C;&#x5F0F;&#x63A8;&#x5BFC;&#x4E2D;&#x7528;&#x5230;&#x4E86;&#x4E8C;&#x9636;&#x5BFC;&#x6570;&#xFF0C;&#x7528;&#x4E86;&#x4E8C;&#x9636;&#x6CF0;&#x52D2;&#x5C55;&#x5F00;&#x3002;&#xFF08;GBDT &#x7528;&#x725B;&#x987F;&#x6CD5;&#x8C8C;&#x4F3C;&#x4E5F;&#x662F;&#x4E8C;&#x9636;&#x4FE1;&#x606F;&#xFF09;</li><li>&#x5B9E;&#x73B0;&#x4E86;&#x5206;&#x88C2;&#x70B9;&#x5BFB;&#x627E;&#x8FD1;&#x4F3C;&#x7B97;&#x6CD5;&#x3002;</li><li>&#x5229;&#x7528;&#x4E86;&#x7279;&#x5F81;&#x7684;&#x7A00;&#x758F;&#x6027;&#x3002;</li><li>&#x6570;&#x636E;&#x4E8B;&#x5148;&#x6392;&#x5E8F;&#x5E76;&#x4E14;&#x4EE5; block &#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x6709;&#x5229;&#x4E8E;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x3002;</li><li>&#x57FA;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x901A;&#x4FE1;&#x6846;&#x67B6; rabit&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728; MPI &#x548C; yarn &#x4E0A;&#x3002;&#xFF08;&#x6700;&#x65B0;&#x5DF2;&#x7ECF;&#x4E0D;&#x57FA;&#x4E8E; rabit &#x4E86;&#xFF09;</li><li>&#x5B9E;&#x73B0;&#x505A;&#x4E86;&#x9762;&#x5411;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x9488;&#x5BF9; cache &#x548C;&#x5185;&#x5B58;&#x505A;&#x4E86;&#x6027;&#x80FD;&#x4F18;&#x5316;</li></ol>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;gcdt&amp;#x68AF;&amp;#x5EA6;&amp;#x63D0;&amp;#x5347;&amp;#x51B3;&amp;#x7B56;&amp;#x6811;&quot;&gt;GCDT&amp;#xFF1A;&amp;#x68AF;&amp;#x5EA6;&amp;#x63D0;&amp;#x5347;&amp;#x51B3;&amp;#x7B56;&amp;#x6811;&lt;/
      
    
    </summary>
    
      <category term="Security" scheme="http://www.liufr.com/categories/Security/"/>
    
    
      <category term="Security" scheme="http://www.liufr.com/tags/Security/"/>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>孤立森林（Isolation Forest）</title>
    <link href="http://www.liufr.com/2019/07/21/%E5%AE%89%E5%85%A8/2019-07-22-%E5%AD%A4%E7%AB%8B%E6%A3%AE%E6%9E%97%EF%BC%88Isolation%20Froest%EF%BC%89/"/>
    <id>http://www.liufr.com/2019/07/21/安全/2019-07-22-孤立森林（Isolation Froest）/</id>
    <published>2019-07-20T16:00:00.000Z</published>
    <updated>2019-07-22T02:39:55.715Z</updated>
    
    <content type="html"><![CDATA[<h2 id="iforest">iForest</h2><p>&#x65E0;&#x53C2;&#x6570;&#x65E0;&#x76D1;&#x7763;&#x65B9;&#x6CD5;&#x3002;</p><p>&#x5047;&#x8BBE;&#x7528;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x8D85;&#x5E73;&#x9762;&#x5207;&#x5272;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#xFF0C;&#x5207;&#x4E00;&#x6B21;&#x4EA7;&#x751F;&#x4E24;&#x4E2A;&#x5B50;&#x7A7A;&#x95F4;&#xFF0C;&#x4F9D;&#x6B21;&#x5FAA;&#x73AF;&#x4E0B;&#x53BB;&#x76F4;&#x5230;&#x6BCF;&#x4E2A;&#x5B50;&#x7A7A;&#x95F4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x70B9;&#x4E3A;&#x6B62;&#x3002;&#x76F4;&#x89C2;&#x7684;&#x8BF4;&#x90A3;&#x4E9B;&#x5BC6;&#x5EA6;&#x5F88;&#x9AD8;&#x7684;&#x7C07;&#x9700;&#x8981;&#x88AB;&#x5207;&#x5272;&#x5F88;&#x591A;&#x6B21;&#x624D;&#x4F1A;&#x505C;&#x6B62;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x4E9B;&#x5BC6;&#x5EA6;&#x8F83;&#x4F4E;&#x7684;&#x70B9;&#x5F88;&#x5BB9;&#x6613;&#x8F83;&#x65E9;&#x5730;&#x505C;&#x5728;&#x4E00;&#x4E2A;&#x5B50;&#x7A7A;&#x95F4;&#x91CC;</p><h2 id="&#x5B9E;&#x73B0;&#x6B65;&#x9AA4;">&#x5B9E;&#x73B0;&#x6B65;&#x9AA4;</h2><p>&#x5207;&#x5272;&#x662F;&#x968F;&#x673A;&#x7684;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x96C6;&#x6210;&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6536;&#x655B;&#x503C;&#xFF0C;&#x5373;&#x53CD;&#x590D;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x5207;&#x7136;&#x540E;&#x5E73;&#x5747;&#x6BCF;&#x6B21;&#x7684;&#x7ED3;&#x679C;&#x3002;</p><ol type="1"><li>&#x4ECE;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x9009;&#x62E9;&#x6837;&#x672C;&#x70B9;&#x4F5C;&#x4E3A;subsample,&#x653E;&#x5165;&#x6811;&#x7684;&#x6839;&#x8282;&#x70B9;&#x3002;</li><li>&#x968F;&#x673A;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x968F;&#x673A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5207;&#x5272;&#x70B9;p&#xFF0C;&#x4F4D;&#x4E8E;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7684;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#x4E4B;&#x95F4;&#x3002;</li><li>&#x4EE5;&#x5207;&#x5272;&#x70B9;&#x751F;&#x6210;&#x8D85;&#x5E73;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5F53;&#x524D;&#x7684;&#x8282;&#x70B9;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x5212;&#x5206;&#x4E3A;2&#x4E2A;&#x5B50;&#x7A7A;&#x95F4;&#xFF0C;&#x628A;&#x5C0F;&#x4E8E;p&#x7684;&#x653E;&#x5165;&#x8282;&#x70B9;&#x7684;&#x5DE6;&#x5B69;&#x5B50;&#xFF0C;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;p&#x7684;&#x653E;&#x5728;&#x53F3;&#x5B69;&#x5B50;</li><li>&#x5728;&#x5B69;&#x5B50;&#x8282;&#x70B9;&#x4E2D;&#x4E0D;&#x65AD;&#x9012;&#x5F52;&#x6B65;&#x9AA4;2&#x548C;3&#xFF0C;&#x76F4;&#x5230;&#x65E0;&#x6CD5;&#x5207;&#x5272;&#xFF0C;&#x6216;&#x8005;&#x8FBE;&#x5230;&#x9650;&#x5B9A;&#x9AD8;&#x5EA6;&#x3002;</li></ol><p>&#x83B7;&#x5F97;t&#x4E2A;iTree&#x540E;&#xFF0C;&#x8BAD;&#x7EC3;&#x7ED3;&#x675F;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x7528;&#x751F;&#x6210;&#x7684;iForest&#x6765;&#x8BC4;&#x4F30;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x6570;&#x636E;x&#x904D;&#x5386;&#x6BCF;&#x4E00;&#x68F5;iTree&#xFF0C;&#x8BA1;&#x7B97;&#x5176;&#x843D;&#x5728;&#x7B2C;&#x51E0;&#x5C42;&#xFF0C;&#x5F97;&#x5230;x&#x5728;&#x6BCF;&#x4E2A;&#x6811;&#x9AD8;&#x5EA6;&#x5E73;&#x5747;&#x503C;&#x3002;&#x83B7;&#x5F97;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x7684;&#x9AD8;&#x5EA6;&#x5E73;&#x5747;&#x503C;&#x540E;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x9608;&#x503C;&#xFF0C;&#x4F4E;&#x4E8E;&#x9608;&#x503C;&#x7684;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x4E3A;&#x5F02;&#x5E38;&#x3002;&#x5F02;&#x5E38;&#x5728;&#x4E66;&#x4E2D;&#x5F80;&#x5F80;&#x6709;&#x8F83;&#x77ED;&#x7684;&#x5E73;&#x5747;&#x9AD8;&#x5EA6;&#x3002;&#x8BBA;&#x6587;&#x5BF9;&#x9AD8;&#x5EA6;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;0&#x5230;1&#x7684;&#x6570;&#x503C;&#xFF0C;&#x8D8A;&#x77ED;&#x9AD8;&#x5EA6;&#x8D8A;&#x63A5;&#x8FD1;1&#xFF08;&#x5F02;&#x5E38;&#x53EF;&#x80FD;&#x6027;&#x8D8A;&#x9AD8;&#xFF09;</p><p><embed src="pictures/iForest.webp"></p><p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;d&#x6700;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5F02;&#x5E38;</p><h2 id="&#x9ED8;&#x8BA4;&#x53C2;&#x6570;">&#x9ED8;&#x8BA4;&#x53C2;&#x6570;</h2><ul><li>subsample size&#xFF1A;256</li><li>Tree height&#xFF1A;8</li><li>Number of trees&#xFF1A;100</li></ul>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;iforest&quot;&gt;iForest&lt;/h2&gt;
&lt;p&gt;&amp;#x65E0;&amp;#x53C2;&amp;#x6570;&amp;#x65E0;&amp;#x76D1;&amp;#x7763;&amp;#x65B9;&amp;#x6CD5;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5047;&amp;#x8BBE;&amp;#x7528;&amp;#x
      
    
    </summary>
    
      <category term="Security" scheme="http://www.liufr.com/categories/Security/"/>
    
    
      <category term="Security" scheme="http://www.liufr.com/tags/Security/"/>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>多项式插值</title>
    <link href="http://www.liufr.com/2019/07/21/%E5%AE%89%E5%85%A8/2019-07-21-%E5%A4%9A%E9%A1%B9%E5%BC%8F%E6%8F%92%E5%80%BC/"/>
    <id>http://www.liufr.com/2019/07/21/安全/2019-07-21-多项式插值/</id>
    <published>2019-07-20T16:00:00.000Z</published>
    <updated>2019-07-21T13:36:30.148Z</updated>
    
    <content type="html"><![CDATA[<h2 id="polynominal-interpolation">Polynominal Interpolation</h2><p>&#x591A;&#x9879;&#x5F0F;&#x63D2;&#x503C;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#xFF0C;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6070;&#x597D;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x70B9;&#x7684;&#x591A;&#x9879;&#x5F0F;&#x3002;</p><h2 id="&#x4EE3;&#x7801;">&#x4EE3;&#x7801;</h2><figure class="highlight python"><table><tr><td class="code"><pre><span class="line"><span class="keyword">import</span> numpy <span class="keyword">as</span> np</span><br><span class="line"><span class="keyword">from</span> sklearn.linear_model <span class="keyword">import</span> Ridge</span><br><span class="line"><span class="keyword">from</span> sklearn.preprocessing <span class="keyword">import</span> PolynomialFeatures</span><br><span class="line"><span class="keyword">from</span> sklearn.pipeline <span class="keyword">import</span> make_pipeline</span><br><span class="line"><span class="keyword">from</span> time_series_detector.common.tsd_common <span class="keyword">import</span> *</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">PolynomialInterpolation</span><span class="params">(object)</span>:</span></span><br><span class="line">    <span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">    In statistics, polynomial regression is a form of regression analysis in which the relationship</span></span><br><span class="line"><span class="string">    between the independent variable x and the dependent variable y is modelled as an nth degree polynomial in x.</span></span><br><span class="line"><span class="string">    WIKIPEDIA: https://en.wikipedia.org/wiki/Polynomial_regression</span></span><br><span class="line"><span class="string">    &quot;&quot;&quot;</span></span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">def</span> <span class="title">__init__</span><span class="params">(self, threshold=<span class="number">0.15</span>, degree=<span class="number">4</span>)</span>:</span></span><br><span class="line">        <span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">       :param threshold: The critical point of normal.</span></span><br><span class="line"><span class="string">       :param degree: Depth of iteration.</span></span><br><span class="line"><span class="string">        &quot;&quot;&quot;</span></span><br><span class="line">        self.degree = degree</span><br><span class="line">        self.threshold = threshold</span><br><span class="line"></span><br><span class="line">    <span class="function"><span class="keyword">def</span> <span class="title">predict</span><span class="params">(self, X, window=DEFAULT_WINDOW)</span>:</span></span><br><span class="line">        <span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">        Predict if a particular sample is an outlier or not.</span></span><br><span class="line"><span class="string">        :param X: the time series to detect of</span></span><br><span class="line"><span class="string">        :param type X: pandas.Series</span></span><br><span class="line"><span class="string">        :param window: the length of window</span></span><br><span class="line"><span class="string">        :param type window: int</span></span><br><span class="line"><span class="string">        :return: 1 denotes normal, 0 denotes abnormal</span></span><br><span class="line"><span class="string">        &quot;&quot;&quot;</span></span><br><span class="line">        x_train = list(range(<span class="number">0</span>, <span class="number">2</span> * window + <span class="number">1</span>)) + list(range(<span class="number">0</span>, <span class="number">2</span> * window + <span class="number">1</span>)) + list(range(<span class="number">0</span>, window + <span class="number">1</span>))</span><br><span class="line">        x_train = np.array(x_train)</span><br><span class="line">        x_train = x_train[:, np.newaxis]</span><br><span class="line">        avg_value = np.mean(X[-(window + <span class="number">1</span>):])</span><br><span class="line">        <span class="keyword">if</span> avg_value &gt; <span class="number">1</span>:</span><br><span class="line">            y_train = X / avg_value</span><br><span class="line">        <span class="keyword">else</span>:</span><br><span class="line">            y_train = X</span><br><span class="line">        model = make_pipeline(PolynomialFeatures(self.degree), Ridge())</span><br><span class="line">        model.fit(x_train, y_train)</span><br><span class="line">        <span class="keyword">if</span> abs(y_train[<span class="number">-1</span>] - model.predict(np.array(x_train[<span class="number">-1</span>]).reshape(<span class="number">1</span>, <span class="number">-1</span>))) &gt; self.threshold:</span><br><span class="line">            <span class="keyword">return</span> <span class="number">0</span></span><br><span class="line">        <span class="keyword">return</span> <span class="number">1</span></span><br></pre></td></tr></table></figure>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;polynominal-interpolation&quot;&gt;Polynominal Interpolation&lt;/h2&gt;
&lt;p&gt;&amp;#x591A;&amp;#x9879;&amp;#x5F0F;&amp;#x63D2;&amp;#x503C;&amp;#xFF0C;&amp;#x7ED9;&amp;#x5B9A;&amp;#x4E00
      
    
    </summary>
    
      <category term="Security" scheme="http://www.liufr.com/categories/Security/"/>
    
    
      <category term="Security" scheme="http://www.liufr.com/tags/Security/"/>
    
      <category term="Anomaly detection" scheme="http://www.liufr.com/tags/Anomaly-detection/"/>
    
  </entry>
  
  <entry>
    <title>网络异常行为检测</title>
    <link href="http://www.liufr.com/2019/06/22/%E5%AE%89%E5%85%A8/2019-06-22-%E7%BD%91%E7%BB%9C%E5%BC%82%E5%B8%B8%E8%A1%8C%E4%B8%BA%E6%A3%80%E6%B5%8B/"/>
    <id>http://www.liufr.com/2019/06/22/安全/2019-06-22-网络异常行为检测/</id>
    <published>2019-06-21T16:00:00.000Z</published>
    <updated>2019-06-27T08:20:18.197Z</updated>
    
    <content type="html"><![CDATA[<h2 id="&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x7684;&#x7F51;&#x7EDC;&#x5F02;&#x5E38;&#x884C;&#x4E3A;&#x68C0;&#x6D4B;&#x6280;&#x672F;&#x542F;&#x660E;"><a href="http://www.199it.com/archives/436132.html" target="_blank" rel="noopener">&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x5B66;&#x4E60;&#x7684;&#x7F51;&#x7EDC;&#x5F02;&#x5E38;&#x884C;&#x4E3A;&#x68C0;&#x6D4B;&#x6280;&#x672F;</a>(&#x542F;&#x660E;)</h2><p>&#x57FA;&#x4E8E;&#x4EBA;&#x5DE5;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x6280;&#x672F;&#x7684;&#x6280;&#x672F;&#x8DEF;&#x7EBF;&#x662F;&#xFF1A;&#x5206;&#x6790;&#x4EBA;&#x5458;&#x9996;&#x5148;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x4ECE;&#x539F;&#x59CB;&#x6570;&#x636E;&#x4E2D;&#x63D0;&#x53D6;&#x7279;&#x5F81;&#x53C2;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x548C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x3002;</p><p>&#x4EBA;&#x5DE5;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7684;&#x4F18;&#x70B9;&#x662F;&#xFF08;&#x5E94;&#x7528;&#x8F83;&#x591A;&#xFF09;&#xFF1A; * &#x7279;&#x5F81;&#x63D0;&#x53D6;&#x5EFA;&#x7ACB;&#x5728;&#x5B89;&#x5168;&#x5206;&#x6790;&#x4EBA;&#x5458;&#x7684;&#x8BA4;&#x77E5;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#xFF0C;&#x5BF9;&#x5F02;&#x5E38;&#x884C;&#x4E3A;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x9488;&#x5BF9;&#x6027;&#xFF1B; * &#x5BF9;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x6570;&#x91CF;&#x7684;&#x4F9D;&#x8D56;&#x5EA6;&#x4F4E;&#xFF0C;&#x8F83;&#x5C11;&#x7684;&#x6837;&#x672C;&#x8BAD;&#x7EC3;&#x5373;&#x53EF;&#x5F97;&#x5230;&#x76F8;&#x5BF9;&#x51C6;&#x786E;&#x7684;&#x6A21;&#x578B;&#xFF1B; * &#x6A21;&#x578B;&#x7684;&#x53EF;&#x89E3;&#x91CA;&#x5EA6;&#x9AD8;&#xFF0C;&#x5BB9;&#x6613;&#x786E;&#x5B9A;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;</p><p>&#x4EBA;&#x5DE5;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7684;&#x7F3A;&#x70B9;&#xFF1A; * &#x5BF9;&#x5B89;&#x5168;&#x5206;&#x6790;&#x4EBA;&#x5458;&#x7684;&#x4F9D;&#x8D56;&#x5EA6;&#x9AD8;&#xFF0C;&#x7279;&#x5F81;&#x7684;&#x9009;&#x53D6;&#x65B9;&#x6CD5;&#x4F1A;&#x5BF9;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#x7684;&#x6709;&#x6548;&#x6027;&#x4EA7;&#x751F;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x3002;</p><p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4F18;&#x70B9;&#xFF1A; * &#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x81EA;&#x52A8;&#x5B66;&#x4E60;&#x4EA7;&#x751F;&#x7279;&#x5F81;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5C06;&#x7279;&#x5F81;&#x5B66;&#x4E60;&#x878D;&#x5165;&#x5EFA;&#x7ACB;&#x6A21;&#x578B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x4E86;&#x4EBA;&#x4E3A;&#x8BBE;&#x8BA1;&#x7279;&#x5F81;&#x5F15;&#x53D1;&#x7684;&#x4E0D;&#x5B8C;&#x5907;&#x3002;</p><p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5C40;&#x9650;&#x6027;&#xFF1A; * &#x9700;&#x8981;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x6A21;&#x578B;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002; * &#x5F53;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x6570;&#x91CF;&#x4E0D;&#x8DB3;&#x65F6;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5C06;&#x4E0D;&#x80FD;&#x591F;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x89C4;&#x5F8B;&#x8FDB;&#x884C;&#x65E0;&#x504F;&#x4F30;&#x8BA1;&#xFF0C;&#x6A21;&#x578B;&#x7684;&#x8BC6;&#x522B;&#x6548;&#x679C;&#x53EF;&#x80FD;&#x8FD8;&#x4E0D;&#x5982;&#x4F20;&#x7EDF;&#x57FA;&#x4E8E;&#x4EBA;&#x5DE5;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7684;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#x65B9;&#x6CD5;&#x3002; * &#x5F53;&#x524D;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6210;&#x529F;&#x5E94;&#x7528;&#x5927;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x6709;&#x5927;&#x91CF;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#x9886;&#x57DF;&#xFF0C;&#x5982;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x3001;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x3001;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x7B49;&#x3002;</p><p>&#x7279;&#x5F81;&#x9009;&#x62E9;&#xFF1A; * &#x547D;&#x4EE4;&#x4E0E;&#x63A7;&#x5236;&#x901A;&#x9053;&#x884C;&#x4E3A;&#x68C0;&#x6D4B; * &#x53CD;&#x5411;&#x8FDE;&#x63A5;&#x7279;&#x5F81;&#xFF08;&#x5224;&#x65AD;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6D41;&#xFF09; * &#x5FC3;&#x8DF3;&#x7279;&#x5F81;&#xFF08;&#x68C0;&#x6D4B;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x5E73;&#x7A33;&#x5EA6;&#xFF09; * &#x83B7;&#x53D6;&#x884C;&#x4E3A;&#x68C0;&#x6D4B; * &#x4F1A;&#x8BDD;&#x4FE1;&#x606F;&#x7C7B;&#x6307;&#x6807;&#x3002;&#x7EDF;&#x8BA1;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x4E0D;&#x540C;&#x534F;&#x8BAE;&#x7C7B;&#x578B;&#x7684;&#x4F1A;&#x8BDD;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x3002;&#x5982;TCP&#x8FDE;&#x63A5;&#x6B21;&#x6570;&#x3001;UDP&#x8FDE;&#x63A5;&#x6B21;&#x6570;&#x3001;&#x5BF9;&#x5E94;&#x7684;&#x6D41;&#x91CF;&#x3001;&#x6570;&#x636E;&#x5206;&#x7EC4;&#x5927;&#x5C0F;&#x7684;&#x5747;&#x503C;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#x7B49; * &#x5E94;&#x7528;&#x5206;&#x5E03;&#x7C7B;&#x6307;&#x6807;&#x3002;&#x7EDF;&#x8BA1;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x4E0D;&#x540C;&#x5E94;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x8BBF;&#x95EE;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x8BBF;&#x95EE;&#x4E0D;&#x540C;&#x5E94;&#x7528;&#x7684;&#x6D41;&#x91CF;&#x5206;&#x5E03;&#x3001;&#x6B21;&#x6570;&#x3001;&#x76EE;&#x6807;&#x5730;&#x5740;&#x4F4D;&#x7F6E;&#x3001;&#x56FD;&#x522B;&#x5206;&#x5E03;&#x7B49; * &#x6307;&#x793A;&#x4F4D;&#x6807;&#x8BC6;&#x7C7B;&#x6307;&#x6807;&#x3002;&#x7EDF;&#x8BA1;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x6536;&#x53D1;&#x7684;&#x542B;&#x7279;&#x5B9A;&#x534F;&#x8BAE;&#x6807;&#x8BC6;&#x4F4D;&#x7684;&#x6570;&#x636E;&#x5206;&#x7EC4;&#x6570;&#x91CF;&#x53CA;&#x5176;&#x6BD4;&#x503C;&#x3002;&#x6709;TCP_SYN_send&#x3001;TCP_SYN_ACK_receive&#x3001;RST_send&#x7B49;&#x6807;&#x5FD7;&#x4F4D;&#x7684;&#x4F1A;&#x8BDD;&#x6570;&#x76EE;&#xFF1B;TCP_SYN_ACK_receive/TCP_SYN_send&#x7684;&#x6BD4;&#x503C;&#xFF1B;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x91CC;&#x7684;ICMP_T3&#x3001;ICMP_Echo_Reply&#x3001;ICMP_Echo_Request&#x7B49;&#x62A5;&#x6587;&#x6570;&#x76EE; * &#x5730;&#x5740;&#x5206;&#x5E03;&#x6307;&#x6807;&#x3002;&#x7EDF;&#x8BA1;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x8BBF;&#x95EE;&#x7684;IP&#x5730;&#x5740;&#x7F51;&#x6BB5;&#x5206;&#x5E03;&#x3001;&#x5185;&#x5916;&#x7F51;&#x5206;&#x5E03;&#x7B49;&#x53C2;&#x6570;</p><p>&#x7279;&#x5F81;&#x503C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;</p><hr><h2 id="&#x57FA;&#x4E8E;&#x4E3B;&#x52A8;&#x5B66;&#x4E60;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;"><a href="https://mp.weixin.qq.com/s?__biz=MzIyMzcxMDYwNg==&amp;mid=2247484232&amp;idx=1&amp;sn=28dcd0f1d32ab1298f2ba9c5380d1ce7&amp;chksm=e81b5fa9df6cd6bf391a188c31cb1ac53024f0fd1b6fddb48b13e04882be5d13b53b30eba482&amp;mpshare=1&amp;scene=1&amp;srcid=#rd" target="_blank" rel="noopener">&#x57FA;&#x4E8E;&#x4E3B;&#x52A8;&#x5B66;&#x4E60;&#x7684;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;</a></h2><p>&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x4F1A;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#x878D;&#x5165;&#x5230;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x4E2D;&#xFF0C;&#x9488;&#x5BF9;&#x521D;&#x59CB;&#x7684;&#x5F02;&#x5E38;&#x5206;&#x6570;&#x6392;&#x540D;&#xFF0C;&#x7ED9;&#x51FA;&#x6392;&#x540D;&#x9760;&#x524D;&#x7684;&#x6837;&#x672C;&#x7684;&#x53CD;&#x9988;&#x4E4B;&#x540E;&#xFF0C;&#x6A21;&#x578B;&#x4F1A;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x53CD;&#x9988;&#x6765;&#x91CD;&#x65B0;&#x8C03;&#x6574;&#x53C2;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x8F93;&#x51FA;&#x65B0;&#x7684;&#x5F02;&#x5E38;&#x5206;&#x6570;&#x6392;&#x540D;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4F7F;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5F02;&#x5E38;&#x6392;&#x5728;&#x9760;&#x524D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4ECE;&#x800C;&#x8282;&#x7EA6;&#x6392;&#x67E5;&#x5F02;&#x5E38;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x3002;</p><p><strong>&#x635F;&#x5931;&#x51FD;&#x6570;</strong>&#xFF1A; &#x5F02;&#x5E38;&#x6837;&#x672C;&#x88AB;&#x6392;&#x5728;&#x6700;&#x524D;&#x9762;&#xFF0C;&#x8BF4;&#x660E;&#x76EE;&#x524D;&#x7684;&#x6A21;&#x578B;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x503C;&#x9700;&#x8981;&#x51CF;&#x5C11;,&#x6B63;&#x5E38;&#x70B9;&#x6392;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x589E;&#x5927;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002;</p><p><strong>&#x955C;&#x50CF;&#x4E0B;&#x964D;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;</strong></p><hr><h2 id="&#x901A;&#x8FC7;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E3A;&#x65B0;kpi&#x66F2;&#x7EBF;&#x5FEB;&#x901F;&#x90E8;&#x7F72;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;"><a href="https://mp.weixin.qq.com/s?__biz=MzIyMzcxMDYwNg==&amp;mid=2247484321&amp;idx=1&amp;sn=2d7e8fa47adca709814242fa0308c074&amp;chksm=e81b5f40df6cd656ef182ab30c3a7d117268e21e2823d5ab2be438478b5843039b8eb03aca84&amp;mpshare=1&amp;scene=1&amp;srcid=#rd" target="_blank" rel="noopener">&#x901A;&#x8FC7;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E3A;&#x65B0;KPI&#x66F2;&#x7EBF;&#x5FEB;&#x901F;&#x90E8;&#x7F72;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;</a></h2><p>&#x5206;&#x6790;KPI&#x66F2;&#x7EBF;&#xFF0C;&#x5C3D;&#x7BA1;KPI&#x66F2;&#x7EBF;&#x7684;&#x6570;&#x91CF;&#x4F17;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x66F2;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#x5927;&#x4F53;&#x4E0A;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x7684;&#x51E0;&#x7C7B;&#x3002;&#x8FD9;&#x672C;&#x8D28;&#x662F;&#x7531;&#x4E8E;&#xFF0C;&#x66F2;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#x662F;&#x7531;&#x4E1A;&#x52A1;&#x7684;&#x7C7B;&#x578B;&#xFF08;&#x6BD4;&#x5982;&#x4EA4;&#x6613;&#x91CF;&#xFF0C;&#x6E38;&#x620F;&#x5728;&#x7EBF;&#x4EBA;&#x6570;&#xFF0C;&#x641C;&#x7D22;&#xFF09;&#x4EE5;&#x53CA;&#x66F2;&#x7EBF;&#x7684;&#x7C7B;&#x578B;&#xFF08;CPU&#x4F7F;&#x7528;&#x7387;&#xFF0C;&#x6210;&#x529F;&#x7387;&#xFF09;&#x6240;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x975E;&#x96C6;&#x7FA4;&#x7684;&#x89C4;&#x6A21;&#x3002;&#x9664;&#x975E;&#x662F;&#x4E0A;&#x7EBF;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x5426;&#x5219;&#x65B0;&#x7684;&#x66F2;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#x5927;&#x6982;&#x7387;&#x4F1A;&#x548C;&#x65E7;&#x66F2;&#x7EBF;&#x7684;&#x5F62;&#x72B6;&#x76F8;&#x4F3C;&#x3002;&#x8FD9;&#x542F;&#x793A;&#x4F5C;&#x8005;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x66F2;&#x7EBF;&#x505A;&#x805A;&#x7C7B;&#xFF0C;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x7C7B;&#x522B;&#x7684;&#x66F2;&#x7EBF;&#xFF0C;&#x5176;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x4E5F;&#x5927;&#x81F4;&#x76F8;&#x4F3C;&#x3002;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x7C7B;&#x522B;&#x7684;&#x66F2;&#x7EBF;&#x5F62;&#x72B6;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#xFF0C;&#x5728;&#x6A21;&#x578B;&#x5C42;&#x9762;&#x4E0A;&#x9700;&#x8981;&#x6709;&#x6240;&#x533A;&#x5206;&#x3002;&#x4F5C;&#x8005;&#x5F00;&#x59CB;&#x601D;&#x8003;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x534A;&#x76D1;&#x7763;&#x7B97;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x539F;&#x6709;&#x7684;label&#x6807;&#x6CE8;&#xFF0C;&#x63D0;&#x9AD8;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x53C8;&#x80FD;&#x591F;&#x4E3A;&#x6BCF;&#x6839;&#x65B0;&#x4E0A;&#x7EBF;&#x7684;&#x66F2;&#x7EBF;&#x5206;&#x914D;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#x3002;</p><p><a href="https://zhuanlan.zhihu.com/p/50698719" target="_blank" rel="noopener">ROCKA</a> &#x5206;&#x6790;&#x66F2;&#x7EBF;&#x76F8;&#x4F3C;&#x5EA6;</p><hr><p><a href="https://github.com/Tencent/Metis" target="_blank" rel="noopener">&#x817E;&#x8BAF;Metis</a></p><ol type="1"><li>&#x5BF9;&#x4E8E;&#x5DF2;&#x77E5;&#x7684;&#x6545;&#x969C;&#xFF1A;&#x7EC7;&#x4E91; Metis &#x80FD;&#x591F;&#x7EFC;&#x5408;&#x6545;&#x969C;&#x6570;&#x636E;&#x548C;&#x4EBA;&#x5DE5;&#x7ECF;&#x9A8C;&#x81EA;&#x52A8;&#x63D0;&#x53D6;&#x6545;&#x969C;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x6545;&#x969C;&#x7279;&#x5F81;&#x5E93;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x81EA;&#x52A8;&#x5339;&#x914D;&#x5B9A;&#x4F4D;&#x6545;&#x969C;&#xFF1B;</li><li>&#x5BF9;&#x4E8E;&#x672A;&#x77E5;&#x573A;&#x666F;&#xFF1A;&#x7EC7;&#x4E91; Metis &#x53EF;&#x6839;&#x636E;&#x6545;&#x969C;&#x7279;&#x5F81;&#x63A8;&#x7B97;&#x51FA;&#x53EF;&#x80FD;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5E76;&#x5728;&#x4EBA;&#x5DE5;&#x786E;&#x8BA4;&#x540E;&#x52A0;&#x5165;&#x6545;&#x969C;&#x7279;&#x5F81;&#x5E93;&#x3002;</li></ol><p>&#x7279;&#x5F81;&#xFF1A;&#x63D0;&#x4F9B;&#x4E09;&#x7C7B;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x7684;&#x7279;&#x5F81;&#xFF08;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x3001;&#x62DF;&#x5408;&#x7279;&#x5F81;&#x3001;&#x5206;&#x7C7B;&#x7279;&#x5F81;&#xFF09;&#x7528;&#x4E8E;&#x5BF9;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#xFF0C;&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x548C;&#x8BAD;&#x7EC3;&#x4E2D;&#x4F7F;&#x7528;&#x3002;&#x652F;&#x6301;&#x589E;&#x52A0;&#x81EA;&#x5B9A;&#x4E49;&#x7279;&#x5F81;</p><p>&#x7B97;&#x6CD5;&#xFF1A; &#x63D0;&#x4F9B;&#x5E38;&#x89C1;&#x7684;&#x51E0;&#x79CD;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5C01;&#x88C5;&#xFF08;&#x7EDF;&#x8BA1;&#x5224;&#x522B;&#x7B97;&#x6CD5;&#x3001;&#x6307;&#x6570;&#x79FB;&#x52A8;&#x5E73;&#x5747;&#x7B97;&#x6CD5;&#x3001;&#x591A;&#x9879;&#x5F0F;&#x7B97;&#x6CD5;&#x3001;GBDT&#x548C;xgboost&#x7B49;&#xFF09;&#x7528;&#x4E8E;&#x5BF9;&#x5E8F;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8054;&#x5408;&#x4EF2;&#x88C1;&#x68C0;&#x6D4B;&#x3002;</p><hr><p><a href="https://mp.weixin.qq.com/s/AXhjawsINKl6cLDV1yf6fw" target="_blank" rel="noopener">&#x767E;&#x5EA6;</a></p><ol type="1"><li>&#x9608;&#x503C;&#x68C0;&#x6D4B;</li><li>&#x7A81;&#x5347;&#x7A81;&#x964D;&#x7C7B;&#x7B97;&#x6CD5;&#xFF08;&#x68C0;&#x6D4B;&#x5747;&#x503C;&#x6F02;&#x79FB;&#xFF09;</li><li>&#x540C;&#x6BD4;&#x7C7B;&#x7B97;&#x6CD5;&#xFF08;&#x5224;&#x65AD;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x7684;&#x5747;&#x503C;&#x4E0E;&#x65B9;&#x5DEE;&#xFF09;</li><li>&#x53C2;&#x6570;&#x81EA;&#x52A8;&#x914D;&#x7F6E;</li></ol>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h2 id=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EDF;&amp;#x8BA1;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x7F51;&amp;#x7EDC;&amp;#x5F02;&amp;#x5E38;&amp;#x884C;&amp;#x4E3A;&amp;#x68C0;&amp;#x6D4B;&amp;#x6280;&amp;#x6
      
    
    </summary>
    
      <category term="Security" scheme="http://www.liufr.com/categories/Security/"/>
    
    
      <category term="Security" scheme="http://www.liufr.com/tags/Security/"/>
    
  </entry>
  
  <entry>
    <title>强化学习(3)</title>
    <link href="http://www.liufr.com/2019/05/29/%E5%BC%BA%E5%8C%96%E5%AD%A6%E4%B9%A0/2019-05-29-%E5%BC%BA%E5%8C%96%E5%AD%A6%E4%B9%A0(3)/"/>
    <id>http://www.liufr.com/2019/05/29/强化学习/2019-05-29-强化学习(3)/</id>
    <published>2019-05-28T16:00:00.000Z</published>
    <updated>2019-05-29T09:43:28.842Z</updated>
    
    <content type="html"><![CDATA[<p><strong>&#x5728;&#x7B56;&#x7565;&#x5B66;&#x4E60;</strong>&#x6839;&#x636E;&#x7B56;&#x7565;<span class="math inline">\(\pi\)</span> &#x4EA7;&#x751F;&#x7684;&#x6837;&#x672C;&#x6765;&#x5B66;&#x4E60;&#x5173;&#x4E8E;<span class="math inline">\(\pi\)</span>&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6; <strong>&#x79BB;&#x7B56;&#x7565;&#x5B66;&#x4E60;</strong>&#x6839;&#x636E;&#x53E6;&#x4E00;&#x4E2A;&#x7B56;&#x7565;<span class="math inline">\(\mu\)</span>&#x4EA7;&#x751F;&#x7684;&#x6837;&#x672C;&#x6765;&#x5B66;&#x4E60;&#x5173;&#x4E8E;<span class="math inline">\(\pi\)</span>&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;(&#x667A;&#x80FD;&#x4F53;&#x89C2;&#x5BDF;&#x4EBA;&#xFF1B;&#x91CD;&#x590D;&#x5229;&#x7528;&#x65E7;&#x7B56;&#x7565;&#xFF1B;&#x63A2;&#x7D22;&#x6027;&#x7B56;&#x7565;&#x5B66;&#x4E60;&#x6700;&#x4F18;&#x7B56;&#x7565;&#xFF1B;&#x5355;&#x4E00;&#x7B56;&#x7565;&#x53BB;&#x5B66;&#x4E60;&#x591A;&#x4E2A;&#x7B56;&#x7565;)</p><p><span class="math inline">\(\epsilon-&#x8D2A;&#x5FC3;&#x63A2;&#x7D22;\)</span>:&#x4EE5;<span class="math inline">\(1&#x2212;\epsilon\)</span>&#x6982;&#x7387;&#x9009;&#x62E9;&#x8D2A;&#x5FC3;&#x52A8;&#x4F5C; &#x4EE5;<span class="math inline">\(\epsilon\)</span>&#x6982;&#x7387;&#x968F;&#x673A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;</p><p><span class="math inline">\(\epsilon-&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#x63D0;&#x5347;\)</span>&#x7ED9;&#x5B9A;&#x4EFB;&#x610F;<span class="math inline">\(\epsilon\)</span>-&#x8D2A;&#x5FC3;&#x7B56;&#x7565;<span class="math inline">\(\pi\)</span>, &#x6839;&#x636E; <span class="math inline">\(q_{\pi}\)</span> &#x6784;&#x9020;&#x51FA;&#x65B0;&#x7684; <span class="math inline">\(\epsilon\)</span>-&#x8D2A;&#x5FC3;&#x7B56;&#x7565; <span class="math inline">\(\pi&#x2032;\)</span> &#x5177;&#x6709; &#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;, &#x5373; <span class="math inline">\(v_{\pi&#x2032;}(s) &#x2265;v_{\pi}(s)\)</span></p><p>&#x65E0;&#x9650;&#x63A2;&#x7D22;, &#x65E0;&#x7A77;&#x65F6;&#x523B;&#x6536;&#x655B;&#x4E3A;&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#xFF08;GLIE&#xFF09;&#x7684;&#x542B;&#x4E49;&#x662F;:&#x667A;&#x80FD;&#x4F53;&#x80FD;&#x591F;&#x65E0;&#x9650;&#x6B21;&#x6570;&#x5730;&#x63A2;&#x7D22;&#x6240;&#x6709;&#x7684;&#x72B6;&#x6001;-&#x52A8;&#x4F5C;&#x5BF9;;&#x7B56;&#x7565;&#x5728;&#x65E0;&#x7A77;&#x65F6;&#x523B;&#x6536;&#x655B;&#x5230;&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#x3002;</p><p>GLIE&#x8499;&#x7279;&#x5361;&#x6D1B;&#x63A7;&#x5236;&#xFF1A;&#x80FD;&#x591F;&#x6536;&#x655B;&#x5230;&#x6700;&#x4F18;&#x52A8;&#x4F5C; -&#x4EF7;&#x503C;&#x51FD;&#x6570;, <span class="math inline">\(Q(s,a) \rightarrow q&#x2217;(s,a)\)</span></p><ul><li>&#x4F7F;&#x7528;&#x7B56;&#x7565;<span class="math inline">\(\pi\)</span>&#x91C7;&#x96C6;&#x7B2C;<span class="math inline">\(k\)</span>&#x6B21;&#x4E8B;&#x4EF6;: <span class="math inline">\({S_1,A_1,R_2,...,S_T}&#x223C; \pi\)</span></li><li>&#x5BF9;&#x4E8B;&#x4EF6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x72B6;&#x6001; <span class="math inline">\(S_t\)</span> &#x548C;&#x52A8;&#x4F5C; <span class="math inline">\(A_t\)</span>:<span class="math inline">\(N(S_t,A_t)\leftarrow N(S_t,A_t)+1;Q(S_t,A_t)\leftarrow Q(S_t,A_t)+\frac{1}{N(S_t,A_t)}(G_t-Q(S_t,A_t))\)</span></li><li>&#x57FA;&#x4E8E;&#x65B0;&#x5F97;&#x5230;&#x7684;&#x52A8;&#x4F5C;-&#x4EF7;&#x503C;&#x51FD;&#x6570;&#x5BF9;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x63D0;&#x5347;<span class="math inline">\(\epsilon \leftarrow \frac{1}{k};\pi \leftarrow\epsilon-greedy(Q)\)</span></li></ul><hr><h3 id="sarsasarsa">Sarsa(S,A,R,S&apos;,A&apos;)</h3><p>&#x57FA;&#x4E8E;&#x6837;&#x672C;&#x7684;TD&#x66F4;&#x65B0; <span class="math inline">\(Q(S,A) \leftarrow Q(S,A) + \alpha(R+ \gamma Q(S^&#x2032;,A^&#x2032;)&#x2212;Q(S,A)\)</span></p><ol type="1"><li>&#x4EFB;&#x610F;&#x521D;&#x59CB;&#x5316; <span class="math inline">\(Q(s,a)\)</span>, &#x4EE4; <span class="math inline">\(Q(S_{terminal},\cdot) = 0\)</span></li><li>repeat {&#x5728;&#x6BCF;&#x6B21;&#x4E8B;&#x4EF6;&#x4E2D;:}</li><li>&#x521D;&#x59CB;&#x5316; S</li><li>&#x6839;&#x636E;&#x4ECE; Q &#x63D0;&#x53D6;&#x7684;&#x7B56;&#x7565; (&#x4F8B;&#x5982; <span class="math inline">\(\epsilon\)</span>-&#x8D2A;&#x5FC3;&#x7B56;&#x7565;) &#x5BF9; S &#x9009;&#x62E9;&#x52A8;&#x4F5C; A</li><li>repeat {&#x5BF9;&#x4E8B;&#x4EF6;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x65F6;&#x523B;}</li><li>&#x6267;&#x884C;&#x52A8;&#x4F5C; A, &#x89C2;&#x5BDF; <span class="math inline">\(R,S&#x2032;\)</span></li><li>&#x6839;&#x636E;&#x4ECE; Q &#x63D0;&#x53D6;&#x7684;&#x7B56;&#x7565; (&#x4F8B;&#x5982; <span class="math inline">\(\epsilon\)</span>-&#x8D2A;&#x5FC3;&#x7B56;&#x7565;) &#x5BF9; S&#x2032; &#x9009;&#x62E9;&#x52A8;&#x4F5C; A&#x2032;</li><li><span class="math inline">\(Q(S,A) \leftarrow Q(S,A) + \alpha(R+ \gamma Q(S^&#x2032;,A^&#x2032;)&#x2212;Q(S,A)\)</span></li><li><span class="math inline">\(S\leftarrow S^&#x2032;, A\leftarrow A^&#x2032;\)</span></li><li>until S &#x662F;&#x7EC8;&#x6B62;&#x72B6;&#x6001;</li><li>until</li></ol><p>Sarsa vs MC * MC&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x7EC8;&#x6B62;&#x72B6;&#x6001;&#xFF08;&#x4F8B;&#x5982;&#x5B66;&#x4E60;&#x5230;&#x5446;&#x5728;&#x539F;&#x5730;&#x4E0D;&#x52A8;&#xFF09; * Sarsa&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x5728;&#x5B66;&#x4E60;&#xFF0C;&#x8F6C;&#x5411;&#x5176;&#x4ED6;&#x7B56;&#x7565;</p><p>&#x4E00;&#x6B65; Sarsa vs Sarsa(<span class="math inline">\(\lambda\)</span>) * &#x4E00;&#x6B65; Sarsa &#x53EA;&#x5BF9;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x9AD8;&#x5956;&#x52B1;&#x7684;<strong>&#x6700;&#x540E;&#x4E00;&#x6B65;&#x52A8;&#x4F5C;</strong>&#x5F3A;&#x5316;&#x5B83;&#x7684;&#x4EF7;&#x503C; * &#x8D44;&#x683C;&#x8FF9;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x5BF9;&#x4E8B;&#x4EF6;&#x4E2D;&#x7684;<strong>&#x591A;&#x4E2A;&#x52A8;&#x4F5C;&#x5F3A;&#x5316;</strong>&#x5B83;&#x4EEC;&#x7684;&#x4EF7;&#x503C;,&#x6B65;&#x6570;&#x589E;&#x52A0;&#x5F3A;&#x5316;&#x5E45;&#x5EA6;&#x51CF;&#x5C0F;&#xFF1B;&#x8870;&#x51CF;&#x7387;<span class="math inline">\(\gamma\lambda\)</span></p><hr><h3 id="q-&#x5B66;&#x4E60;">Q-&#x5B66;&#x4E60;</h3><ul><li>&#x8003;&#x8651;&#x57FA;&#x4E8E;&#x52A8;&#x4F5C;-&#x4EF7;&#x503C; Q(s,a) &#x7684;&#x79BB;&#x7B56;&#x7565;&#x5B66;&#x4E60;</li><li>&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x91CD;&#x8981;&#x6027;&#x91C7;&#x6837;</li><li>&#x667A;&#x80FD;&#x4F53;&#x4E0B;&#x4E00;&#x65F6;&#x523B;&#x6267;&#x884C;&#x7684;&#x52A8;&#x4F5C;&#x662F;&#x7531;&#x884C;&#x4E3A;&#x7B56;&#x7565;&#x4EA7;&#x751F;<span class="math inline">\(A_{t+1} &#x223C; \mu(\cdot|S_t)\)</span></li><li>&#x4F46;&#x662F;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x8003;&#x8651;&#x7684;&#x662F;&#x7531;&#x53E6;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x7B56;&#x7565;&#x4EA7;&#x751F;&#x7684;&#x540E;&#x7EE7;&#x52A8;&#x4F5C; <span class="math inline">\(A^&#x2032; &#x223C; \pi(\cdot|S_t)\)</span></li><li>&#x66F4;&#x65B0; <span class="math inline">\(Q(S_t,A_t)\)</span> &#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x540E;&#x7EE7;&#x52A8;&#x4F5C;&#x7684;&#x4EF7;&#x503C;&#x903C;&#x8FD1; <span class="math inline">\(Q(St,At) \leftarrow Q(S_t,A_t)+\alpha(R_{t+1} + \gamma Q(S_{t+1},A^&#x2032;)&#x2212;Q(S_t,A_t))\)</span></li></ul><ol type="1"><li>&#x4EFB;&#x610F;&#x521D;&#x59CB;&#x5316; Q(s,a), &#x4EE4; <span class="math inline">\(Q(Sterminal,\cdot) = 0\)</span></li><li>repeat {&#x5728;&#x6BCF;&#x6B21;&#x4E8B;&#x4EF6;&#x4E2D;:}</li><li>&#x521D;&#x59CB;&#x5316; S</li><li>repeat {&#x5BF9;&#x4E8B;&#x4EF6;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x65F6;&#x523B;}</li><li>&#x6839;&#x636E;&#x4ECE; Q &#x63D0;&#x53D6;&#x7684;&#x7B56;&#x7565; (&#x4F8B;&#x5982; <span class="math inline">\(\epsilon\)</span>-&#x8D2A;&#x5FC3;&#x7B56;&#x7565;) &#x5BF9; S &#x9009;&#x62E9;&#x52A8;&#x4F5C; A</li><li>&#x6267;&#x884C;&#x52A8;&#x4F5C; A, &#x89C2;&#x5BDF; R,S&#x2032;</li><li><span class="math inline">\(Q(St,At) \leftarrow Q(S_t,A_t)+\alpha(R_{t+1} + \gamma Q(S_{t+1},A^&#x2032;)&#x2212;Q(S_t,A_t))\)</span></li><li><span class="math inline">\(S\leftarrow S^&#x2032;\)</span></li><li>until S &#x662F;&#x7EC8;&#x6B62;&#x72B6;&#x6001;</li><li>until</li></ol><p>&#x5BF9;&#x4E8E;&#x60AC;&#x5D16;&#x95EE;&#x9898;&#xFF1A; * Q-&#x5B66;&#x4E60;&#xFF1A;&#x6700;&#x4F18;&#x8DEF;&#x5F84;&#xFF1B;Sarsa&#x5B89;&#x5168;&#x8DEF;&#x5F84;&#xFF08;&#x8003;&#x8651;&#x5230;&#x4E86;&#x968F;&#x673A;&#x63A2;&#x7D22;&#xFF09; * &#x5373;&#x4F7F; Sarsa &#x5B66;&#x5230;&#x7684;&#x5B89;&#x5168;&#x8DEF;&#x5F84;&#x6BD4; Q-&#x5B66;&#x4E60;&#x7684;&#x6700;&#x4F18;&#x8DEF;&#x5F84;&#x884C;&#x8D70;&#x6B65;&#x6570;&#x8981;&#x957F;, &#x4F46;&#x662F;&#x6BCF;&#x6B21;&#x83B7;&#x5F97;&#x7684;&#x5956;&#x52B1;&#x548C;&#x5374;&#x6BD4; Q-&#x5B66;&#x4E60;&#x7684;&#x9AD8;</p><hr><p><strong>&#x5229;&#x7528;</strong>: &#x6839;&#x636E;&#x5F53;&#x524D;&#x7684;&#x4FE1;&#x606F;&#x505A;&#x51FA;&#x6700;&#x4F73;&#x7684;&#x51B3;&#x7B56;&#xFF1B; <strong>&#x63A2;&#x7D22;</strong>: &#x91C7;&#x6837;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F; &#x60F3;&#x8981;&#x505A;&#x51FA;&#x957F;&#x671F;&#x7684;&#x6700;&#x4F73;&#x51B3;</p><p>&#x5BF9;&#x4E8E;Q&#x5B66;&#x4E60;&#x6765;&#x8BF4;&#xFF0C;<span class="math inline">\(\epsilon=0\)</span>&#x5B66;&#x4E60;&#x7ED3;&#x679C;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#xFF1B;<span class="math inline">\(\epsilon\)</span>&#x8FC7;&#x5927;&#x63A2;&#x7D22;&#x6574;&#x4E2A;&#x7A7A;&#x95F4;&#xFF0C;&#x964D;&#x4F4E;&#x56DE;&#x62A5;&#x3002;&#x63A2;&#x7D22;&#x7387;&#x968F;&#x65F6;&#x95F4;&#x8870;&#x51CF;</p><p><span class="math inline">\(\epsilon\)</span>&#x8D2A;&#x5FC3;&#x6839;&#x636E;&#x52A8;&#x4F5C;-&#x4EF7;&#x503C;&#x51B3;&#x5B9A;&#x52A8;&#x4F5C;&#x88AB;&#x9009;&#x4E2D;&#x7684;&#x6982;&#x7387;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&lt;strong&gt;&amp;#x5728;&amp;#x7B56;&amp;#x7565;&amp;#x5B66;&amp;#x4E60;&lt;/strong&gt;&amp;#x6839;&amp;#x636E;&amp;#x7B56;&amp;#x7565;&lt;span class=&quot;math inline&quot;&gt;\(\pi\)&lt;/span&gt; &amp;#x4EA7
      
    
    </summary>
    
      <category term="RL" scheme="http://www.liufr.com/categories/RL/"/>
    
    
      <category term="RL" scheme="http://www.liufr.com/tags/RL/"/>
    
  </entry>
  
</feed>
